{
    "Adobe Digital Editions": [
        {
            "rating": 0.2,
            "user": "4everwityou",
            "date": "10/13/2023",
            "title": "Whoever designed this should be fired!",
            "body": "I had to download this to read ebook from my local library and it’s one of the worse apps I have ever used in my life. I have an iPhone XS Max and this app is not maximized for this phone or any phone models with the black bar at the top, because the first time of the page is right where the black bar is which means you can’t read at least 3-4 words every page! The app also loves to freeze out or just glitch out randomly, especially when you switch out of it and come back in or change screen orientation. I also like continuous scrolling for reading instead of having to swipe because it’s a hassle, not to mention if you are reading in a dark/dim space it has to load every page (which takes a bit) and the loading screen is WHITE while I’m reading in dark mode! I honestly can’t believe this is a published app! I wish I could use the books app right on my iPhone for the library materials but sadly I can’t. This is really a pity and I hope adobe fixes this disaster soon so people can actually use it to read or study.",
            "region": "us"
        },
        {
            "rating": 0.4,
            "user": "LeahIrving",
            "date": "08/05/2017",
            "title": "Not for School or Recreation",
            "body": "There are problems that me and all of my classmates mentioned while we were using this app. The main problem is that it lags and stops a lot if you are using it offline. When you flip through pages too much, it starts to freeze for a while before you can flip the pages again. So when we were looking for a certain page in our ebook, the app lagged every 10-15 seconds. This happens less frequently with internet connection, but it can still happen. Especially if the app has not loaded certain parts of the book yet.Another problem is that there isn't a simpler way to find a certain page. Even though the app has a scroller that helps you jump through the pages, it doesn't indicate which page you're going to flip to. If there's a way you can do this in the future, that would be good as well.TL;DR I don't recommend this app for anyone who wants to use this for ebooks. Whether for educational or recreational purposes. It's better if you find an app that can do so much better until Adobe fixes these problems. It's not worth it.",
            "region": "us"
        },
        {
            "rating": 0.2,
            "user": "Shambricia",
            "date": "02/18/2021",
            "title": "Worst app I have ever used",
            "body": "I just purchased an eBook and it required me to download this app to read it. I spent $40 on it. I want to share my extreme dissatisfaction with the quality of the eBook format. It was ridiculously challenging to download and I spent nearly 40 minutes trying to figure out how to download it. I finally figured out what the issue was by looking at the comments on the IOS reviews page from several others that had similar issues. The trouble was that you cannot use safari to download it so I had to get an all new internet browser to download it. Then once it was finally downloaded I was incredibly disappointed in the quality of the e-reader itself. The content in the book is great. I know because I have the paperback version. But I was looking for an electronic version that I could take on the road with me and easily access when away from home. When you read the book in the eBook format it looks awful. Words are cut off, you can't even finish reading complete sentences because the formatting is all wonky. This app is absolutely is ridiculous. The quality is so poor it is completely unreadable.",
            "region": "us"
        },
        {
            "rating": 0.2,
            "user": "NitNicked in LA",
            "date": "08/05/2022",
            "title": "Who designed this stinker?",
            "body": "I have been reading books on my phone for more than a decade, and I’ve use lots of different apps to do it over time. This feels like the worst of a first generation app: The majority of the screen space is blank around a tiny narrow column of text that looks ridiculous justified, because it truly creates distracting volumes of white space down the middle of the page. Better apps designed for actual readers go closer to the margin of the screen, allow you to stop justifying the text when doing so avoids that distracting white space that literally makes it harder to read, or to keep the justification when it is appropriate for the text.Adobe’s name is synonymous with graphic design, programs like Photoshop are now so powerful and flexible that that very flexibility is intimidating to many new users. It seems clear that they forgot that flexibility when creating this terrible implementation of an e-book reader.   It forces screens to look like weirdly distorted printed and pages and ignores years of experience that make better readers actually a pleasure to use.",
            "region": "us"
        },
        {
            "rating": 0.2,
            "user": "Sad Bookreader",
            "date": "12/15/2023",
            "title": "Wow people weren’t joking (very bad app)",
            "body": "I just wanted to read an e-book from my local library and had to download this app to read the book. I saw all the one star reviews and got a little freaked out but I still gave it a try because I really wanted to read this book. There’s no real tutorial on how it works but I figured it out on my own after 10 minutes. Got the book into the app and there’s no way to actually read it? I read the title page, the acknowledgement page, and then the remaining pages after that were blank? Like blank pages or blank pages with like black smears? I guess the pages don’t display properly on the screen once the book is in the app. I mean there were literally no words on the remaining pages after the acknowledgment page. Don’t even waste your time. Even if you do everything right, once you actually download and open the book, you won’t be able to load the contents of the book. Would give 0 stars if I could but hey at least maybe I can save someone time with my review.",
            "region": "us"
        },
        {
            "rating": 0.2,
            "user": "Elfmantoo",
            "date": "01/05/2019",
            "title": "ADE needs much more work!",
            "body": "I’m disappointed in ADE. I had no problem loading in DRM ePub and reading them. However, I find ADE very lacking in features.  Features like word definitions, phrase translation, underlining and highlighting in various colors, ability to google and hotlink to places, people and art described in ebooks.  I was a big fan and user for many years of Neosoar another DRM e reader.  Unfortunately, they seem to be recently out business.  It took a while for Neosoar to get to a point of near perfection with these features I’ve listed above.  But the absolute best was your annotations were linked to Dropbox.  So, any additions or notations or hotlinks would be saved in Dropbox.  If you changed or upgraded your e reader you would upload the DRM e book and sync with Dropbox and all your annotations would appear.  You would not lose any annotations. Neosoar is a great loss to those of us need an e reader that is fully connected to power of the internet.  It is unfortunate that ADE does not measure up.  In the future it could if Adobe puts in the effort.",
            "region": "us"
        },
        {
            "rating": 0.2,
            "user": "wonnov",
            "date": "01/19/2023",
            "title": "Only using cause I have to",
            "body": "As someone who has had to continue using this app on desktop and iOS for years now because I teach from a textbook that is only available in this app digitally, I can honestly say, it’s the worst. It feels from experience like Adobe is doing the bare minimum to keep the app alive.  A list of things I experience:-Random pages that look fine on desktop look blown out and unreadable on iPad or iPhone. -Authorizing e-books can take multiple attempts and restarted the app before they appear.-Navigation and scrolling through the book is clunky only at a single speed.-Clicking and dragging to highlight text (YES it does actually have a HIGHLIGHT feature!) is clunky: Saved highlights have disappeared and you have to click and drag above a sentence to highlight it as if the entire alignment of words is off.  So if I want to click and drag, I need to do so an inch or less above the actually words to effect them.  -Hidden adware install on the desktop version. If you are not careful it comes with Norton Antivirus which will install with the program if you aren’t careful to hit no on install I could go on. I have asked my textbook manufacture to use another product.  I ask Adobe to make this app, at least functional, but preferably at least competitive to other e-book readers. For now, I suffer through.",
            "region": "us"
        },
        {
            "rating": 0.2,
            "user": "EmoEric87",
            "date": "01/05/2023",
            "title": "Dead App!! How not to design an e-reader app",
            "body": "UPDATE: You should know this app is no longer under development. If you can, email your ebook’s publisher and ask for an alternative to this app…If you’ve ever thought to yourself, how can we make the process of obtaining a digital copy of a book more difficult and then, once the poor idiots figure out how to do it, how can we make the experience as excruciating, rudimentary, and utterly disconnected from the rest of the 21st century as possible... you probably designed this app. The designers haven’t even figured out how to fit pages onto your device. YOU CANT EVEN READ THE PAGES CORRECTLY, because the app hasn’t been updated to Apple’s own screen real estate standards. The notch on my iPhone fully obscures the top of every page. What person who wants to read would actually choose this app? Has anyone from Adobe who actually reads books tried to use this app? My guess is no.",
            "region": "us"
        },
        {
            "rating": 0.2,
            "user": "SunnerLife",
            "date": "02/26/2022",
            "title": "Adobe, PUH LEEESE give this app some attention…",
            "body": "I have recently needed to download this app since an ebook was only available through Adobe’s DRM. So far the MacOS version is serviceable—not the best navigation but you can get around. The iOS version is unusable. It crashes during searches, pages are missing or unreadable (don’t know if this is a scanning issue, but why then does it work on the macOS version?), and navigation is neglible. Many many people read ePubs on a tablet like the iPad, so it boggles my mind that a company like Adobe wouldn’t put some effort into this product. I imagine with Amazon’s Kindle and Apple’s iBooks taking a lot of the market share, perhaps there is not enough market left to tempt them. But I suspect that there are plenty of authors/publishers who would like to skip the massive fees that both companies impose, so there is a real Power-to-the-Author-People market that can develop here if they play their cards right.",
            "region": "us"
        },
        {
            "rating": 0.4,
            "user": "Talon110",
            "date": "07/22/2022",
            "title": "Bad, but not unusable",
            "body": "On first use, the app appears unusable (at least when viewing some books) as other users state. The default color scheme (middle button icon at the bottom when viewing a book, leftmost option) seems to be the culprit. The two other color options appear to display my book correctly.But even then, this is a very basic e-reader for DRM protected content. You can highlight in what appears to be only a single color, bookmark pages, view the table of contents, view all of your highlights and bookmarks, search text, and display content in two (functional) color schemes (white text/black background, and black text/brown background). That’s about it for functionality. Highlights are ugly and are broken up by the spacing between highlighted words. Recommend looking elsewhere; this app isn’t worth its free price tag.",
            "region": "us"
        },
        {
            "rating": 0.2,
            "user": "GoodMusicFan44",
            "date": "2019-08-12",
            "title": "Terrible app",
            "body": "How can anyone be expected to use this.Highlighting does not work. Can’t make notes with Apple Pencil. Why would a any company want to use this app for online learning? DRM Protection prevents using any other apps to open material. What a joke.",
            "region": "ca"
        },
        {
            "rating": 0.2,
            "user": "Melinda in PG",
            "date": "2020-07-04",
            "title": "This wretched app crashed my iPad repeatedly",
            "body": "I was trying to use Adobe Digital Editions to read publisher’s advance review copies because they have DRM and require a reader with Adobe ID. This app is, frankly, garbage. It got to the point where it finally wouldn’t do anything but crash my iPad whenever I opened a book. After discovering an alternative to this wretched app, I have successfully downloaded the Bluefire Reader App instead and will be using that in the future.",
            "region": "ca"
        },
        {
            "rating": 0.2,
            "user": "Hidkff",
            "date": "2021-06-22",
            "title": "Don’t buy this",
            "body": "Absolutely terrible, slow and doesn’t even work properly",
            "region": "ca"
        },
        {
            "rating": 0.2,
            "user": "KokoPerez",
            "date": "2021-06-12",
            "title": "Horrible app",
            "body": "Knowing Adobe app I was expecting much better. It’s not practical, there are many glitches, the scrolling through pages is terrible and more!! If I wasn’t stuck with it for school (since it’s the only app authorized for the book I bought) I would most definitely never recommend this app.",
            "region": "ca"
        },
        {
            "rating": 0.2,
            "user": "Bball Brenna",
            "date": "2021-06-07",
            "title": "Garbage",
            "body": "This app is terrible. Computer version isn’t any better. Crashes every 5 minutes, causing me to lose what I’ve highlighted. It will get slow and glitchy randomly and crash shortly thereafter. Unfortunately, this was the app I was forced to use to claim the digital version of the textbook I purchased.",
            "region": "ca"
        },
        {
            "rating": 0.2,
            "user": "whatever0990666",
            "date": "2020-09-21",
            "title": "Awful",
            "body": "Terrible loading glitches, constant highlighting and note glitches, such a shame to have to read a purchased book on here. Makes the book a waste of money.",
            "region": "ca"
        },
        {
            "rating": 0.2,
            "user": "Andrewwillis89",
            "date": "2019-06-05",
            "title": "HORRIBLE APP",
            "body": "This app is so terrible in functionality, I’d rather pay $19 for a book from Kindle than struggle with this app to get it for free. Really a terrible app. Impossible to login. Really terrible integration. The desktop version of this app is even worse. You cannot customize or change preferences. Impossible to do anything with this app. I would give it zero stars if I could.",
            "region": "ca"
        },
        {
            "rating": 0.2,
            "user": "Julie Côté Audet",
            "date": "2024-01-11",
            "title": "Ne lis pas les livre",
            "body": "L’application ne reussit pas a lire les livres. Même le livre de adobe nest pas entièrement lisible.",
            "region": "ca"
        },
        {
            "rating": 0.2,
            "user": "Hamster Collie",
            "date": "2022-12-26",
            "title": "What a piece of rubbish!",
            "body": "Can’t even display its own manual properly. Simply doesn’t work (on iPhone 13 mini).",
            "region": "ca"
        },
        {
            "rating": 0.2,
            "user": "lebdave",
            "date": "2022-12-20",
            "title": "Another failure by Adobe",
            "body": "Tell me Adobe made this app without telling me Adobe made this app. Frequent crashes. Extremely slow. Download failed due to “connection error” without having any connection error. Can’t properly handle pdf (their own file format). Does not display the pages in the right order. Missing pages. Colors are all messed up. When reading (or should I say trying to read) a comic, bubbles and even images are not properly aligned. Doesn’t open automatically it’s own files. Takes 2 minutes to download 50 MB. Latest version update: 2 years ago. If you are an ebook provider, please select another company to manage your products.",
            "region": "ca"
        },
        {
            "rating": 0.2,
            "user": "Fartato",
            "date": "20/08/2023",
            "title": "You’ve heard of user friendly, now get ready for user hostile!",
            "body": "Despite its presence on the App Store this is a non-functional app in every meaningful way. Yes the software does run on iOS and does respond to user inputs but that is all that can be said. Page numbers in contents pages do not function correctly. You can’t jump to a page by pressing the page numbers which is fine if it’s a 10 year old pdf but unacceptable for content specifically made for the platform. The jump to page feature does not work at all, it’s purely decoration. Content will randomly not display at all depending on the zoom level. Each page seems to require a different degree of zoom to actually display content. This all complements the horrific DRM implementation: if you don’t sign in before downloading something you will permanently lock yourself out of opening that file! All this app is is a glorified pdf reader with  DRM and it fails to do either. A legitimately unusable piece of software. It may be free but you pay with your sanity.",
            "region": "au"
        },
        {
            "rating": 0.2,
            "user": "UI/UX student",
            "date": "11/06/2022",
            "title": "What even is this?",
            "body": "I only downloaded this because I had to for a uni book, and I still can’t even access it. Is this really an adobe product? I have the creative cloud since I’m a design student and use a multitude of adobe apps with ease. Nothing has caused me more frustration than this app. If you have an iPad don’t bother with this. I am now having to view my book chapter by chapter while studying for an exam because at least this way I can view it on pdf viewer. The introduction book on this app doesn’t load properly, half the pages are faded, pixilated and hard to read. I have deleted and downloaded this app multiple times and the issues stayed the same. Don’t bother with this app, save yourself the headache and look for alternative solutions.",
            "region": "au"
        },
        {
            "rating": 0.2,
            "user": "Redranter",
            "date": "13/08/2023",
            "title": "The one star reviews are right - this is super buggy",
            "body": "Unfortunately, the book I bought was restricted to Adobe Digital Editions (which was not disclosed). As the other one-star reviews indicate, this is barely a reading app and worse, it is extremely buggy. I opened the iPad version and there were blank pages and pages with very faint writing throughout - it turns out that this can be fixed by switching to dark or sepia mode, but this bug has been reported since 2021 and nothing has been done to fix it (or indeed even just to default to sepia mode so you don’t think your file is broken). In future, will always purchase paper rather than anything that is limited to ADE.",
            "region": "au"
        },
        {
            "rating": 0.4,
            "user": "lordshrimp5",
            "date": "18/11/2023",
            "title": "Actually works, but it is incredibly unintuitive!",
            "body": "If you are a student and required to download Proquest Ebook files, you have probably been pulling your hair out over this app. The first thing you have to do is download the related acsm files then manually share them with this app. You will probably notice a lot of blank pages when you try to read your ebook; to get around this issue you have to tap on the page to find a sun icon. Tap on that icon to change the text display, then the missing pages should turn up. I really wish Adobe would listen to all these one star reviews and make their app more user friendly!",
            "region": "au"
        },
        {
            "rating": 0.2,
            "user": "Kate.Kaixin.Xie",
            "date": "02/02/2023",
            "title": "As bad as an ebook reader can get",
            "body": "I understand why online collections need DRM. But oh my goodness, can someone please create an ebook DRM format that allows you to access the book in other apps???? This app is downright awful. I prefer to use apps that give you a set of nice fonts to use; that gave animated page turns: etc. Because ultimately I prefer physical books, but ebooks are so convenient and often the only option available.This app is about as ugly and barebones as an ebook reader can get and even then, it seems that people often have problems with it. Seriously I find myself accessing books err... \"Another way\", which I won't go into detail about... And sometimes I will buy the ebook if I know I'm going to read it all (not feasible for uni research though) even though I would otherwise happily use the library's resources. Purely because I really dislike this app and its PC counterpart. Given that this is Adobe, the same company that produces Photoshop, how is it that the ONE DRM compatible app for ebooks is so.... This??",
            "region": "au"
        },
        {
            "rating": 0.2,
            "user": "Swagga Singh",
            "date": "11/03/2019",
            "title": "One time user",
            "body": "First time I’ve ever downloaded an e-book and this is my experience. I installed ADE on my Windows10 device and it works fine. I downloaded it on my iPhone XS, noticing the one star average, but proceeded anyway. After all, I haven’t got time for reviews.  Can I just say, along with all the other one star users, the app is horrible. I thought it was just me, until I remembered the rating. I cannot believe this is an Adobe product. I wouldn’t have used it if the e-book I downloaded didn’t require me to! Unbelievable in today’s day and age that an app so unreliable from a quality brand exists. Shame on Adobe and shame on me for not just buying a hardcopy book instead.",
            "region": "au"
        },
        {
            "rating": 0.2,
            "user": "Hartmaaaa",
            "date": "23/09/2018",
            "title": "Embarrassingly bad...",
            "body": "Worst reader I’ve ever used. Bought an online textbook that would not allow Kindle or IBooks and makes you download the App. It works ‘okay’ on Mac computer, but is horrendous on iPad. The page number won’t change. The table of contents link won’t work to take you to a specific page. I’ll be on one page, move one page ahead, the page number won’t change but it skips ahead to a random page in another chapter. Was so frustratingly awful I almost threw my iPad out the window but alas, Not iPads fault.  Whoever built this app should be ashamed. Work harder to get a product to at least work, if not have the functionality of iBooks.",
            "region": "au"
        },
        {
            "rating": 0.2,
            "user": "Fifuieividkfig",
            "date": "07/07/2023",
            "title": "Completely unusable. Don’t bother.",
            "body": "Can’t even read the getting started document that comes with this thing to figure out how to get my books to work because half the pages appear blank or as if someone’s turned the exposure and contrast all the way up. Can’t sign in to adobe either as it says my username/password are incorrect (I’m trying to sign in with my student account) despite the fact that I’ve successfully been able to log in to every other adobe app using these. The app is so bad and it absolutely astonishing that this comes from Adobe of all companies.",
            "region": "au"
        },
        {
            "rating": 0.2,
            "user": "Faylorr",
            "date": "03/05/2022",
            "title": "Uggh.",
            "body": "I purchased a book months ago and read it. As it was a reference book I am wanting to read it again and there are only a couple of pages opening. Some are blurred out and other pages are patchy or blank. Not happy. All I want to do is read the book I purchased. Tried to put app on my other device using correct password and purchases don’t even show up there. If I could have downloaded it into iBooks I would have but adobe didn’t give me that option.This is just blatant stealing. I now have no book and will never use this terrible app again.",
            "region": "au"
        },
        {
            "rating": 0.2,
            "user": "LP Rulez",
            "date": "16/01/2022",
            "title": "Bane of my existence",
            "body": "I truly have no idea how Adobe have tricked every higher education provider into using this program to rent out their ebooks.  I have used so many other free readers that are fully functional.  This program won't even allow the most basic functions (e.g. continuous scrolling).  Heaven forbid I try to highlight text or search a document - it crashes instantly.  This is just on the computer - I can't even open books from my university on my iPad at all.  Pointless and awful.  Are universities paying Adobe for this???  I certainly hope not.",
            "region": "au"
        },
        {
            "rating": 0.2,
            "user": "Duvroneibtpv39)39?/6?30!:.",
            "date": "19/05/2023",
            "title": "Just so bad",
            "body": "I had to use this app to download a book for uni. The website gave me no other option than this awful app. It doesn’t work! None of the pages downloaded correctly, it was just white pages with small smudges of black where the words were supposed to be. I couldn’t read a thing past the two first pages. I don’t know who decided this app was ready to be released to the public, but they were dead wrong. Don’t bother using this app, it’s the absolute worst. If you need a pdf reader/markup app, try CollaNote: it’s great, really easy to use, free, with no ads, and best of all, it actually makes readable pdfs!",
            "region": "nz"
        },
        {
            "rating": 0.2,
            "user": "aidan_donald",
            "date": "03/12/2021",
            "title": "What even is this app?",
            "body": "Honestly baffled as to how a twenty-four BILLION dollar corporation can produce such a comically terrible app.The text is partially covered by the iPhone’s notch and is so small that you need to be an ant to read it. No resize option, but there is a buggy zoom feature. Crashes randomly. Figured out that you need to quit the app, safari, download, share, open with digital editions, enter adobe ID just to import books, possibly twice depending on whether or not it actually appears in your library.Oh and the UI text is completely misaligned.",
            "region": "nz"
        },
        {
            "rating": 0.2,
            "user": "ptresdghknffrrscvb",
            "date": "27/10/2021",
            "title": "So restrictive it’s useless",
            "body": "What’s the point of highlighting an ADE pdf when you can’t extract, save, or even get an annotation summary of your highlights. The app also has no capability to recognise hyperlinks within the document. Highlighting text is as painful as dragging fingernails on chalkboard. ADE doesn’t even sync books across authorised devices. I had no choice but to use ADE because that’s what my library uses. What a waste of time using this app when I can’t rerieve the info I need for my research!",
            "region": "nz"
        },
        {
            "rating": 0.4,
            "user": "HendawgFitz",
            "date": "04/02/2021",
            "title": "A necessary evil",
            "body": "My university library requires Adobe Digital Editions to access its ebook collection. The Mac and Windows versions work well. The iOS version is a pale imitation.Zooming in on pages is extremely janky. There is very limited support for annotation and none at all for Apple Pencil. The search feature usually does not work. At least it usually displays readable text 🤷🏻‍♂️When I read ebooks from my uni library and I don't have access to a Mac or Windows machine I have to use this. It hurts though.",
            "region": "nz"
        },
        {
            "rating": 0.2,
            "user": "Da-Rain",
            "date": "02/06/2022",
            "title": "Why is this the standard?",
            "body": "Such a bad app, same can be said for the desktop version. Adobe isn’t a small company either, nor are their other products designed with such lack of care. What’s worse is that there is no other alternative for borrowing books off certain websites. You have to use Digital Editions.",
            "region": "nz"
        },
        {
            "rating": 0.2,
            "user": "AhSeeBoo",
            "date": "17/01/2024",
            "title": "Ridiculous !",
            "body": "I’ve just downloaded this app and there seems to be no way t9 use it for downloading books from my library to my Kobo Nia reader.   I had to give it something, so 1 star - which was too much.  This app is rubbish and I’d like Adobe to sort it out and make it useable.",
            "region": "nz"
        },
        {
            "rating": 0.6,
            "user": "gellupth",
            "date": "19/01/2020",
            "title": "Colour Highlighters and support Apple Pencil",
            "body": "I want it easier to use, with different highlights colour. I had to use this app to read text boom from our uni library. But it so annoying that I cannot use Apple Pencil to highlight it directly. I want more options for highlights and draw.",
            "region": "nz"
        },
        {
            "rating": 0.2,
            "user": "ExcusesofPuppets",
            "date": "30/08/2021",
            "title": "Terrible",
            "body": "University requirement. Even DRM free stuff needed an account. Even then, the University library account didn’t work, needed yet ANOTHER account.  No thanks. Also iOS version crashed a lot, not the same as the desktop version. Awful.",
            "region": "nz"
        },
        {
            "rating": 0.4,
            "user": "KaspR18",
            "date": "03/01/2019",
            "title": "How to return books to the library?",
            "body": "Is there a way to return books to the library on the iOS version of Adobe Digital Editions? I don’t have a computer and I don’t find any options to return books from my iPad... Such a pity!",
            "region": "nz"
        },
        {
            "rating": 0.2,
            "user": "rowsburn",
            "date": "25/09/2019",
            "title": "Reasonably useless",
            "body": "Constantly crashes, can’t access pages searched (blank page shows up), won’t sync to computer, but so many academic websites require this app to read books. Slow and limited.",
            "region": "nz"
        }
    ],
    "Apple Books": [
        {
            "rating": 0.8,
            "user": "AN-G!",
            "date": "09/08/2023",
            "title": "Love the App, does have some glitches",
            "body": "I do love this app. I did like it when I could put large PDF’s in here. My favorite thing to do is have the book read to me via the read function (by dragging two fingers from the top of the screen, or by activating the read control via the Accessibility settings menu. Mainly because I have focus issues and I like following along, but also because I can listen and do other things as well. I like how the portion being read is highlighted and it scrolls as it’s reading. I would like to offer a suggestion that I think many will love, why not offer a book print and audio option so that it could do that via the app and I can listen on CarPlay. I know some authors read their own books for audio books and would love being able to buy a book that also offers the audio so I can follow along when I can and hear the author’s reading it to me.   Recently using the read function has been glitchy and it’s been skipping parts, especially in the end of the chapters. I’m not sure if this is what other reviewers were talking about, but this is what I experience when using the read function.",
            "region": "us"
        },
        {
            "rating": 0.4,
            "user": "River Mor",
            "date": "12/24/2022",
            "title": "Scroll Reading Issues with iOS 16",
            "body": "Frustration with iOS 16 disfunction leaves me wondering if the upgrade was tested before being released. I agree with the previous reviewer and won’t re-address those same concerns. However, I will address the book mark and scroll reading  issues.  The slightest touch while scroll reading activates the red book mark which (because I’m reading) needs to be cleared. Sometimes touching the red bookmark is enough to clear it, but other times you have to open the Themes and Settings menu and remove the bookmark there as well. This seems to be more sensitive with iOS 16 than previous versions.  Even more frustrating, though; when using the scroll reading feature near the end of a chapter the (scroll) screen jumps ahead - sometimes paragraphs ahead, sometimes pages ahead, sometimes to the end of the current chapter, or other times to the end of the book. Imagine trying to find where you were reading last when that happens. (An opportunity to use the search feature as long as you have the exact verbiage.)Anyway, to fix the jumping scroll issue I change from scroll to page turning or sometimes I have decreased the font size, and then sometimes I have to close the book because it won’t reload after a font size change. And since the pages are renumbered you can’t just go to your last page and continue reading. Please FIX this bug in the near future. Thank you.",
            "region": "us"
        },
        {
            "rating": 1.0,
            "user": "SpringByJ",
            "date": "03/23/2024",
            "title": "Can be the best reader",
            "body": "Dear Books Product Team, I am delighted to be able to reach out to you in this manner! I am a devoted Apple user and a passionate book enthusiast :P. I thoroughly enjoy your Books app, whether it's on my Mac, iPhone, or iPad. The Books app consistently provides me with a seamless and enjoyable reading experience, and I am truly grateful for your hard work! However, one minor issue I've encountered is that when I read books in the epub format, although I've noticed that the Books app allows for customizing fonts, unfortunately, the selection of fonts provided by the app is a bit limited and doesn't include my preferred ones. I attempted to find a solution through Google but was unsuccessful. The response I received was that the Books app doesn't offer additional font options (sad face). I earnestly request if it would be possible for you to add more font options, preferably allowing the import of TrueType Font files or selecting fonts from the system. Of course, it would be fantastic if I could also choose fonts that I have installed in my system (like Pages, Numbers app). Thank you sincerely! I hope you can accommodate the request of this fervent Apple Books enthusiast. Once again, thank you! Wishing you all the best!",
            "region": "us"
        },
        {
            "rating": 0.2,
            "user": "shi hi an",
            "date": "07/05/2022",
            "title": "Works, but still lots of bugs, and slowly degrading",
            "body": "I enjoy reading books with this app, but there are still a lot of glitches from my last review. 1: light reading books that come in volumes are still not stacking up for some reason. The author’s name hasn’t changed for the series, so the is no reason it can’t consolidate them to one group rather than have each book separated. 2: sometimes when the page, it goes to a blank page. I have to swipe a previous page or two and then go back to the said page. Lastly: both my iPhone 12 and iPad Air app crashes sometimes. Not too sure why this hasn’t been addressed, but it’s been years since the app came out. The more software continues to advance, it should reduce the problems, not create more. Would like to see my money’s worth purchasing books from this app be put to use on updating the app (REAL updates). It would be much appreciated. But I believe my words are being unheard. Some books I pre-ordered are not showing up. When I hit “View Item” it says that the said book is no longer available in this country or region. Mind the fact, that I waited over a month for the book and now I can’t read it. Not too sure if it’s due to technical issues or incompetent functions. All I know is that this app is getting worse and no one is fixing it. My advice to those looking at this app, keep what you got and find another iBook app. This was once at the top of it’s peak and now it’s falling fast.",
            "region": "us"
        },
        {
            "rating": 0.2,
            "user": "SendingOutAnSOS",
            "date": "12/19/2022",
            "title": "How dare you!",
            "body": "UPDATE: the more I use this updated version of Books the more I HATE it. The stupid little thing in the bottom righthand corner to control everything is the worst designed button in the history of screens. FIRE THE ENTIRE DESIGN TEAM WHO TOOK ONE OF APPLE’S BEST APPS AND TRASHED IT. Since 2010; I have but using iPads to read all of my books. The design, the layout, was absolutely stellar from the very beginning. The graphics of turning a page made the transition from reading a paper book to a virtual book seamless. But then 2022 came along with the release of the latest iOS for iPads. An apple, with its horrible wisdom decided to hand over this project to someone who obviously has never read a paper book. I am furious. As a loyal Apple user for over 25 years, I am seriously open to other providers not just for reading books; but I am ready to go back to paper books, giving up my Apple Watch for real watch, putting down my iPhone, and maybe even considering going with another type of cell phone that is not an apple. With your meals price increases for Apple services, I’ve already canceled those and I’m ready to give up everything that is Apple. Apples become too greedy without any consideration for its very loyal customers changing books it’s just the latest, possibly the straw that breaks many of our backs interest to taking any more from Apple. Yes I am upset. Yes, I have been loyal for many many years. Yes, I really may leave.",
            "region": "us"
        },
        {
            "rating": 0.4,
            "user": "Nick_Wilde_403",
            "date": "02/15/2023",
            "title": "Ruined by new update.",
            "body": "The most recent update has made this perhaps the most frustrating experience I've had yet while trying to read and annotate. The previous format made it easy to highlight, scroll between pages, add notes, clear highlight marks, find the index (a crazy concept now), and overall be able to hold my device while using the app. \tThis recent update has made it feel more like I'm scrolling through my camera roll of screenshots that someone took of book pages than it actually feels like I'm attempting to read a formatted book. The highlighting feature is almost twice as twitchy and jumpy as before, and I find it even harder to remove highlighting that was done by mistake. Not only that, but instead of being able to tap a drop-down menu for the book's index, you now need to tap the screen three or four times before it registers that you don't want to just be in image mode, and that you'd actually like to access another menu. This menu, which was formerly easy to use and access, has been relegated to a very tiny and hard-to-find button in the bottom corner that doesn't always show up. In addition to that frustration, it's much harder to operate than the last menu. \tMy best description of the new update is that they tried to fix something that wasn't really broken, and in doing so just made it worse.",
            "region": "us"
        },
        {
            "rating": 0.2,
            "user": "scztt",
            "date": "05/13/2022",
            "title": "Sync and library bugs make this almost unusable",
            "body": "Almost every time I launch the app, large chunks of my library are mysteriously missing - often including things I was actively reading fifteen minutes before. If I wait patiently with the app open for 3, 4, 5 minutes (no progress indicator or “syncing” message, you just have to trust it….) eventually things will slowly reappear and I’ll see library items again - though given how random the behavior is, I’m never quite sure if it’s all there. Sometimes the resync never happens and I have to do a ritual of settings changes, restarts, and reinstalls to get it back. The app will aggressively delete local copies of things (presumably to save space, but it’s not like ebooks are very large….), including very recently opened files, which has left me more than once with an empty library over a long flight where I was literally reading something on the train to the airport. Really hard to grok how an app could get basic workflows like “I want to continue reading the book I was reading yesterday” so wrong, but somehow this only seems to work like 25% of the time. The desktop is equally broken, though somehow in slightly different ways. Somehow this would be even slightly excusable if the app had any features at all, but tbh it’s a very basic and utilitarian reader app - it’s simple and would be great if it reliably did the three or four things it sets out to do.",
            "region": "us"
        },
        {
            "rating": 0.2,
            "user": "ChristineFlip11",
            "date": "04/01/2023",
            "title": "So many issues…",
            "body": "Even before the most recent changes I have been having issues with books in the same series saving all as separate books or books 1 and 3 together, 3, 4, and 5 separately, and then books 7-9 together. In the folders where a few are grouped together it prompts me to re-buy the books I ALREADY OWN. I contacted Apple for help with no resolution. As an avid reader with DOZENS of books it is extremely frustrating to have series separated like this! Now, after this new update, the entire app is no longer user friendly. The font, font sizes, spacing, etc. looks awful. Trying to access specific chapters, settings, bookmarks, and the search bar is super inconvenient. And as small as it seems, having to hit the X in the top right corner to get out of the book is just awful. Due to these changes, I am currently moving all of my favorite books and unfinished series over to the kindle app. It’s depressing to rebuy all of my books on another platform simply bc the developers made all of these changes, clearly without even seeking the opinions of those who use this app. It’s disappointing that Apple continues to destroy so many things that were the reason many of us chose to utilize their products. It has been 11.5 years since the loss of a pioneer whose work is slowly being deconstructed by those who took over his company.",
            "region": "us"
        },
        {
            "rating": 0.2,
            "user": "Snap Alongs",
            "date": "01/26/2023",
            "title": "Such a bad update iOS 16 (facepalm)",
            "body": "Have to agree with other reviewers re: iOS 16 update. Wow. App has had most of the useful features gutted and what’s left is a dysfunctional mess. For starters PLEASE bring back the page turning animation. If I wanted to feel like I’m readim* a spreadsheet at work, I’d read a spreadsheet at work. Next - I Tried to bold fonts to help with my bad eye issues and some portions of the book are in bold, some are not. It’s completely random, sometimes with the bold text stopping in the middle of a paragraph or even middle of a word. Previous books no longer open to my last location, but start at the beginning or random locations in the book, leaving me to flip flip flip flip flip flip back trying to find where I left off. Beyond frustrating. There is a quite long lag when opening a book, often leaving me to wonder if the app has crashed. Not a fan of all the functions relegated to the pop up menu tab instead of being readily available at the top of the screen since I am not happy when I have to have a scavenger hunt just to find basic functions. This was not an “update”. It was a huge step backwards. Someone at Apple really needs to take a course in ui functionality and user friendly interface design. Why change the great things about this app and replace it with this mess?",
            "region": "us"
        },
        {
            "rating": 0.2,
            "user": "DD West",
            "date": "06/25/2023",
            "title": "Absolutely the worst book app ever created",
            "body": "I’m at 100% battery. 6 gb of storage left. My phone won’t download any books, just tosses them into iCloud. They want you to pay for iCloud. They don’t care if you’re a student just trying to do some homework. Your phone won’t care if you’re not on low power mode and have a lot of storage. You will not be able to get a single assignment done unless you open the PDF in a different app. This “app” is GENUINELY a scam, it’s preventing me from getting courses done that I have paid real money for. I’ve spent 30 minutes now just trying to keep the book open to read the info I need. It just keeps on closing and crashing. I keep having to REDOWNLOAD the book EVERY time that happens. It is a scam. I will be sharing all of my screen recordings and screen shots with the DCA. This is quite literally preposterous. It’s become a normal school standard to have books on your tablets and phones and laptops, yet, these people are trying to FORCE their UNNECESSARY extra services on you. When you literally are just trying to get some work done. And even if it DOES finish downloading and SEEMS like it’s in your iCloud library, oh u wanna open your notes app? HAVE FUN SPENDING ANOTHER 5 MINUTES DOWNLOADING THE BOOK AGAIN???? LIKE WHAT????YOUVE COST ME 30 MINUTES OF STRAIGHT TIME. STRESSFUL PAINFUL. DCA TIME ON GOD I AM GONNA GO CRAZY",
            "region": "us"
        },
        {
            "rating": 0.8,
            "user": "CORNYSTONE",
            "date": "2023-02-07",
            "title": "New update is mid",
            "body": "I love this app but the new update sucks. I can’t see how many pages are left in a chapter and I miss the old animation for when the page turns. Now it just looks like I’m reading through a PowerPoint",
            "region": "ca"
        },
        {
            "rating": 0.6,
            "user": "YoGoerz",
            "date": "2021-09-30",
            "title": "Beautiful, but limited",
            "body": "Really like reading with this app and have found the award system fun and rewarding!I do want to see syncing for audiobooks that I have downloaded from other sources, even if it uses my iCloud storage. Currently having to manually sync over a wire is not really a modern or practical solution, and is an impossible solution for folks that don’t have a traditional computer.Additionally, would like to see the ability to modify metadata for files in this app. Like in the Music and TV apps where you can change details like artist, director, etc. I’d like to be able to say if it is a novel or textbook, who the author is, etc.; that would be so useful!",
            "region": "ca"
        },
        {
            "rating": 0.6,
            "user": "Hedrums",
            "date": "2022-04-03",
            "title": "Keeps Crashing",
            "body": "I’m ok with IBooks but it lately it keeps shutting down within 10 to 15 seconds of opening a pdf. I updated to the latest version of IOS hoping for a bug fix but it still happens each time. I would try deleting and reinstalling the app but I’m concerned about losing all my titles.",
            "region": "ca"
        },
        {
            "rating": 0.2,
            "user": "bifocal princess",
            "date": "2021-09-26",
            "title": "Vision problems. App no longer goes to same size font",
            "body": "I have vision problems and found that this app was the only one I could comfortably use for extended periods of time. With the new iOS 15 update it now only goes to the same size as a large print book. That lets me read for about 2 minutes. FIX THIS ISSUE PLEASE BACK TO THE PREVIOUS FONT ABILITY.",
            "region": "ca"
        },
        {
            "rating": 0.2,
            "user": "Eselso",
            "date": "2023-02-03",
            "title": "Page turning",
            "body": "After last update the page doesn’t turn like a book anymore! You always have to watch now what side it is going to! HATE IT! Bring the old one back!!!",
            "region": "ca"
        },
        {
            "rating": 0.2,
            "user": "lily_mel",
            "date": "2023-01-25",
            "title": "Downgrade",
            "body": "the last update is more like a downgrade. It ruined everything!   I’ve switched to Kindle, and even bought their device.",
            "region": "ca"
        },
        {
            "rating": 0.2,
            "user": "GeorgeTDS",
            "date": "2023-01-23",
            "title": "Embarrasing",
            "body": "Whoever was in charge of the last revision of the book app should be fired.  Or at least given a really strong talking to.  The amount of changes that appear to have been made just for the sake of change is astounding.  Buttons have been moved to what seem like almost random places.  Page turning animations have been dumped for some jarring one instead.  I can’t see where I am in the book anymore nor scroll using the same bar.  Please hire someone who cares about what you produce.  Seriously, if you don’t care about your product, why should I?",
            "region": "ca"
        },
        {
            "rating": 0.2,
            "user": "Jayyleew",
            "date": "2023-01-22",
            "title": "Why on earth did you wreck this app?",
            "body": "I am incredibly disappointed with the latest iBooks update. The new iOS update removed the auto dark mode, removed the page turning that mimicked turning a real book page, and you can’t adjust the brightness. I hate that the options are now at the bottom in this teeny tiny little button, and you can no longer see where you are in the book just by glancing at the bottom. Please give people the option to revert to the last version. This is NOT an improvement. You are going backwards. The whole app feels dumbed down. The new interface is not fun to use. Very displeased.",
            "region": "ca"
        },
        {
            "rating": 0.2,
            "user": "Chonic_Impulse",
            "date": "2022-12-15",
            "title": "It’s ruined",
            "body": "The new update makes one of my previously favourite apps basically unusable. Weird new icons that don’t “hide” while reading are so distracting and the new page flip animation is jarring and makes it hard to focus. So disappointed.",
            "region": "ca"
        },
        {
            "rating": 0.2,
            "user": "georgefamily082",
            "date": "2022-12-15",
            "title": "Just a bland app",
            "body": "Previous iOS versions had a fantastic iBooks app that brought a feeling of reading real books in a more portable and easy to use format. From the skeuomorphism that brought realistic page turning animation to the easy to use menu system, the app used to be more complex in order to make the experience  simpler and more intuitive for the users. Now, it’s just another bland app available on the App Store that doesn’t really bring anything unique to the table. In fact, it may cause more users to abandon it instead.",
            "region": "ca"
        },
        {
            "rating": 0.6,
            "user": "Poulain",
            "date": "14/11/2023",
            "title": "Frustrating",
            "body": "Recent iterations of this app have been a letdown. There’s a lot Apple could do to improve things, but for now, it makes for a frustrating reading experience. Design wise, there’s the outer margins, which are often too wide to comfortable scan lines of text, especially on an iPhone mini. Highlighting text is a gamble – sometimes it works, sometimes it doesn’t, sometimes it works but only by half. The themes UI feels like it was an afterthought, clunky and confusing. The menu itself is hidden away behind a non-standard, counterintuitive interface that’s uncharacteristic of Apple’s usual approach to design. And the theme options are overkill. Most of us simply want light or dark modes and the ability to adjust type properties, not a collection of rigid styles. Plus, you can’t even adjust the font size within these themes. There’s a lot Apple could do to improve this app, but for now, it’s a frustrating reading experience.",
            "region": "au"
        },
        {
            "rating": 0.2,
            "user": "Catlady123321",
            "date": "17/01/2024",
            "title": "Getting worse over time.",
            "body": "Not only has the type sizes been limited, which is a real pain for those with any visual impairment (and the reason I started using the app and iBooks many years ago), but the functionality has been messed with so much that it is really difficult to use. No longer able to easily look up definitions of words, I find it easier to open safari and google the word. Also the menu at the bottom will not always open, no matter how many times I tap it. Very frustrating. Now when I’m reading a book, if I’m in landscape mode, sometimes a new chapter opens when I page forward, even though there are still pages left in the old chapter. The only way I can rectify this is to turn the iPad to portrait mode and then back to landscape mode. Also sometimes when I turn the page and it is a new chapter< I just have blank pages, the only way to rectify this is to close the app and reopen it. Not good enough Apple. Do something about these faults as I cannot afford to rebut all my books on Kindle, nor should I have to. You have made it so these books cannot be read on other tablets so you should ensure that your app works properly and also be more usable by the visually impaired by allowing larger font sizes to be used.",
            "region": "au"
        },
        {
            "rating": 0.4,
            "user": "Wizened Gardener 732",
            "date": "07/12/2022",
            "title": "I hate the new UI",
            "body": "Wouldn't people be happy to blow up your beloved books app with the new app? Congratulations on blowing it up. The newest update is frustatingly hard to navigate. You should stop destroying apps. The original books app was comfortable, and I like the UI but the new UI—whatever, I do not! Do you see a lot of complaints? They all hate the new UI! Just change it back and people would like it! The close button and options button is annoyingly hard to make it appear again, the page turning animation is good and now replaced with a trash animation that makes no sense to change to, the button at the bottom is terrible, change it to various button that appear by default. If you leave the new UI, people will be angry!!! So just change!!! I hate the new UI!!! It's so uncomfortable, is ridiculous, and easy to get irritate!!! Congratulations on wasting your time doing a pointless thing only to increase the amount of critical reviews! I hate the new update! The UI is just confusing to use and already lots of people are hating it! Change it back and you'll get more 5 star ratings!!! Just do it!!!",
            "region": "au"
        },
        {
            "rating": 0.6,
            "user": "ahhwhwhshahabaawkwksbaba",
            "date": "06/04/2024",
            "title": "Reading Goal Doesn’t Work With PDF?",
            "body": "Although my most recent read - a PDF; is listed under “continue reading” in Todays Reading Goal section - the minutes I spend reading PDF’s do not count towards my daily goal? Why not? I’ve spent hours on a topic and my tracking doesn’t reflect that, nor is there a way to manually adjust this. It’s pretty frustrating to have to download a separate app and manually enter in my tracking when this app is meant to do it automatically for me. Tracking is super important for me and I’m considering other reading apps just because of this. It’s a pretty silly bug that I hope gets updated. A lot of papers and journals are PDF only and I prefer to keep all my reading in one place - I’ll likely stop using this app if the next update doesn’t make it easier to use.",
            "region": "au"
        },
        {
            "rating": 1.0,
            "user": "BKP083",
            "date": "15/06/2023",
            "title": "Seamless Integration and Unmatched Convenience",
            "body": "The Books app offers an unparalleled reading and listening experience for avid readers and audiobook lovers. It stands out for its ability to seamlessly integrate across all my Apple devices - the iPad, iPhone, and Apple Watch.Having access to my entire library wherever I go is an incredible convenience. Whether I'm commuting, waiting in line, or just relaxing at home, my books are just a tap away. It essentially turns every moment into a potential reading opportunity.Furthermore, the compatibility with Siri Shortcuts adds another level of convenience and efficiency to the user experience. Being able to navigate my library, start an audiobook, or bookmark a page using voice commands is an excellent feature.",
            "region": "au"
        },
        {
            "rating": 0.2,
            "user": "Mr. Puddy",
            "date": "07/07/2023",
            "title": "This is the WORST update Ever !",
            "body": "The developers gave so much function to adjust but it’s nothing practical. So much steps to adjust and I didn’t even see the actual stuffs till I done with setting. It’s obviously the developers never read a whole book . All types of the font is too crispy to the eyes. The back ground color and the color of the font didn’t go well together it’s harsh to read. The brightness is the worst ! Too bright or too dark. I tried to fix it by ebook setting ( bottom corner ), go to main setting of iPad . I did adjust brightness. It’s still not good. Set up accessibility, go to Display & Text size. I tried every single option but it’s all seriously useless. None of it can make all the text in the book looks softer, easier to continue to read. Feels like I am going blind when read. Please fix it! and please ask a Reader ( someone who read a book) to READ WHOLE BOOK test it before you launch the next update.",
            "region": "au"
        },
        {
            "rating": 1.0,
            "user": "Dhellcat",
            "date": "11/10/2021",
            "title": "Educational Tool",
            "body": "Looking at the reviews of negativity is sad, as the Books App is an awesome tool for interactive learning. I tutor folks with a variation of disabilities, who are able to use the MarkUp tool to improve their Literacy skills on the Books App. You are able to download .pdf documents which can be uploaded into the Books App, then using Text boxes on the iPad or just simply your finger to write with you can insert information on the document. Do not miss out on the wonderful range of Creativity Books available for Free relating to iPad Apps and also every time there is an Update to iPads and iPhones folks do not even know there are FREE manuals available on the Books App..............Thank you from a very grateful Tutor.....👩🏻‍💻🌻",
            "region": "au"
        },
        {
            "rating": 0.4,
            "user": "zeroxdun",
            "date": "21/09/2023",
            "title": "Hotfix needed!",
            "body": "With VoiceOver on, I used to read (listen) pages and chapters continuously. Each time when I reached the end of a page I'd hear a page turning sound feedback and speech would continue automaticly, also the page ticker jumps accordingly.After last night's phone restart, the app launched with a welcome message and data collecting question, liked a first launch on a newly downloaded app. I selected my current reading title, using the Speak Screen function as usual, but the speech stopped at the end of each chapter and the page ticker remained at the chapter's beginning page. I had to use the page ticker manually or the chapter selection to go to the next chapter.It's very frustrating to read with all the hustle needed from one chapter to another. Please fix ASAP!!",
            "region": "au"
        },
        {
            "rating": 0.2,
            "user": "Mick74-1",
            "date": "08/06/2022",
            "title": "Love the app BUT…missing dialog window button labels!",
            "body": "Would rate 5 except for the following issues that has been plaguing me for years now. Thought it was due to an older phone still running ios12 I think it was. But now have new Iphone13 pro and newer iPad running the latest ios15 and still have the following issues: 1. When ever I rename a PDF the dialog window that pops up has no labels on either of the buttons that I know are cancel (left) and ok (right) underneath the PDF title bar. 2. Seems the above issue re no labels on buttons occurs for me on ALL dialog windows that pop up. Just found it on the View Account Settings dialog window: looks to have 4 buttons under my Apple ID but not one has a label! Also happens on the Sign In dialog window as I tried sign out and back in to resolve. 3. No way to report bugs, I.e. this issue, via the App! And App Support link from App Store for Books goes to a non existent web page!",
            "region": "au"
        },
        {
            "rating": 0.2,
            "user": "Billy Mackgordon",
            "date": "13/12/2022",
            "title": "BRING BACK THE OLD APPLE BOOKS PLEASE",
            "body": "I have used apple books throughout this year and it’s a great to read books on, in my opinion. However, the new updates have been getting on my nerves. First it was the change from having your navigations (library, search, collections, etc.) to the bottom of the page to this File App like section on the left side of the screen. Then the whole layout of the book reading experienced has changed! WHY IS THE ‘X’ BUTTON ROUNDED AND WHY DID IT REPLACE THE BOOKMARK BUTTON. UGH. Finally, the reading experience was changed. I loved the experience of turning a page like a real book, however, that’s been rid off now! That feature made me feel closer to reading a real life book, but this new card switching feature distances me from that experience. Please take our reviews and opinions into consideration, I beg of you : )Steven",
            "region": "au"
        },
        {
            "rating": 0.6,
            "user": "Sioloc",
            "date": "03/06/2023",
            "title": "Needless redesign",
            "body": "The UI's been overhauled significantly for ios 16, with settings now buried into multiple sub menus that only take up a small corner of the screen, making them hard to navigate and use.   They've restored the page turning animation in a recent update, but the edge tapping now doesn't work properly for turning pages - i have to swipe forward on every page. Looks like they significantly reduced the size of the tap area.  The swiping is better now than in ios 15, where swipes forward would somehow send you back a page, or do an animation but stay in the same page. I'm looking for another ebook reader now. I much prefer the kindle or libby apps - have just been using this for epub files, but have had enough.Edit: i've tried 4 other apps and have come back to this one 😅😂 i still don't like it, but it is somehow better than the others...",
            "region": "nz"
        },
        {
            "rating": 0.4,
            "user": "whitney311",
            "date": "18/08/2023",
            "title": "Crashes and don’t issues",
            "body": "It’s slow to open, crashes and say it can’t download a book at that time even though I’m half way through it. But by far the most annoying thing is when I finally get a font setting that is good (the preview in the menu isn’t actually the font you’re using) then the book changes lines spacing between paragraphs on the same page. Or even completely different fonts from chapter to chapter throughout the book. It also doesn’t remember my font preference between books so then I have to much around setting it again every time I start a new book.",
            "region": "nz"
        },
        {
            "rating": 0.6,
            "user": "Peritas Harry",
            "date": "18/02/2023",
            "title": "Books quantity",
            "body": "Hi ,There are good books on this App site, but not nearly as many as I would like. You need to expand the number of books by a long way. More often than not the book I want isn’t there. Otherwise it’s a great way to read and not have to carry books with you.",
            "region": "nz"
        },
        {
            "rating": 0.2,
            "user": "PenguinGeorge",
            "date": "13/01/2022",
            "title": "Skipping or jumping pages",
            "body": "Books has show stopper bugs that made me look for a replacement reader app. There seems to be a bug with pagination, especially when orientation changes. In some cases, the Books app just skips a few pages or jumps to a completely different page in the book. Some other times the app does not remember the previous reading position and you have to scroll manually. These bugs make the app useless to me. IMHO, It’s very far from what was called the Apple quality and, being a software engineer, I can’t comprehend how the most fundamental features are not working properly.",
            "region": "nz"
        },
        {
            "rating": 0.4,
            "user": "spimach",
            "date": "12/11/2022",
            "title": "IOS 16 failure",
            "body": "I really used to enjoy reading using this app. Now it is very difficult, the font doesn’t change sizes correctly, some parts of the books are large in font others are small. The bookmarking feature is also very bothersome as it is easily triggered while swiping. The page turning feels to ‘digital’ the realistic version from previous IOS was much nicer. Please at least give users an option to choose how the app is!!",
            "region": "nz"
        },
        {
            "rating": 1.0,
            "user": "sibling/",
            "date": "23/05/2023",
            "title": "Ghostly game",
            "body": "You have charged me twice for this book at two different prices And there is no way to contact you Please tell me how to contact you so you can return my money I and on a pension and can’t afford approX over $40 dollars for a book",
            "region": "nz"
        },
        {
            "rating": 1.0,
            "user": "aizes456",
            "date": "22/04/2022",
            "title": "Lookin good guys!",
            "body": "Make note taking even easier please! vocabulary collection system for review would be great for studying. Some bug when in landscape mode, then locked, and then unlocking the lockscreen makes the page skip 2-3x!",
            "region": "nz"
        },
        {
            "rating": 0.4,
            "user": "Olivia_Lowe",
            "date": "20/11/2022",
            "title": "iOS 16 ruined it",
            "body": "Sadly the iOS 16 update has kind of ruined the app for me. The scrolling is so sudden, the bookmark feature is easily triggered as I try to swipe, the font is also occasionally messed up as well as the size or spacing of words/letters. the highlighting option is also much more complicated",
            "region": "nz"
        },
        {
            "rating": 0.2,
            "user": "owl&quill",
            "date": "31/01/2023",
            "title": "Not impressed",
            "body": "I’m sure this app used to work, but no longer. It doesn’t like importing books, it doesn’t like opening books, it just doesn’t like working. I regularly have to close and reopen the app, or even restart my tablet completely, in order to be able to read a book. Not helpful! When it *does* work I like the app, but unfortunately “working” is not its default setting.",
            "region": "nz"
        },
        {
            "rating": 0.2,
            "user": "Thisisjusttoohard",
            "date": "23/11/2022",
            "title": "IOS 16 what a joke",
            "body": "I have to agree with the other comments on the update.  I’m very disappointed that this is a downgrade not an upgrade. Like others I’m sure I enjoyed the simple easy way to read books, even to go to next page is a mission tapping the screen.  As for going “Back to page” that’s a mission. NEVER FIX SOMETHING THAT’S NOT BROKEN. Please bring back the simple easy steps.",
            "region": "nz"
        }
    ],
    "Audible": [
        {
            "rating": 1.0,
            "user": "Amytdot",
            "date": "04/01/2024",
            "title": "What an incredible ride!",
            "body": "Started watching Glenn Lundy’s Saturday Morning meets! The end of 2017! A man by the way of John Dawson kept bragging about a store selling  over 800 cars in a small southern town! I thought this has to be bulldodo! But boy was I wrong.    In late January 2018. I set my alarm to get up at 5:30 am to watch a morning podcast! Never had heard one live before. And this man in closet. Was exited that I was watching him. He started telling me good morning, good morning, good morning! I thought the dude was a super human! And over time of getting up early!      My whole world changed.    I was ready to do something different in 2018. Then  I gained our #riseandfamily , hustle and Grind Con in 2018 in October! My income doubled. And the triple after being in the car business since 1981 or 2 cleaning my dad’s service bays and parts department after school and on Saturday. Then running his detail department at Weatherby Auto Sales in 1987. Basically grew up in the business 3rd generation.      But this book by Glenn Lundy The Legacy Titles ! has got me thinking again to venture out on my own. After getting my lifelong dream job as Used Car Manger at Marietta Toyota! Where people had to retire or die before you could get a job there!  Thank you again Mr Glenn Lundy for all you have done for my growth in the car business just a big breath of fresh air! In a very  long time stagnant industry!! Love you Brother!!",
            "region": "us"
        },
        {
            "rating": 1.0,
            "user": "BenBasil",
            "date": "12/12/2022",
            "title": "Some issues but overall worth the price",
            "body": "I love audible, it’s easily my favorite app and really the only reason I use my phone for anything other than communication. The price is more than reasonable, for $15 you get access to a lot of really solid books, plus a credit to use on any book you want, no matter the price. Depending on their age and popularity, some books can be upwards of $30 by themselves, so that’s a pretty sweet deal. Credits carry over and, as long as you keep your membership, they will not expire (if you cancel, be sure to use any left over credits before you do). My only advice is to check the book’s price before you use a credit on it. As I said before, a credit is good for any price book, but that also goes for inexpensive books. They don’t make it easy to see the actual cost, I have to use my phone’s browser because they don’t show you within the app, but there have been books I want that are only $2-3, which would be a total waste of a credit, so I just buy them with my credit card. The only con for me would be (as of December 2022, at least) is the poor compatibility with iOS, you can’t use Siri for any commands other than rewind/play/pause/forward. Since I listen with my AirPods most of the time, it would be nice, but I guess I understand with the whole Alexa vs. Siri war.",
            "region": "us"
        },
        {
            "rating": 1.0,
            "user": "aliboo210",
            "date": "01/14/2023",
            "title": "Kudos to the developers",
            "body": "I’m back to loving the app! My original negative review is below. I got a response from Audible developers who instructed me on how to remove the Alexa button. It was actually very simple, but I couldn’t figure out how before, and had even contacted Audible Help (before I wrote the review) but the rep said Alexa couldn’t be removed. So I’m very happy again with this app. And I’d like the Alexa button if it were in a different location in car mode. Here’s my original review:The new Alexa button is annoying, and frankly, a little dangerous. I used to be able to hit the \"rewind\" and \"bookmark\" buttons in car mode without looking down at my screen while driving. Now I have to look at the screen to hit those buttons because otherwise I accidentally hit that HUGE Alexa button at the bottom of the screen. (Which interrupts my book.) Super frustrating. Sure, I could use the Alexa button instead, but it takes longer to hit the button and say \"rewind 10 seconds\" than just hitting the rewind button like I used to be able to easily do. The Alexa button isn't a bad idea, but why couldn't they have put it somewhere else, and not make it so big? This has ruined the app for me. I sure hope they fix this terrible design in future updates. I’ll gladly change my 2 star rating to a 4 or 5 if they do.",
            "region": "us"
        },
        {
            "rating": 0.4,
            "user": "CadusBane",
            "date": "10/18/2023",
            "title": "Why do they update, only to break the app",
            "body": "Had my new iPhone 15 pro max less then a month. Go to download my catalog of titles only to find out anything over a GB won’t work. It only streams, as I’ve tried twice since the most recent updates. I called and logged the issue with Audible, and told to download in parts. I love the bigger books all in one file. It was fine on my old iPhone 11 Pro Max. I have reflex sympathetic dystrophy, I can no longer hold books or write. So using Audible is so important to me when it comes to the Bible. Use daily and take notes through the app. The app even encourages customers to download all in one file. That’s great, but it doesn’t work anymore for books larger then GB. If anyone like me you have larger libraries, this means can’t even use higher quality downloads on many books. But it’s getting ridiculous the way Audible has gotten lazy. It happens every other year with iOS update and app updates. It either wipes out all of your downloads, or it breaks the app to be able to download. I’ve been at the premium level since 2012, I can’t count the times I’ve bought three extra credits a month. When they had their reading challenges last year, had the amount listened to in a week. I love this app, but I need it to work at the level it has for so many years before. Need this to be addressed and fixed. I can call again and be told sorry, and given extra credits. I don’t want to call anymore if nothing is going to be done to correct the issue.",
            "region": "us"
        },
        {
            "rating": 1.0,
            "user": "ramacharaca",
            "date": "07/25/2023",
            "title": "A Genius business with enjoyable features",
            "body": "This has been a wonderful way to save time and achieve the same result. I have being able to perform labor tasks or even play video games which take up a different response sector from my ability to focus, perform, absorb and respond. While I can divide my attention, this nifty app allows me to focus on both my physical labor and the text/ideas being shared here with the same intensity and similar results. The narrators so far have been great, their tempo, punctuation and emphasis has been on point. The variety of works from which to chose is broad and so far I have found most if not all of the books I wanted to read/listen to. Also, the fact that Audible provides free credits every so often is remarkable( imagine not only how much money is saved but also time to travel and shop for these. Not to mention what if they are difficult to find provided their less then popular demand). The features to control the speed of the narration, also the ability to play on the background for if in the midst of listening one should attend a communication from a friend or family and not want to disturb the suspense built on the best part of the book.   Also, I am sure there are other features I have not explored. So this is it for this review being. Thank you 🙏",
            "region": "us"
        },
        {
            "rating": 1.0,
            "user": "John a sec",
            "date": "12/02/2023",
            "title": "I almost never read anything with a perfect score, but Audible deserves a five, nothing less.",
            "body": "This is simply a tremendous app. It is thoroughly and I mean completely accessible for use by blind people and others with various disabilities. This is a wonderful ethic that Audible has that very few other companies do. I have over 1000 books in my library, and I’ve been with Audible using its application since about the year 2000. I joined Audible not expecting much… But they have proof to be a company that is responsive and one that cares very much about their users.The Audible app has become indispensable to me, and I can only say that about one or two other apps, among many on my phone. It simply works, and works well. My favorite feature is that it organizes series in their chronologically released order. This means that you can see immediately in your library if you’ve missed one in a long series of books that you enjoy, and can usually immediately purchase it right through the app.Audible, I am retired now, but I look forward to many years of listening pleasure, and it’s all possible because you’ve made such a wonderfully accessible and useful application. Thank you, and please keep up the good work.John Esak.",
            "region": "us"
        },
        {
            "rating": 0.6,
            "user": "Gale22",
            "date": "05/03/2021",
            "title": "Most used app I have aside from gps",
            "body": "Love this app so much. Had it for years and does not disappoint. Thank you for being here, existing and being in my life. Such a great idea and concept. Sorry it took me so long to rate this amazing app! Get it, you won’t regret it, so many wonderful title and books and not over priced!Update: This is still a great app but it needs to be said that the home tab is waaay too much noise visually speaking. Way too many suggestions and advertised books for an app. It’s not a clean look and honestly it’s ugly. The app needs a more sleek minimalist feel for ease of use. I literally get anxiety seeing the homepage with all the extra books recommendations, catalogues and so forth. When I use the app I just want to get to the point not be defaulted to a crazy looking page foot of book images. Please higher someone to update your app comestically. With the IOS update people are discovering less is more with widgets and less apps. Try to use that same concept, I want to see recommendations make it the last tab not the first. Have the first tab be the library and instead of a line chart of books maybe give the option of line display or chart display, just something more sleek please.Update 03 May 2021: The app skips the audio for some reason and when the screen goes dark it stops playing. Please fix this. This is pretty frustrating and my settings don’t have anything that causes this to happen.",
            "region": "us"
        },
        {
            "rating": 0.8,
            "user": "Howiejf",
            "date": "10/13/2023",
            "title": "Be careful",
            "body": "I was a big Audible user and supporter for years. When the membership terms required a monthly fee, I stayed with. Happy to use the large audio library for members only. The idea of earning a credit a month to use for any premium item also fine. I had accumulated four credits, when I decided to take a break . Now this is the problem, and in reality it is my fault for not reading the fine print. I THOUGHT that I would take a few months off of the membership to use credits that have been building up. Fully planning on rejoining in a few months time. What I did not realize was that once you suspend the membership you lose all of your accumulated credits .. back to zero. If you seek out this information you will find it. I never looked at the whole contract . Kind of silly to pay monthly and then lose all of you credits if you stop temporarily or otherwise.. Without this issue Audible is a five star company, but this nickel and diming was and is unfair, stated or not , fine print or not. So this is a cautionary tale. If you are a member  or plan on becoming one be advised that if you stop your membership you will lose all of you amassed credits. If you are the type of person that uses the credit immediately, then you are fine. Otherwise heed the warning. You will get your credits erased too.",
            "region": "us"
        },
        {
            "rating": 1.0,
            "user": "ProcyonLen",
            "date": "02/16/2023",
            "title": "EDIT one of my most used apps.",
            "body": "EDIT: Thanks so much for the response, team. I updated the app and am so relieved. I can’t tell you how much I was missing listening to my books. So happy it was just a bug! Definitely giving the app 5 stars overall! I LOVE my audiobooks. Audible was one of my very top used apps, as I have a hard time focusing on tasks around the house/work/etc without some sort of sensory input. I have it running almost all the time. The last update ruined the whole app for me. I live way out in the middle of nowhere with no wifi and only the most tenuous connection to the data network. Suddenly, after updating the app, it won’t play any of my DOWNLOADED titles without an internet connection. What the heck is the point of taking up my phone storage space downloading all these books, if I now can’t even play them from my phone?? I am so disappointed, as I can’t listen to any of my favorite books at home anymore because I can’t find a place to connect enough to start the chapter. I know I’m just one random human to a huge corporation, but please, please, please, fix this. I am already missing my books acutely. It’s so disappointing to not be able to play my selection of downloaded books.",
            "region": "us"
        },
        {
            "rating": 0.8,
            "user": "snelson75",
            "date": "10/26/2023",
            "title": "Just okay",
            "body": "The first part of the book starts out centering on a family…Jill, David and their daughter, Sofia.  Right away, I was annoyed with Jill and sadly, Sophia. Jill is a helicopter mom, her life centers around Sophia and everything else, including her husband, is a distant second. Sophia is a spoiled brat. Jill had a rough upbringing and then a traumatic event happens in their lives which leads to Jill being unattached and distant, as well as, having a hard time relating to many people.The second part of the book is where it picks up. Someone takes Sophia. We also get more into another character, Bea, who has a lot to do with, well everything. I won’t divulge because it would reveal too much. We are also given several snippets of a third character, via her journal. That is the part of this book that I really enjoyed.I pretty much knew right away who all the players were before the author came right out with it.  What I didn’t like about this story was all the loose ends left open. There were SO MANY. I feel like the author didn’t give Jill and David their due redemption.I will say this book really was a page turner and I listened to it even when I wasn’t commuting, which is rare.  Aside from the way RD finished this book, it was a good story and the narration was A+. Would I listen to it again…probably not.",
            "region": "us"
        },
        {
            "rating": 1.0,
            "user": "Au resto",
            "date": "2018-11-24",
            "title": "Many faults",
            "body": "Where is the free category?  Can’t buy and download directly in the app?  Seriously!?!?  Work it out with Apple!  I’m sure you can find a way.",
            "region": "ca"
        },
        {
            "rating": 1.0,
            "user": "J1222",
            "date": "2017-09-17",
            "title": "Terrible UX",
            "body": "It should not be this difficult to BUY something from a company. I should be able to make purchases inside the app or at least click a button that would take me directly to an outside URL where I can pay for the item I want. Will delete app after listening to a podcast series only on Audible.",
            "region": "ca"
        },
        {
            "rating": 1.0,
            "user": "caledongrl",
            "date": "2018-11-14",
            "title": "there could be major  improvements to this app",
            "body": "The app worked better before, after all these updates the app for IOS is very flaky. Cuts out, freezes, stops, won’t load, a whole mess of things. My rating has gone down for this app since the quality has gone down significantly.",
            "region": "ca"
        },
        {
            "rating": 0.2,
            "user": "Toukay",
            "date": "2019-09-27",
            "title": "User beware",
            "body": "This app deletes all purchased book tokens, regardless of count, if you cancel the service. I had a purportedly odd situation of having my accrued tokens deducted when I opted to pay cash for an audio book. Some audio books will not be worth the monthly book time you get from the subscription. Instead of investigating my complaints I received formulaic responses about browser caches and otherwise. After deciding to cancel, only the did I learn that all the money I spent on book tokens was going to be deleted. Every other service I have ever dealt with at the very least offers some manner of refund for the unused portion of the service. So beware. Audible comes with a very unpleasant lock-in mechanism that will punish you for cancelling.",
            "region": "ca"
        },
        {
            "rating": 0.2,
            "user": "samanthaj94",
            "date": "2019-11-03",
            "title": "Not Impressed",
            "body": "Downloaded and paid for membership back in February. Cancelled membership on audible.com over the summer but still found they were still charging me monthly after the fact. Called customer support to find out what the charge is for. Ended up finding out audible.ca had been charging me - even though audible.ca came out after I had bought the membership. Issue: audible.com says I am not enrolled in a membership, whereas audible.ca says that I am. I understand that these are two different services but this is one company. I think it’s ridiculous and very misleading that one company related site would say I don’t have a membership, while another company related site says that I do. Customer service did not even offer a refund for the months I cancelled my subscription on audible.com Please work on having some sort of uniformity when it comes to membership information displayed across your websites.",
            "region": "ca"
        },
        {
            "rating": 0.2,
            "user": "ScottyD1976",
            "date": "2019-03-01",
            "title": "Very difficult to cancel subscription",
            "body": "I subscribed to Audible but found listening to books wasn’t for me.  When I went to cancel, I found it difficult throughout the process.  You can’t cancel from the app or through the mobile site...only the desktop.",
            "region": "ca"
        },
        {
            "rating": 0.2,
            "user": "PICK A NICKNAME APPLE",
            "date": "2021-01-22",
            "title": "Ridiculous",
            "body": "One of the worst experiences ever on an App. How do you buy books? You don’t, they sit in your wishlist forever because you can only listen to 5 minute samples.",
            "region": "ca"
        },
        {
            "rating": 0.2,
            "user": "Lugis2",
            "date": "2019-03-15",
            "title": "Buggy, expensive, bloated, wont sync with Apple Watch",
            "body": "...but apart from that, great!Sent a detailed description of my issue to support. They sent me instructions for how to install the app, and a cheerful promise that I would then be able to listen to audiobooks. Deleting and reinstalling, this app now comes with half a dozen excerpts of books, in French for some reason, with no option to delete them. Maybe it’s mad at me because I wouldn’t share my iTunes library with it?When it is “working”, I can search for books but get a message that says “this app can not be used to purchase content” even though I am a subscriber. I have to go to a separate website if I actually want any of the books.",
            "region": "ca"
        },
        {
            "rating": 0.2,
            "user": "hfsuebay",
            "date": "2020-12-03",
            "title": "Hard to cancel",
            "body": "‘Free trial’ but you need a desktop to even cancel. You cannot cancel through mobile or the app but you can use those to sign up. Don’t fall for it.",
            "region": "ca"
        },
        {
            "rating": 0.2,
            "user": "nicnic09",
            "date": "2021-02-19",
            "title": "HORRIBLE APP",
            "body": "This is bar far the worst app on iOS. I cannot understand how anyone would rate this five stars. It is the most un-user friendly app I’ve ever been on. Feels like it was made by 5th graders.",
            "region": "ca"
        },
        {
            "rating": 1.0,
            "user": "jazztyke",
            "date": "05/12/2020",
            "title": "Hate new App front page",
            "body": "Audible app is definately in my top 5 apps I go for on a daily basis on my iPhone and iPad.  First thing when I get in the car I select my latest book to listen to.  When I'm at my desk I set my phone on it's dock and continue 'reading' while I work and the same goes when I'm cooking.  I use this more than iTunes nowadays.It isn't perfect - I don't download to my phone anymore because usually I get an error message after it's downloaded the first 5-10% of a book, and then just stops - nothing will get a download past the first 10% no matter how I tweak the settings.  So now I just download to my Mac and drop it into iTunes, to load up when I sync next.  It's a bit of a nuisance but....This never used to happen, just since 2 or 3 revisions ago.  I can live with the inconvenience though.    What I couldn't live without now is the App itself - it's so convenient to listen to a book rather than have to give a book your whole attention as with a paper book or eBook - although I read plenty of them too.My only real hate is the ‘dashboard’/home page the app starts on now. I’m not interested in whatever it has to say...all I want is my Library when I open the app.",
            "region": "au"
        },
        {
            "rating": 0.8,
            "user": "Shane_J_Gumboot",
            "date": "27/02/2022",
            "title": "I’m all ears.  I hope someone’s listening as well.",
            "body": "Everyone should give audiobooks a try. Audible has helped me enjoy and explore so many more titles and topics (now over 400 in my library) than those dusty, neglected titles stacked on my beside table. Along with a constantly updated and wide array of captivating and entertaining titles, it’s great to share the experience of so many of the great masterpieces of mankind. I appreciate that they are preserved in spoken word form for our future generations.  Whilst the above is true I still feel compelled to hold a Star (or two) of hope that someone, who is proud to work at Audible, will take the lead in preserving and presenting some of the many, many fine works of the late great Mr James A Michener. It’s been great to listen to and savour other masterworks like War and Peace, Crime and Punishment, Great Expectations…It’s a very long list. Humanity should hold on to this timeless wisdom. Lest we forget. What is noticeable absent however are other classic titles like Centennial or The Source or Alaska? Like earning the Audible trophy’s within the app and I’m sure the team at Audible like earning rating Stars for this app. Audible will earn another two stars (from me) when they publish some of the works of the mighty Mr Michener. I’m all ears. I hope someone’s listening as well :)",
            "region": "au"
        },
        {
            "rating": 1.0,
            "user": "Easy listening1221",
            "date": "19/03/2024",
            "title": "An intelligent look at the post capitalist world order",
            "body": "The books reads as a retrospective look at the evolution of capitalism and as a letter to the dreams and visions of Yanis’s father. A deep dive and collective view of the future of capitalism re written by the cloudalist, argues that China and America basically own the future. The new rent seekers are the technology companies in earnest now realistically control much of the way societies think and interact as well as the way global finance interacts with consumers and businesses. A great critique of the promise of blockchain and digital coins and how they were usurped by con artists and the dream of decentralisation way just a parting dream. It’s a sorrow tale for left who dreamed of a post capitalist rebirth of the socialist system. That is dead the power now more than ever resides in the hands of tech bros and fewer nation states to set the rule of the future. I appreciate that he gives a remedy to this at the end, with a independent revolutionary concept, worth exploring, the conditioning of all us will be at war with the desire for change someday I hope. A great contribution to a topic not really discussed today and one I hope sees other expand on.",
            "region": "au"
        },
        {
            "rating": 1.0,
            "user": "LynMac87",
            "date": "24/02/2021",
            "title": "One of my Top 3 Apps- BUT...",
            "body": "I love my Audible App & use it daily. There really is something incredibly special & satisfying about hearing your favourite stories brought to vivid life by a talented narrator. My job involves spending all day looking at a computer screen so my eyes struggle to cope with the added strain of reading on top of work- my audible app means I can still emerge myself in so many of the literary worlds I love.My ONE complaint? Since the last 2-3 versions have been released, sometimes I can’t get newly purchased books to download. REALLY annoying. Most of the time (90-95%) I just wait a day or so & the problem fixes itself. Once or twice now I’ve had to delete the App, shut down my phone & then RE-install the App again once I’ve turned my iPhone back on. This seems to be a recurring theme in a lot of the most recent reviews- wish they would fix whatever bug it is, because otherwise this App is the best thing to happen to my ability to keep reading for enjoyment in a long, long time!",
            "region": "au"
        },
        {
            "rating": 0.2,
            "user": "Joeleous",
            "date": "04/03/2023",
            "title": "Great but some tweaks required",
            "body": "1) Need an option to stop seeing certain books. I will never buy a book from Michelle Obama, Will Smith, or Prince Harry so please give me an option to say not interested and for these to no longer be displayed.  2) Daily deals are great and I have bought a bunch however they are more often than not completely irrelevant. Given the large number of books on Audible there are bound to be more customised options available  3) I am often interested in series which are very old like Clive Cusslers Dirk Pitt, Wilbur Smith’s Courtney’s, Tom Clancy’s Jack Ryan’s. All of these titles cost the same as a new book even though many are decades old and no longer on the best sellers list. I, and many others, would be tempted to buy whole series at a discount or buy one at full price and the rest 50% off, or 2 for a credit.4) Last but not least. I am not one bit interested in LGBT or Australian Aboriginal literature. Many of my favourite books have characters or content which deals with these however it is not front and centre. How Audible pushes books with a pure focus on this content on their clients I find frustrating and reprehensible. Your role is to provide compelling content to all of your clients not force fringe content, relevant to a few, on everyone in an transparent effort to appear progressive and righteous.",
            "region": "au"
        },
        {
            "rating": 0.8,
            "user": "we all lov jojo",
            "date": "15/03/2024",
            "title": "AMAZING",
            "body": "This app is used 24/7 by me, as someone who can’t just fall asleep with silence, I need something to listen to, and for me trying new podcasts are always so hard because I am so used to the other ones that I listen to. But when I first found a book to listen to, I thought that it was like amazing I was like I actually like this, and that’s weird for me because I don’t normally like new things I don’t really like change so that was actually a really good thing to discover because now I can try new books whenever I get sick of one book then I can go and listen to another podcast or another book. Although I would say sometimes when I’m trying to skip or back it doesn’t let me so that’s one downside but otherwise this app is amazing. Another thing to mention is that if you want to get a monthly ticket or credit to use for a book or podcast you should do it. It’s quite cheap and it actually works and it’s actually pretty good to do because it some of the books that are already free on Audible they don’t normally they aren’t that good in my opinion so I would suggest highly buying the monthly credit thing.",
            "region": "au"
        },
        {
            "rating": 1.0,
            "user": "boyes boys",
            "date": "29/06/2022",
            "title": "Tuesday with Maurie",
            "body": "I really enjoy to listening to this and I have read the book and I am not really a person that reads so the aublile books and podcasts are really good for me l have listened to several autobiography and enjoy them some better than others and I always seem to have a break from them and then I go back to them that is just a personal thing listening to Tuesday with Maurie and I watch the film was something a friend got she was only in forties it’s a horrible disease and watching some one go through it is hard to watch how it effects them I found I could relate with some of the ways as it was just like the things my friend went through let’s hope some day a will find a way that it will prolong a person’s life as I don’t know if they will ever find a cure well not in my life time but once upon a time you rarely heard of it but  now you see more people with it and I can relate when I see them as I watched my friend fight the disease and eventually losing the battle with it",
            "region": "au"
        },
        {
            "rating": 1.0,
            "user": "Juzzy1973",
            "date": "11/07/2022",
            "title": "A relatable life story",
            "body": "Selma Blair, you have such a relatable story to so many women of my generation and (I’m sure) for every generation before and to follow. I saw myself in you in so many ways… childhood innocence, navigating teenagerdom, the vulnerabilty, relationships and all the lessons that come with it all. Highlighting to us all that we never stop learning and relearning throughout our lives. As an actor who has grown up parallel to me, I never realised that you were actually growing up in front us all, experiencing such similar anxieties, anguishes and adversities that we all face.You have emerged like a butterfly with such grace and composure… The message I have taken away from your story is to keep going and keep growing and learning, despite what is thrown at us in this crazy old world.The best part about listening to your story on Audible is that YOU told the story to me… straight from the horses mouth. With all of the raw emotion, laughter and tears. Thank you, and please keep writing… it really is your true calling. 🙏❤️",
            "region": "au"
        },
        {
            "rating": 1.0,
            "user": "Mangtrexc",
            "date": "13/08/2023",
            "title": "Everyone must read this book",
            "body": "This book changed my life. Bessel gave me so much hope as a trauma sufferer also dealing with addiction and mental health issues. He shared a variety of proven and successful avenues for healing trauma outside of western medicine practices. The psychiatric industry has been failing us greatly and is keeping us sick and at risk. This book gives us agency by providing so many solution based approaches which are holistic and gentle on our bodies and minds. Rather than provide Band-Aid solutions which never deal with the issues at hand he provided insight into how to address the cause of our suffering by leaning in and provided strategic approaches to taking our healing into our own hands no matter where we are in our lives. This has lead me down a new healing journey after years of searching and has given me so much inspiration into new ways of. healing myself in more effective ways that promote growth rather than quash who I am with medications that don’t work.",
            "region": "au"
        },
        {
            "rating": 1.0,
            "user": "Wilko423",
            "date": "05/04/2019",
            "title": "More credits",
            "body": "I have been using audible for nearly a year now and I can say it has without a doubt opened my mind up to another universe that I hadn’t known about til now, I highly recommend it to anyone who loves books but either doesn’t have the time to physically read them or even has issues concentrating on reading print like myself. This app has changed my life I recommend it to all of my friends regularly and with the subscription you get a new book each month. One suggestion I would have for the makers is possibly adding an option to buy credits in bulk for cheaper prices, sometimes I want to read a new series of books but find myself not wanting to waste credits/$15 on books between 5-10 hours as I can finish that in a day or so, if I had the option to buy more in one go I wouldn’t find myself skipping series that have shorter books at the beginning. Aside from that it’s basically flawless in my eyes, keep up the good work guys!",
            "region": "au"
        },
        {
            "rating": 1.0,
            "user": "Missjordanne",
            "date": "03/03/2019",
            "title": "Wish there was a percentage number",
            "body": "I adore Audible, it’s kinda expensive but the selection is unprecedented. It’s so great for encouraging more reading, as you can multitask while consuming a story. I love how there is brand new and popular books on here, and you also don’t have to wait like you might on Libby. In terms of the app, I wish you could purchase through the app. I wish that you could change the timer to view the percentage you were through the book, and that the overall progress timer was visible on books that were loaded in 2 parts. Finally, I wish that there were cost effective subscriptions for multiple books per month as I read maybe 2 audiobooks a week and find that Audible gets expensive so I rotate between this, Libby (which is connected to your library card, meaning that it’s free BUT they will only have a certain amount of copies of a book and you need to wait until a copy is available - like a normal library book - which can be loooong with new or popular books but has a STUNNING app interface that I believe is more intuitive than Audible), and less frequently I’ll listen to Scribd but the selection is average compared to either of the first two I choose and the app isn’t as pleasant as even Audible. Overall, I love Audible because of the range and I would keep it purely based off of that however I also enjoy the interface and the experience of the books. Overall, I",
            "region": "nz"
        },
        {
            "rating": 0.4,
            "user": "CaptainJamMan",
            "date": "28/04/2022",
            "title": "Good service, Bad support",
            "body": "Audible was reasonably good while I was using it though some would argue a bit on the pricey side. It’s a good service if you can’t find time to read yourself or just need to relax and listen to a book. If you try and cancel the service, boy are you in for a rough ride. For a start you can’t do this via the mobile app and have to go through their website. When you do eventually find the section and go through with it, there are no guarantees that you won’t continue to be billed. I cancelled and despite my membership saying it’s not active now as well as a confirmation email I was still charged at the end of the following month. Cancelled 21st Feb, membership officially ended on the 3rd of March I believe and then charged again on the 31st. You go through their first call option which is some sort of online call (after fighting disheartened through more roundabouts of help options) and the call just cancels after a few minutes of waiting, repeatedly. Try the toll free number and well guess what, it says it is not currently active!!! Classic scam warning signs but Audible isn’t a scam. I cancelled cause I don’t have a job now but I’m waiting to see whether some of my food money will disappear at the end of this month if I get charged again. Not happy!!",
            "region": "nz"
        },
        {
            "rating": 1.0,
            "user": "jajamnz",
            "date": "05/05/2018",
            "title": "Life by Keith Richards",
            "body": "The hilarious opening chapter sets the feel and themes of what’s to follow and left me shaking my head incredulously. Keith can clearly spin a great yarn. Rich descriptions of his childhood in Dartford, detailed a seeming no man’s land of post war Britain trying to find its way from the old to the new. Keith’s guiding lights were the Chicago blues artists, who faded in and faded out across the Atlantic airways through the antennae of his transistor radio. Together with the influence of his musical family, and a chance meeting with Mick Jagger (who lived in a posher part of town) a partnership was forged that became the Rolling Stones. Keith rambles at times, yet he rambles with a fierce hearted loyalty and insight into the populace of musicians, women, staff and personalities, who came and went from his life; some of whom who also shaped the face of the sixties and seventies. It’s a gripping tale. I loved hearing Keith speak himself - such a rich, gravelly and warm voice - a welcome relief from the monotony of Depp’s narration and the south London accented overkill of the second narrator.",
            "region": "nz"
        },
        {
            "rating": 1.0,
            "user": "dee kst",
            "date": "27/09/2023",
            "title": "A fantastic non-behavioralist, social justice parenting book",
            "body": "Parenting Beyond Power is awesome! If you are looking for ways to ‘be the change you want to see in the world’ and ‘treat others the way you would like to be treated’ here is an great parenting manual for finding ways to do just that, starting in your home.This audiobook brings together the key elements of NVC, collaborative problem solving, unconditional parenting and social justice parenting in a beautifully presented, easy to understand way.I recommend this book to every parent, it truly has something to offer everyone. If you wish to parent differently to how you were parented, this book will help you tread your own path. If you were parented in a respectful way that aligns with your values this book will provide insight into why it can STILL be hard to let go of 'power over' parenting in times of stress. If you currently parent in an authoritarian way this book provides solid research based reasons to consider the alternatives. Even if you read this book and find it is not for you, it will certainly provide food for thought.I found the content that spoke directly to healing damaging patriarchal, capitalist and racist systems (insidious in W.E.I.R.D. societies) super beneficial. I will refer back to this book whenever I perceive a potential disconnect between my parenting and my values.I can’t wait for a book number 2!",
            "region": "nz"
        },
        {
            "rating": 1.0,
            "user": "Molomolo ❤",
            "date": "08/05/2021",
            "title": "Beware citizens of the world",
            "body": "History repeats and I feel the world is yet again facing a perilous onslaught of dangerous far left agendas all converging at once. Cancel culture and woke culture are amongst a variety of groups that have sinister groups backing them. How spoiled are the youth of today, a generation who have never had it so good, yet complain about how unfair life is and how unjust things can be. I say grow up and give thanks to those who walked before you that had something to actually complain about, where injustice was real. This book lays out in broad daylight how tyrannical govt can be and how easy it is to wake up and it’s... too late. Smarten up as this book should be a reminder to never get complacent. I appreciate you making this available and hope all of humanity get the opportunity to read it. With thanks and appreciation.",
            "region": "nz"
        },
        {
            "rating": 0.8,
            "user": "bestappevernot",
            "date": "04/02/2022",
            "title": "Complete rubbish",
            "body": "I guess I shouldn’t have had such high expectations but really you would think that by 2022 you could be excused for thinking that apps should just work. This has to be the worst app I’ve ever downloaded. Why can’t you use credits to purchase in app? Why can’t you purchase credits in app? Why is there no link to purchase from search? Why do items I have finally figured out how to purchase say they’ve gone to my library but don’t show in my library in app? Why does the player freeze? If you’ve ever been worried about being ripped off through an app then don’t use this one! The selection of books cannot be beaten but this app is simply useless. I hope the designers have been arrested tied up and receive a sound thrashing every day for the pain they have inflicted on so many. Absolute asscrack. You even get forced to give a one star review even if you want to give none. Don’t use this rubbish!",
            "region": "nz"
        },
        {
            "rating": 1.0,
            "user": "Nztracie",
            "date": "17/10/2023",
            "title": "ALL BLACKS Passion in WORDS",
            "body": "Thanks so much to all who endeavoured to put All Black history into such a magnificent book. I was genuinely sad to reach the end. Having moved to NZ from Canada in 2007, I first fell in love with the game watching them play SA in a little pub in Ohakune where so many fans packed the room, it felt like when Canada played Russia in ice hockey. It was there that I first saw grown men fly through the air to victory. I watched sportsmanship that saw the foulest call by a ref, not even register distain on Richie McCaw’s face because he was already getting in position for the next play. There was a physicality to the game but there more skill than I’d ever seen on field of any other game. This book puts into words the journey we all took while Sir Steve Hansen was at the helm. It will always be topical for the game and whether you played or are a fan, you will find it FASCINATING!!!",
            "region": "nz"
        },
        {
            "rating": 1.0,
            "user": "DavidDavidson76",
            "date": "24/07/2023",
            "title": "Essential reading to get understanding.",
            "body": "This my third listen to this narration in the last two months. What Mike reveals is too much too absorb in just one reading just as much as Scripture itself. We can never exhaust the depths of The Word our Heavenly Father has given us it is a lifelong study we dare not undertake. Only scholars like  Mike can open up the depths of Revelation in the language of The Word. He was a man raised up and empowered to bring to us who are willing to make effort Mike has lifted my understanding a 1000fold in this year alone. I am 82n years old and still willing to be taught, and our Heavenly Father is enabling me to learn despite my poor education and limited skills. Please i exhort all who seek to know absolute truth do read this book and meg the God of all Creation bless you with understanding as He has me. 🙏 Rob in New Zealand",
            "region": "nz"
        },
        {
            "rating": 1.0,
            "user": "Cleolady",
            "date": "13/10/2022",
            "title": "Audible",
            "body": "Fantastic app, I found concentrating in reading very difficult after a major illness and then discovered audible. I credit this site with helping me on the road to recovery as I was no longer bored. Now I am well I can read on the car, getting ready to go out, even before I sleep. Put on the timer either minutes then off to sleep. Can download anywhere , anytime. Always have your library with you. Still the best app. Have been using audible for 5 years. Excellent plus they do listen to us and improve the app. A year later and still the best app.A fee more years of using Audible. I paint in my spare time and find listening to books and painting are the best companions. It is great to do two things I love at the same time. Keep up the good work. 😀😀💜",
            "region": "nz"
        },
        {
            "rating": 0.8,
            "user": "Me95419",
            "date": "28/09/2023",
            "title": "Good content, very marginal access to it",
            "body": "I have recently just trialled audible, found a book series I enjoyed listening to. However after finishing the book, and deciding I will happily pay for the next in the series. I discovered that I have no ability at all to buy more credits or anything outside of the 1 book a month. From my perspective my first months use has dried up in a matter of days and the apps inability to allow me to purchase additional books, means that audible from my experience, is largely redundant for most of the monthly duration. I’m not talking about wanting more for my money, simply the ability to spend more of my money in order to continue with a series I enjoyed, seems counter productive to a business, to restrict and limit you ability to spend money in their products or services.",
            "region": "nz"
        }
    ],
    "Apple Music": [
        {
            "rating": 1.0,
            "user": "mdmdnfidbdhdskhsd",
            "date": "08/18/2022",
            "title": "Delayed",
            "body": "Hello, the only problem I have with this app is whenever I play the DW album by Ariana Grande, almost every song that I play on that album she ends up coming in early, or the music is really delayed, or they end up not even singing the words at all. And it’s specifically this album I haven't had a problem with this when I play another artists song or any one of her other albums. For example when I played ‘leave me lonely’ Macy gray at the being is supposed to say ‘dangerous love, your no good for me darling’ but what I end up hearing is ‘love, you’re no good for me darling’ another example would be ‘Bad decisions’ at the start of the bridge when she sings it’s heavily delayed and the music in the background ends up delaying like 4 seconds, and it is so off. Again I really do like this app but that’s the only problem I noticed and for some reason only that album. It could just be my phone but idk is this happening for anyone else? (Also many of the lyrics in some of the songs I listen to are way off 💀) It is not fixed",
            "region": "us"
        },
        {
            "rating": 0.2,
            "user": "CEDJH",
            "date": "01/06/2024",
            "title": "Apple deleted myPlaylist",
            "body": "I tried the trial subscription of Apple Music that I received with a Samsung purchase. I had Apple Music playlist on my iTunes, iPhone, and iPad that was in created over many years prior to the activating the trial subscription. I let the subscription expire and found out that all my playlist had been deleted from my Apple Music iPhone, iPad and TV apps. Also, my Apple Music app on my TV, which prior to the subscription would play music in my Apple library, now no longer accesses my playlist or any songs purchased and downloaded without re-signing up for a subscription. So Apple Music on my TV is useless at this point without a subscription. My Apple Music playlists on my iPhones, TV, iTunes, and iPad was deleted, literally erasing hours of work. I did figure out that I could re-sync my iPhone and iPad devices with iTunes on my computer and get the playlists back. However, my Samsung TV Apple Music app now requires a subscription to access my library to access previously purchased songs and playlist. This is incredibly non-customer service oriented. I also did a trial of the Apple TV subscription and Now, I’m concerned about what Apple may do to my Apple TV movies when that subscription expires. I guess I should have just left it alone and not signed up for the trial subscription. I would be better if you were warned when starting a trial subscription on the TV app and ending it will cause you to no longer be able to access you library.",
            "region": "us"
        },
        {
            "rating": 0.4,
            "user": "DaisyXIII",
            "date": "11/12/2023",
            "title": "Bad Connectity",
            "body": "This app would be good if it could stay connected. Very often you have to hit play once or twice a song to keep it going, which is extremely cumbersome when you’re listening to music in the shower or running; you have to stop what you’re doing every few minutes to keep it working. When out walking it holds a connection for about half an hour and if you skip more than 3 or 4 songs it completely quits loading. I’m in the greater Phoenix area and the cellular signal is great. This model iPhone is less than 2 years old, this shouldn’t be happening. The service is so jenky it’s almost not worth paying for anymore. Sticking to playlists instead of stations helps, but it would better if the app could just operate like it’s supposed to.Also the algorithm has trouble gauging what to play next. It’s like it can’t tell that you’re listening to all up beat, fast music and slow music is skipped, it just keeps pushing slow music. When I get off work I like to go running, at the same time every day I look for upbeat music to put myself in the mindset. It would be great if the algorithm could pick up on that and suggest more accordingly. The pop station is probably my favorite but it takes a lot of skipping and hitting play to keep it going, and at best it’ll only work part of the time. It’s almost easier to just turn on the radio.",
            "region": "us"
        },
        {
            "rating": 0.6,
            "user": "GrannyDar",
            "date": "03/21/2024",
            "title": "Spatial Audio",
            "body": "My experience with this is 50/50 are good adaptions verses poor. Aside from that, when it's good it's extremely enjoyable. However, my gripe is with finding the music. Firstly, it's great Apple pays artists more to record this way. It would be a win/win situation except for actually finding the music in the catalog. I surmise that aside from the artists getting paid better, this also gives them store front exposure. For artists with older offerings it rekindles interest in their work. However, with the exception of playlists Apple has put together, many of these recordings remain buried … often with no description of them being done in Spacial Audio or double copies of the same recording. Sometimes you can find a whole Album if you root around but you must continually be persistent especially when only one song by an artist is done this way. The existing Search function is no help either. This is unfair to artists and makes finding content tedious and time consuming. This does not encourage people to adopt this newer way of listening. When one considers the minority of people who many have the equipment to take of advantage of this, it seems counterintuitive to have speed bumps encumbering discovery.",
            "region": "us"
        },
        {
            "rating": 0.4,
            "user": "WestwardWindow",
            "date": "11/05/2023",
            "title": "Bring back the option to organize album by “recently added”",
            "body": "This has been a great app, but for a new change: Apple removed the option to organize your albums in your library by “recently added“ and now you can only organize them by the title of the album or by the artist name. Why you would remove an organizational option makes no sense to me, but it is basically made my library seem completely unrecognizable to me (of course, technically they are organized, but they are organizing a way that is completely different from what I’m used to). The organization I am used to is gone, and all the albums seem completely mixed up. I have always used the “recently added” organization feature to organize my albums, and I know exactly where each album is supposed to be. However, now, my album completely out of my usual order. Please add that feature back in. Again, it makes no sense why you would remove an organizational feature. It’s not like you’re forcing people to use that option, they can use it if they like to. However it not being there is extremely frustrating, and I’ve begun looking into ways to transfer my library to another service if this can’t be fixed.",
            "region": "us"
        },
        {
            "rating": 0.2,
            "user": "Harlockasura",
            "date": "08/04/2023",
            "title": "Update for 8-4-23 is awful",
            "body": "This update has completely messed up they way I use my playlists. I have a main playlist I use to get to my favorite songs faster. There are a lot of songs in this playlist and I tend to want to listen to th new ones over th ones I’ve heard too many times. I usually organize th playlist from newest added to oldest because th newly added songs always go to th bottom of th list and always have and I have never figured out how to tell it I want new songs at th front. Now after years of adding songs to th end and just sorting th playlist from newly added to old this new update has made all my new songs added to th front. What this boils down to is now I have to drag a newly added song to th very bottom or th very top of my playlists because all my newly added songs get put right by th older ones. I like to keep my playlist in an order cause this playlist I’ve had over a decade so it has thousands of songs by now as u can imagine I don’t listen to th old ones often but it’s good for shuffle all at th gym or something active. Now any newly added song to this playlist is forever separated from th rest of my newer songs and thrown right to th older songs. This is something that did not need to b fixed so please apple just stop.",
            "region": "us"
        },
        {
            "rating": 0.8,
            "user": "Tomboysksksk",
            "date": "03/11/2023",
            "title": "The best music platform, but I have an issue",
            "body": "I'm not switching from this music platform. I mean the sound quality, amount of songs to listen to, etc. But for about 6 months now, I've been having this problem. When I add a song to a playlist, it won't add the songs even after the notification pops up saying \"Blah blah blah has been added to Blah Blah playlist\" and so I add the song again to the playlist, it says the notification thing again and then it finally adds the song to the playlist but since I had added it already before it adds 2 at the same time and then I have to edit and delete one. It's not the worst thing but it's really inconvenient when I'm trying to quickly add songs to a playlist. I have noticed it doesn't do this glitch when I click to add a whole album to a playlist at once. I'm just hoping they fix this glitch. But really other then that their is zero problems. Once again I'm not switching music platforms and it really does have good sound quality, lots of song selection, etc.",
            "region": "us"
        },
        {
            "rating": 0.2,
            "user": "ellagoose",
            "date": "05/25/2023",
            "title": "Why There Need to be a Resume Shuffle Button:",
            "body": "Shuffle mode does not shuffle. I have over 500 songs on one of my playlists—which I have been listening to for years—but the same twenty songs are repeated every time I shuffle. Why are many of my songs not being played at all? There’s a reason why I add each song to my playlist: I like them all!  Is there an algorithm that causes this? If so, I have attempted to counteract it by clearing all histories. Also, none of the songs are on repeat mode, so this is not the problem. I am not sure what more to do; this is very frustrating, and I have talked to other users who share the same issue. Could there be an option to where every song must play, no matter how many times I shuffle, before being repeated? This may sound dumb because one would assume that I should merely stop pressing the Shuffle button and resume the last song played, but in order to access other Apple Music appliances and play other playlists, this is not plausible. Therefore, there should be a new button: Resume Shuffle!! This in addition to the already Shuffle button (so users can still mix things up), will create a much more enjoyable experience on Apple Music!! I am certain that other users will agree with me.",
            "region": "us"
        },
        {
            "rating": 0.4,
            "user": "nightflyre9",
            "date": "01/05/2023",
            "title": "Playlists need a LOT of work",
            "body": "I don’t know about others, but my enjoyment of a music app rests highly on the abilities of its playlists. In this regard, Apple Music is a failure. First, there is no option to search globally within all playlists at once - this makes it impossible to quickly locate a song, which should be a basic function. This also makes it impossible to find duplicate tracks within your playlists. Second, there is no option to delete multiple songs within a playlist at once - it has to be done song by song, which is absurd. No option to delete multiple albums at once, either. What is Apple’s aversion to letting the user do this? Third, when you are playing a song, there is an option to “go to album” but no option to “go to artist,” which is irritating. Apple Music looks great and sounds great, but it’s not user-friendly in the way it needs to be. Right now, I’m only using it because it comes free in a family plan from a relative. The convenience and functionality simply is not there. To the developer: pay attention to what your users are telling you. You do not know better than we do what options we want. Details matter.",
            "region": "us"
        },
        {
            "rating": 0.2,
            "user": "Louieloo",
            "date": "10/18/2022",
            "title": "Less User Friendly",
            "body": "Latest update has taken a fine app and simply made it less user friendly. Among other issues, the main two problems are the complete loss of the scrubbing ability and the ‘previously played’ and ‘up next’ features of the app. The ability to scrub through songs has just been removed, replaced only with a volume slide bar which is about as unnecessary as it gets, I’d prefer a return to the old format here. For the playlist feature, when you press the song being played and the previously played and up next songs pop up, the top of that screen is too close the activation area for opening the notifications slide down page. The result is that whenever I’m attempting to close the playlist page by sliding it down, I open my notifications page - simply less user friendly. Please restore these features to their older formats and have a few more trial testers before releasing this sort of failed update.Additionally, when I click the suggest less songs like this, the button should simultaneously function as a skip song button. Why would I ask the system to suggest less songs like that and continue listening to the song? Pandora had this figured a decade ago.",
            "region": "us"
        },
        {
            "rating": 1.0,
            "user": "juice WRLD 999 33",
            "date": "2021-09-26",
            "title": "Best music app",
            "body": "You can download music videos, play music with Siri, and so many, all you have to do is just pay 10$ a month, I say it is worth the experience, you can download so much music, it even clean versions, which are great, I say it is worth it, and the best app for music, my favourite, after struggling to find free music, I just got myself an apple gift card, and got a sub rip toon, and I got 3 months free, I absolutely love this app",
            "region": "ca"
        },
        {
            "rating": 0.8,
            "user": "NENathaniel",
            "date": "2021-09-29",
            "title": "Better than Spotify",
            "body": "Bug Report:When adding several songs in a row to a playlist, some songs will not add right quite regularly",
            "region": "ca"
        },
        {
            "rating": 0.6,
            "user": "mominule",
            "date": "2021-10-21",
            "title": "Download issue",
            "body": "After the new 15.02 update its hard to download songs on full resolution. Sometimes the songs stop playing after 15 seconds and its tough to download songs. Also, it glitches and stops playing songs if it is not downloaded",
            "region": "ca"
        },
        {
            "rating": 0.2,
            "user": "hannaeightyone",
            "date": "2022-01-18",
            "title": "Switching back to Spotify",
            "body": "Lagged on my computer, poor suggestion of songs, literally my taste in music dropped after switching from Spotify to Apple Music.",
            "region": "ca"
        },
        {
            "rating": 0.2,
            "user": "Jessie3049",
            "date": "2022-01-24",
            "title": "Why Did You Delete My Music?!?!",
            "body": "I’m a huge music lover with an extensive playlist. It took me multiple hours of the course of a few days too add and download over 900 songs, after about a week or two of using the app almost all my music DISAPPEARED. I woke up one day and had only 126 songs left on my account out of over 900… 800 songs just disappeared, I’m extremely disappointed and frustrated. Downloading Spotify instead!! If I could give this review 0/5 stars I WOULD",
            "region": "ca"
        },
        {
            "rating": 0.4,
            "user": "Marian215",
            "date": "2021-10-17",
            "title": "I need to redownload my music",
            "body": "When i wake up my music says it isnt downloaded when i downloaded please help whats going on it never happen like this",
            "region": "ca"
        },
        {
            "rating": 0.2,
            "user": "chiggggga",
            "date": "2022-02-22",
            "title": "Apple can do a lot better than this",
            "body": "You pay a premium amount and download songs yet when you don’t have WiFi connected, downloaded songs do not playThe most annnoying is when you change region the content automatically disappears, now you have to start searching for songs, setting up new playlists. If I could give it zero I would.",
            "region": "ca"
        },
        {
            "rating": 0.2,
            "user": "yourdonr",
            "date": "2022-02-22",
            "title": "Review",
            "body": "This is not a good app I was using it and it deleted all my songs and playlist",
            "region": "ca"
        },
        {
            "rating": 0.2,
            "user": "Morigan777",
            "date": "2023-07-19",
            "title": "New IOS update trash",
            "body": "No way to review the update so here ya go apple… why you get rid of the old wallpaper and have such a limited selection now??? You supposed to get better, not the complete opposite… very disappointed with apple and all it’s product and service(s)… especially Apple Music, the radio is Better at saving my music than apple is… two thumbs down apple 👎👎",
            "region": "ca"
        },
        {
            "rating": 0.2,
            "user": "BanDoges",
            "date": "2022-11-03",
            "title": "Due to distribution rights music isn’t available everywhere",
            "body": "So basically if you’re in Canada you can’t listen to certain songs that are readily available outside your country very disappointing",
            "region": "ca"
        },
        {
            "rating": 0.8,
            "user": "GhostyPlayer",
            "date": "02/05/2022",
            "title": "Great, a suggestion",
            "body": "I love Apple Music, have been using it for years as my main music streaming service. Super clean and easy-to-use interface, simple format to make playlists and discover artists etc, I love it. Definitely recommend it to anyone looking for a new service. A suggestion I have is to be able to see how many times you have listened to a song. I know on the laptop/pc version this is available, but since I mainly use Apple Music on mobile this would be super convenient. Especially as the music usage doesn’t always sync, making the statistics less accurate for the non mobile devices. Perhaps this could be integrated into the sort function or in the drop down menu that shows up when you press and hold on a song. Either way, I would love to see this feature added.",
            "region": "au"
        },
        {
            "rating": 0.6,
            "user": "LouiseLj423",
            "date": "17/05/2022",
            "title": "NOT HAPPY!!!",
            "body": "Been using Apple Music for years but today I noticed an huge error with playlists in this music App. After updating to the new iOS 15.4.1 (on Sunday); today (Tuesday) I went to play my regular playlist and noticed that HALF of the songs (from the top to the middle) was deleted out of the playlist! I never change the order of the songs and I don’t never like deleting songs out either. About 50 to 100 songs just disappeared out of that playlist but only after updating to the newest iOS. THANKFULLY they are still purchased and in my library still! But it’s going to be extremely frustrating putting every single song back and trying to remember each placing. This error has never happened in the entire 10 years I’ve used the Music App/Apple iPhone. There is also no possible way for anyone to take over my iPhone at any time so I know that it’s not that.Is there anyway I get the data back from the a few weeks ago? I do not use iCloud and I synced/updated my data to another device before noticed that the iOS removed half the playlist. P.s: I noticed that skipping through the songs now is INCREDIBLY laggy! It takes more than 2 seconds to skip through. Even through just 2 songs and back.",
            "region": "au"
        },
        {
            "rating": 0.4,
            "user": "Snuffpuppet",
            "date": "10/01/2024",
            "title": "Not happy.",
            "body": "As a user of iTunes since 2005 (previous products much longer) and having around a 100gb of Music, I feel qualified to give fair critique, I think it’s disgusting that albums paid for in full seem to have a shelf life (depending on I’m guessing licensing agreements) Apple fails to notify of these changes and when attempting to listen to these albums sometimes at a much later date, it now says not available in your country or region, it was available when you sold it to me though and I downloaded but now isn’t available and the downloaded also disappear, I see this as theft, and considering Apple now has us locked in, I mean obviously once you have built a substantial music library (and movies etc) leaving for a different or maybe better product becomes unrealistic because of the costs of replacing your whole library, not just the device,  I’m tired of these silent but real standover tactics of Apple (and other corporations). The truth is it’s really bad service because we older and long term customers are the founding customers who built your business, the fact you don’t recognise that and pretty well treat us how you please is disgraceful.",
            "region": "au"
        },
        {
            "rating": 0.2,
            "user": "KefeExpress",
            "date": "25/11/2023",
            "title": "Sound Quality",
            "body": "I have an iPhone 11 Pro Max, still in perfect condition no issues with it at all, Best Phone I have ever had since the iPhone 6Plus! Recently towards mid November 2023 I updated my phone to the most recent IOS as you do with Apple products. I had only recently as well subscribed to My Music making it the first time I’ve paid for songs on my phone no issues. Sound was great Bluetooth in the car music is great loud bass everything perfect as you would expect for paying for this service. However, after upgrading to the latest IOS streaming music now in my car has been horrible the sound quality is low, no bass no more have to put my car volume to full to even hear the words of any song now. Initially I thought maybe my Bluetooth was playing up, nope. Turned my phone off and restart re-downloaded music app nope still same issue. I then stream music from another free app and it was playing like how My Music use to play. Apple please fix this, I don’t want to cancel I love that every song is available I just the quality to return please I don’t even know what happened please fix",
            "region": "au"
        },
        {
            "rating": 0.8,
            "user": "Anonymous Prokaryotic",
            "date": "19/08/2023",
            "title": "Sing option",
            "body": "Beautiful app with great exclusive features, however, I noticed the song feature was stripped from my device (IPhone XS Max), before the software update and application update I had this feature. Now I notice on the Apple website that it is only supported from IPhone 11+. A bit disappointed this feature was removed from my mobile device and was curious on why it was, however, does not change the main opinion of the application. Great interface and the exclusive audios and features within songs that are only available on Apple Music and not on other streaming platforms make the experience of switching enjoyable and immersive with the content.",
            "region": "au"
        },
        {
            "rating": 0.4,
            "user": "Lachy_of_Smeg",
            "date": "28/09/2023",
            "title": "Baffling app design",
            "body": "This app is very poor, especially compared to Tidal. When I first started with Tidal, it’s library was modest, but now it is Apple that is lagging, at least with artists that I like. The Apple Music app is not intuitive. It is hard to find music- it’s easier to find music in the ‘Sleep’ genre than Jazz! I gather that their song/artist recommendations are poor too (in Tidal they’re excellent). Your ability to customise your home screen is non existent. For example, why do I have to see ‘kids corner’? For someone who doesn’t have kids (or who wants to but cannot) this is annoying/depressing. The creators of the Apple Music app seem obsessed with playlists. It’s easier find out what other people are listening to (top charts, curated playlists etc) than to find things that I like or might be interested in! It is bizarre!Speaking of bizarre, my library has artists and albums from iTunes days, and newly favourited albums. But newly-favourites artists? Oh no, sorry they’re under the ‘listen now’ section. So despite innovations like the expansion of Lossless and the addition of Spatial Audio, it’s still junk. It’s like selling some of the best ice cream in the world from a recently used abattoir that has a dubious hygiene record. Hope this helps others’ decisions.",
            "region": "au"
        },
        {
            "rating": 0.2,
            "user": "bunkahmedia",
            "date": "12/02/2024",
            "title": "Spam pop up Ads - Is this really run by Apple",
            "body": "Apple Music ads are now running as spam pop-ups that take you to the subscribe page when you click to close the spam ads in all kinds of games that normally have the dodgiest of ads - like Zynga’s Words With Friends.Many of Zynga’s games have been proven to be types of gambling in disguise, where the players can not win real-world fiat currency (money), but can easily lose hundreds of dollars a week by being baited by their apps to buy all kinds of worthless digital products in order to win the live online anonymous player games.They abuse psychology, including child psychology with games available to young children to fill their coffers with every increasing billions in profits from vulnerable people and the young and innocent alike.Is Apple’s senior management aware that the likes of Apple Music’s marketing team are in cahoots with such low lives?",
            "region": "au"
        },
        {
            "rating": 0.6,
            "user": "Fordesman",
            "date": "04/03/2022",
            "title": "Couple of suggestions.",
            "body": "1. Search function is way too specific. I thought Apple would get this right by now. Literally copy + paste Spotify’s search system: keywords, misspelling and partially correct searches should show ALL returned content and sort by popularity, with popular content at the top.2. Create a “remove from current playlist” function in the hold menu of any song in your queue that is playing from the current playlist. Another simple one that would make all the difference, saves scrolling through a playlist for a song that shows up that shouldn’t be there.3. Content in “My Library” used to show up instantly in search, now there’s a delay like it’s scanning some sort of online database. Not a big issue but just wondering what changed?",
            "region": "au"
        },
        {
            "rating": 0.6,
            "user": "The FLB",
            "date": "12/02/2024",
            "title": "Can’t even save a radio station?!",
            "body": "Can’t save radio stations?  Even my $50 car radio in the 80’s could do that. But a $2550 iPhone with an Apple Music subscription can’t? Welcome to 2024 where you have to search for your radio stations every time. Does anyone else feel like me that your old stereo was more fun & intuitive to use. Finding stuff seems like too much effort to me. In the old days I could pinpoint a cd/dvd/tape etc on my shelf in seconds. This feels like a tech downgrade. Wish I could better put in words but feels like everything is hidden. Maybe we need to bring back skewamorphic design? Not sure but would be good if I could use my eyes more than having to rely on my memory. It’s actually what I hate about most modern tech",
            "region": "au"
        },
        {
            "rating": 0.2,
            "user": "DamirRomanik",
            "date": "03/12/2021",
            "title": "Not designed as a personal SONG librarian",
            "body": "Some people just want a good flexible easy to use software, ability to transfer songs and arrange playlists between their multiple devices, unfortunately this is not a great choice as it does not allow you to load songs or manipulate your playlists on portable devices, it has serious restrictions which makes this software useless or very hard to persevere with.No lyrics display editor on portable devices, no easy and logical way to transfer data between devices i could go on and on.Stage traxx 3 is a much better program to use if you need a very powerfull librarian, replay software with great lyrics display and editing, song chords if you happen to be a musician and loads more features to help you manipulate your music.MUSIC you need a good look at yourself, keep up with real peoples needs and wants.",
            "region": "au"
        },
        {
            "rating": 0.8,
            "user": "Gihan H",
            "date": "18/12/2021",
            "title": "Sorting according to Alphabetical order",
            "body": "It will great to have a alphabetical sort order within your playlist. This way duplicates can be removed if same song has been saved for the same artist. The search function within the same playlist does not show correctly when the artist name is typed. I have Jimmy Ruffin song of 2 versions. When I type Ruffin it shows only 1 of the songs. In Apple TV when I goto the bottom of the playlist and select a song, it starts playing the first song. This has happened very often. Exiting/closing the Application makes no difference. Is there a limit to the number of songs within a playlist. Currently I have more than 800 songs added to a playlist.",
            "region": "nz"
        },
        {
            "rating": 0.2,
            "user": "TPBG4",
            "date": "15/09/2023",
            "title": "I do not recommend this service as there are many issues",
            "body": "1) No mechanism to provide feedback and report issues via the app. 2) No way to search for items in your existing playlists in online or offline mode - this is a significant limitation. I don’t recommend subscribing to Apple Music if you have a large collection of music and wish to play specific songs - you will have to scroll through 100s of songs yourself to find the one you want to play. 3) Cannot use Apple Music when connected to an external monitor. When connecting via USB-C to an external monitor on an ipad, the only option is to play the music on the external monitor (no option to play the music via the built-in speakers on the iPad itself). This is not a good decision as the developers are forgetting that many monitors do not have speakers. This renders the Apple Music unusable. Quite an oversight considering that the docking functionality of the iPad is targeted at productivity applications.",
            "region": "nz"
        },
        {
            "rating": 0.8,
            "user": "#imma billie eilish fan",
            "date": "28/04/2022",
            "title": "Good bit won’t download my songs",
            "body": "I have had this app for a long time and it’s really good. When I’m at home with wifi I tap to download the songs in my playlist but it doesn’t download. Today I tired to listen to a song thats not in my playlist and I waited like 10 minutes for it to play and it didn’t play so I went to my playlist and it only played certain songs that were downloaded so I tapped the download button but it didn’t work, it was like what it’s like when I don’t have wifi but maybe that’s just my phone because I have an iPhone 6s.",
            "region": "nz"
        },
        {
            "rating": 0.2,
            "user": "Cautive-Customer",
            "date": "24/03/2024",
            "title": "Decided: never will give Apple 1 more cent",
            "body": "Apple won’t allow me to even play my own music. This is extremely stupid. I paid the blood price for this stupid device, knowing they will make it hard to use efficiently. I said to myself “is ok, it might take 10 extra steps to copy my own files into it, but then I can play them” or “it might be extremely hard to get a picture out of the camera, but camera isn’t that bad”. Anyway, now I cannot even play the files. Apple executives might be saving up to see if they can afford to live slightly longer greedy lives, as they fear for the extremely selective and cautive circle of hell that awaits for them. By the way, the battery is doing its best to force me to go back to ANY other phone, by depleting itself like there’s no tomorrow. And I swear for the old gods and new: I will never buy another Apple product.",
            "region": "nz"
        },
        {
            "rating": 1.0,
            "user": "OG_SaniBugatti",
            "date": "28/06/2023",
            "title": "WOW! 5 Stars!",
            "body": "Apple  Music is probably my favourite music app ON EARTH! Apple music has a wide variety of songs of different genres. It does need wifi, but if you download your songs, you can listen with absolutely no wifi. You can my playlists and it plays all of the songs in the playlist going from one to the next. Another amazing feature is that you can make songs play over and over again without you clicking it over again. In my opinion, Apple Music is such a great app and I think you would enjoy it too.",
            "region": "nz"
        },
        {
            "rating": 1.0,
            "user": "gamejabber",
            "date": "19/12/2021",
            "title": "Prefer the clean experience",
            "body": "I’ve dabbled with Apple Music and the competition and always end up coming back. It’s clean and does music how I expect it. The app isn’t overloaded with extra features I don’t want to use and the experience is pretty stable. I like the lyrics and lossless quality. I also enjoy the curated playlists and the radio stations. I don’t think I’ll ever switch again.",
            "region": "nz"
        },
        {
            "rating": 1.0,
            "user": "adrienfloes",
            "date": "19/02/2023",
            "title": "The new",
            "body": "I don’t know 🤷‍♂️ why but I’m just really happy 😊 I’m happy 😊 happy 😊 thank for the kind words I hope 🤞 it will help a lot more people to get through it and I hope 🤞 to see your tweets too much and I’m glad to hear you have some fun and good times with your family too and I hope you get well too much too soon too soon too soon too I love 💕 🤣",
            "region": "nz"
        },
        {
            "rating": 0.2,
            "user": "Vorn10",
            "date": "29/04/2023",
            "title": "iOS 16.4.1 - Terrible for Apple Music",
            "body": "Since iOS 16.4.1 there has been terrible delays in-between skipping songs and playing another song. There seems to be some invisible buffering whether or not it’s connected to the internet, even downloaded songs wont play for 10-20 seconds. When searching an Artist or Album, it won’t open when you click on it 🤷🏼‍♂️ I don’t know what you’ve done to the app but it’s the worst it’s been since it was launched and I’ve been playing for it since the start! PLEASE UPDATE ASAP!!!! It’s horrible and I pay for it and it won’t work properly",
            "region": "nz"
        },
        {
            "rating": 1.0,
            "user": "showansimkhada",
            "date": "13/08/2022",
            "title": "Check download songs",
            "body": "Everything is good and I love apple music. The only thing I want is to check the downloaded songs cuz sometimes it couldn’t play the songs when I am offline and it got stuck on the same song. If the carousel mode is still working that looks cool as well.",
            "region": "nz"
        },
        {
            "rating": 0.2,
            "user": "Jonathan NZ",
            "date": "04/05/2023",
            "title": "Apples way - or else",
            "body": "The usual Apple mafia-like Apple way of doing business this app is only useful if you subscribe to the music service.  I have a MacBook Air with iTunes playlists that won’t sync to the Music app on my iphone.  Apple are always trying to force or trick you into paying for their services, this comes at a cost of usability even for someone who owns two Apple devices.  The devices don’t connect easily through the iTunes-Music app without a subscription..  Good business for Apple but deeply cynical and disrespectful of its users.",
            "region": "nz"
        }
    ],
    "Amazon Prime Video": [
        {
            "rating": 0.8,
            "user": "Hufflepuff11201",
            "date": "06/12/2023",
            "title": "subtitles are very finicky",
            "body": "This app is great:) There are so many included shows and i’ve had a really great time watching them. I’ve been watching Good Omens (excited for s2) and the legend of vox machina. however my only grievance is that the subtitles are a nightmare. You should have a setting to automatically keep them on. I’m not deaf or hard of hearing or anything however having the subtitles on really helps me understand what’s going on. It is really annoying to have to turn on the subtitles every-time i leave the app, or whenever a new episode starts (sometimes it works most of the time they turn off) I would really appreciate if there was just a setting to have the subtitles stay in for everything they’re available for. other than that the originals are great and the video quality is as-well, if you are also someone who relies on subtitles keep in mind that they can be very annoying at times.",
            "region": "us"
        },
        {
            "rating": 0.2,
            "user": "0310macfreak",
            "date": "03/28/2024",
            "title": "Ads 👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎",
            "body": "The recent decision to include ads without paying the extra 35 bucks a year was disappointing. At the time I decided to get paramount + through prime channels. The ads were horrendous.  To the point that I decided to bite the bullet and pay the overloads their penance.  So paying the 2.99 didn’t affect the ads in the slightest.  And the ads weren’t positioned where the ad breaks are in the show. Middle of a gunfight boom 5 minutes of ads.  After painfully finishing 1883 I started to rethink everything. I canceled Paramount + and have considered canceling prime. Let me be clear. Ads are the worst and there is nothing more triggering. If I wanted to watch ads I can watch any of the free services with ads. If I’m paying nearly 200 dollars a year for a streaming service I’d better not have a hint of an ad.  I will try subscribing to paramount + in the future through Apple TV. But if it has ads as well I might have to leave Paramount behind. The idea of buying shows seems like a much better idea at this point. Not much discovery but my generation hates ads.  Buying digital seems a scam as well even though it’s the most convenient. Scammy is the new game it seems.  If it wasn’t for Sheridan I’d leave paramount on the shelf.",
            "region": "us"
        },
        {
            "rating": 0.4,
            "user": "RubyKingston",
            "date": "08/23/2022",
            "title": "Quite upsetting…..",
            "body": "The barrage of ads is not only unnecessary, but they are also at a greater volume point that the actual entertainment that I wish to watch.  It’s extremely difficult to endure as well as the option NOT to skip the ads.  The greatest disgust is that you will sync to play not one but two ads as well, depending on the chosen feature.  Your greatest inadequacy is your lack of formatting the Prime app to the Prime screen on my chosen device.   I will choose a certain show/movie to watch from the app and proceed to my form of viewing.  I will wait a few minutes before I switch on my TV before I settle in to watch, 5-10 minutes.  My recent selection is not shown in my chosen features to watch, even after a decent amount of time.  Which leads me to search for my title.  The formats must be consistent!!  I have actually become so bothered by not only the ads but the lack of cohesive formats!!!  Please, format both to sync and allow viewers to skip your ads as more than one will play at a time.Both issues an easy to adjust.  Please make an effort to do so.  It’s quite frustrating and has decreased my viewership.",
            "region": "us"
        },
        {
            "rating": 0.2,
            "user": "TrackWhim",
            "date": "12/10/2022",
            "title": "9.24 added bugs!",
            "body": "Purchased a lot of movies. The app still recognizes the purchase but My Stuff/Purchases will only display 20 titles. Resorting from recent to A-Z or Z-A will display a different set but again limited to 20.  Whoever thought that limiting purchase display list to 20 instead of being able to scroll though all purchases should be fired for incompetence. Tried to report but it sends you to a chat feature. After being bounced to several people, I got the standard uninstall and reinstall the app and restart ipad. Neither worked.  Tried to report again and once more bounced to several different people in chat. They seem to be unwilling to report as a new bug when they fail to solve the issue.  Their work around is to go to web address to access purchased movies/shows given My Stuff/purchases is broken. Alternative if you remember every purchase you can use search feature to find it and finally have the option to play.  No more purchases until they get this fixed. The work arounds are annoying and take more time when it worked before the update.F on the last update and D- on chat experience.",
            "region": "us"
        },
        {
            "rating": 0.6,
            "user": "AB619",
            "date": "04/06/2024",
            "title": "Not entertaining",
            "body": "I’ve been a prime video member since they started the platform, I have always been quite happy with there selection of movies and tv shows, however this last couple months I have been not only been paying for my subscription including paramount + but also seem to be paying for adds. I can’t watch any show with out getting bombarded with ad after ad after ad. This has been beyond inconvenient to me and my family. I feel that almost every platform has been not only charging for subscriptions but also charging companies to place there ads. In other words your double dipping your chip. And to make things worse, we have to pay more to go add free. This is completely unfair. If you are going to place adds then don’t charge for subscriptions and if you customers are paying subscriptions then don’t place ads. This is not fair to your customers and only goes to prove corporate greed. You need to fix this immediately for your customers before you lose a lot of us.",
            "region": "us"
        },
        {
            "rating": 0.2,
            "user": "bookdoctor8890",
            "date": "01/21/2024",
            "title": "AVOID AT ALL COSTS",
            "body": "The worst company and the worst streaming app I’ve ever experienced. If I could give it negative stars I would. They very clearly have bots leaving positive reviews to adjust their rating because the internet is filled with others saying the same thing i am. The entire purpose of this app now is to force you into buying a dozen channels just to be able to watch any of the content. The UI is the worst of all the apps. None of the content I’ve purchased shows up as being mine when I search for it. Countless times it has tried to get me to purchase a movie or a season I ALREADY OWN. On top of that, if you search for a show/movie it will often make it seem as though it’s free until you start watching. Then that literal same video and any sequels (that were also listed as free) will suddenly cost money to watch. I’ve tried filing complaints, giving feedback, expressing concerns with customer service. Avoid this app like the plague, you’ll sign over the rights to every bit of privacy you have and in return you’ll be scammed out of your money and ignored by the company when you try to correct issues.",
            "region": "us"
        },
        {
            "rating": 0.2,
            "user": "clyn12390",
            "date": "06/26/2023",
            "title": "Rip Off- charges for shows on channels you purchase",
            "body": "Purchased Discovery+ subscription on my Prime Video account mainly for Expedition Unknown and am now being charged to stream it or can’t find the included version. Finding the shows the are included in my subscription or currently watched are too hard to find, however the same shows for purchase comes up first even when they are included in my subscription. This is a rip off. Why should the app charge you for shows that are included in your subscription? Why pay for the channel and this (plus others) that are included just to purchase what’s supposed to be included? Maybe this is a change but it’s too much work to look for what I’m already paying for. Also huge con that they don’t offer Peacock but I’m sure if I purchased their channel, it would be the same thing. Considering canceling as other streaming options can bundle more channels for a better price by the time you add all the subscriptions and don’t even get what’s offered without paying additional on top of the channel. Not worth it with other streaming options for me.",
            "region": "us"
        },
        {
            "rating": 0.2,
            "user": "AliceCooperFanAnthony",
            "date": "12/15/2022",
            "title": "One word: ads on content",
            "body": "Like, I’d get it if it was a smaller or a free service. Honestly, it’d be fine. But having to wait for something to load then I can click skip so I can then wait for the show I wanted to watch to load after? And even worse, the app crashes a lot when I hit skip, or just kick me to the Home Screen of the app. And maybe it wouldn’t bother me as much if you didn’t constantly push paid-for content and makes it more difficult than it should to filter the shows included with subscription. While The Grand Tour and The Tick are easily some of the best shows here, the latter is a HUGE example of missed opportunity through the lack of pushing. Even buying and watching super hero and comedy shows before finding The Tick myself, it never once showed up in suggestions. And that’s one of YOUR shows that I couldn’t find until a YouTuber mentioned it existed, off hand, in a video about something else entirely. So many missed opportunity and problems within the app, and the ads are just the Cherry on top that made me wanna rant about my gripes with the service.",
            "region": "us"
        },
        {
            "rating": 0.8,
            "user": "Trish Shane",
            "date": "12/10/2022",
            "title": "“A Haunting”",
            "body": "I love to watch paranormal shows and Prime has a lot of options…” A Haunting “ is a great example of the shows I watch.  I have no adds on my service, so idk if this is the problem when watching this show.  This is a very edge of your seat program,  the problem is, when it come toward the very end of every episode, Prime ends the program immediately after what would be the last commercial break, so I never get to see what happens at the very end.  UGH!! THIS IS SO FRIGIN FRUSTRATING!!!  It’s an awesome show and the end of it, I’m sure, would be incredible and not to mention the nformative. But I will never know what happens to the demons/spirits/residents or mediums/priests/paranormal investigators because PRIME DOES NOT SHOW THE END OF ANY OF THEIR EPISODES!!!!!PS if anyone reading this experiences this while watching other programs/shows, PLEASE write a review stating s.  Hopefully Prime will get the message and fix this frustrating bug!!!",
            "region": "us"
        },
        {
            "rating": 0.4,
            "user": "mawrycharms",
            "date": "01/12/2024",
            "title": "TV App problems",
            "body": "I didn’t give a 1 star review simply because the content you have is great! I own an LG TV and a Vizio TV. When I attempt to use the app on my Vizio it just doesn’t load all the content and I’m unable to see what I’m clicking on. When it DOES manage to load I try and watch something it continues loading then a message pops up saying there’s a problem with the app and it prompts me to close the app. When I use it on my LG TV OS it works perfectly fine which is a nice change. Although when I use my Apple TV 4K 3rd Gen. it does the SAME thing my Vizio TV does! So I’m really frustrated to say the least with my recent experience with the Prime Video app. It’s NOT internet connectivity issues because both TV’s are connected with an Ethernet cable AND every other app on both TV’s work just fine. The model name for my Vizio TV is V555-JO1, I’m not sure if it’s a problem with this particular TV model or if it’s just a problem with the app in general. I’d really love some help with my consistently frustrating problem thank you!",
            "region": "us"
        },
        {
            "rating": 1.0,
            "user": "Spidergitch",
            "date": "2017-09-23",
            "title": "Not available in your current location",
            "body": "The app itself is fine, it does what it’s supposed to, however, the content is a huge disappointment. Why on earth would anybody pay a monthly subscription for a steaming service that promotes amazing shows, only to prompt “not available in your current location”. Seriously, 90% of the shows aren’t available, what’s the point?! Thanks for the free month amazon, but even that wasn’t worth my time.",
            "region": "ca"
        },
        {
            "rating": 0.6,
            "user": "KeithBlair",
            "date": "2017-09-22",
            "title": "It’s ok",
            "body": "It’s good, but having Apple TV support would make this app/service way more useful!",
            "region": "ca"
        },
        {
            "rating": 0.6,
            "user": "CWong1987",
            "date": "2017-09-23",
            "title": "Decent selection clunky app",
            "body": "The selection is decent and it has good variety but the app is clunky and hard to navigate. Would benefit from being easier to navigate and from a recently watched option.",
            "region": "ca"
        },
        {
            "rating": 0.2,
            "user": "sondra99999",
            "date": "2019-10-18",
            "title": "Disappointed",
            "body": "Very disappointing selection for Canada. Definitely not worth the cost. The selection is very limited and you still have to rent or subscribe to different services within the app . Will not be renewing as there is not enough content to justify price when regular tv services offer more selection and content",
            "region": "ca"
        },
        {
            "rating": 0.6,
            "user": "Moira Nehemia",
            "date": "2019-06-26",
            "title": "Chrome cast",
            "body": "Please add chromecast support! I would use this service much more but I cannot use it unless on my phone. Many shows are on prime which aren’t available elsewhere, however, like Netflix the offerings for Canada are much less robust than those for the USA. Still my kids enjoy it. But I can only use this streaming service from my computer and even then is a tedious thing. Chromecast support would really help.",
            "region": "ca"
        },
        {
            "rating": 0.2,
            "user": "creepynut",
            "date": "2018-12-01",
            "title": "Needs chromecast support!",
            "body": "Browsed around content seems great but I need to be able to watch on my TV like all the other streaming video apps.",
            "region": "ca"
        },
        {
            "rating": 0.6,
            "user": "wituworhdnaie",
            "date": "2018-11-06",
            "title": "Like Netflix but worse",
            "body": "It’s nice to use from time to time, especially since it’s all included with our prime membership, but it is definitely lacking in many regards. The titles are limited and often older or low quality. The few higher end tv shows or movies that sneak on are extremely over advertised (I was seeing Jack Ryan trailers for MONTHS). I’m not sure if this is due to it being a Canadian account, but Canadian Netflix has plenty of options still. The app is clunky, but works good enough. The option to skip ahead or back with screen taps is nice. It’s a real shame that it isn’t compatible with Apple TV or chrome cast though.",
            "region": "ca"
        },
        {
            "rating": 0.2,
            "user": "E95",
            "date": "2018-12-10",
            "title": "Poor aspect ratio on 2018 iPad Pro 11\"",
            "body": "The app aspect ratio has not yet been optimized for the 2018 iPad Pro 11” causing black bars to appear on both sides of the screen, with there being no way to make a video actually full screen. Netflix and YouTube have already optimized their apps weeks ago. Prime Video is lagging behind.",
            "region": "ca"
        },
        {
            "rating": 0.2,
            "user": "kremesch",
            "date": "2019-05-06",
            "title": "No watch history across devices.",
            "body": "Kind of pointless when you can’t view your watch history across devices and family members are not responsible or accountable for their viewing habits. Will return if/when this is addressed. I do not want to CONTROL the household through parental controls. I would prefer transparency instead. If I have to turn on restrictions, I can not justify paying for it.",
            "region": "ca"
        },
        {
            "rating": 0.4,
            "user": "jakeisapickeman",
            "date": "2020-01-06",
            "title": "Poor interface",
            "body": "It’s tough to re watch a t v show. When I open the app there is no way to continue where I left off and there are also more than one icons for the same show because each season has its own icon but there is no text indicating which season it is.",
            "region": "ca"
        },
        {
            "rating": 1.0,
            "user": "Zeen0Playz01",
            "date": "23/03/2022",
            "title": "Amazing App but need’s an Edit Update",
            "body": "This is an awesome Streaming app. The massively wide variety of movie’s is very good lots to watch and experience and customer service is amazing. The only annoyance is navigating through the movie’s i have purchased and downloaded, having to scroll all the way down to watch the 1st part of a movie to then scroll all the way up to watch the 2nd part. Don’t get me wrong i have somewhat gotten used to doing it multiple times but if you guy’s could add an edit option to move movie’s to wherever you’d wish or have movie’s such as Back To The Future all together instead of having to find them everywhere else.I hope you can do this sometime in the future as I believe it would make me and alot of other customers very happy.",
            "region": "au"
        },
        {
            "rating": 0.8,
            "user": "Ozwave",
            "date": "31/03/2023",
            "title": "Updated review working now",
            "body": "Update: they fixed it so adjusting my review to reflect this so has gone from a 1 star to a 4 ⭐️ why u ask cause the menu in the app requires lots of clicks to go back to where u were so app still needs refining Running this app on my apple tv & u can see the preview video but as soon as u go start to watch anything on it u have sound but no picture yet if u pause & timeshift with the remote u can see the mini picture but the main whole screen is dark gray, updated app restarted apple tv box, restarted tv everything but this app still broken on apple tv. Now every other streaming app I have works fine ie netflix, binge, stan etc but this Prime one is broken so fix it plz. Thanks, I will adjust review when I see its fixed & working as it should.",
            "region": "au"
        },
        {
            "rating": 0.8,
            "user": "wally monster",
            "date": "04/11/2022",
            "title": "Great way to survive winter.",
            "body": "Prime is a great service for people as it provides an amazing range of films and tv programs to engage everyone! I have watched whole runs of different series and discovered fabulous actors, writers and the values from the early 90’s to today. This also shows cultural and social changes especially for women, gay and trans people and how openly they were invisible or derided in scripts and how this changed over thirty plus years. Way to go Prime! As someone whose mobility is compromised and wet weather increases pain, Prime has made many a dreary day pass quickly. I also have Netflix, Stan, Disney and Apple courtesy of my generous daughters but I spend most of my time with Prime. Thank you for your great programming.",
            "region": "au"
        },
        {
            "rating": 0.6,
            "user": "Deadly Antidote",
            "date": "05/06/2020",
            "title": "Good content, great value, basic app",
            "body": "Prime video usually gets 2 or 3 big new movies a month, has some good tv shows, and some AMAZING original content. It is fantastic value for money with a yearly subscription. The video is high quality with no extra charge for 4k. Unfortunately the app really lets it down. There is only 1 user account which makes watching shows more difficult if a family member watches the same show. There is no like/dislike button so the same content shows up even if you already watched it and content that you have no interest in shows in the recommended list. The recently added list shows the same content month after month. There is a lot of bad movies but there are some hidden gems in there, but the app makes it difficult to find. I highly recommend prime video, I just wish the app was better.",
            "region": "au"
        },
        {
            "rating": 0.6,
            "user": "Rav5000",
            "date": "01/08/2020",
            "title": "Slow and crashy",
            "body": "It’s a slow app and also crashy on a new Samsung tv. I always get oops something went wrong and then I have reset everything for it to work. Then if I ever airplay something and watch it on another tv it never stores what episode I watched up to. When I watch it from the app again it starts off from the beginning of an episode again. Also when a season finishes it doesn’t go to the first episode of the next season it just ends like there are no more episodes. The app is slow to load and slow to browse videos, the mixing in of paid movies is useless I pay for the content so only show me what’s available to me without paying another $30 to watch another season. Just be more like Netflix...show only the content we are paying to see, I don’t want to rent anything else!",
            "region": "au"
        },
        {
            "rating": 0.6,
            "user": "Sabhari",
            "date": "11/09/2023",
            "title": "This streaming service from a tech leader!!!",
            "body": "What a bummer of a streaming service!?!? Even if you can put up with the lacklustre content, the interface, both app and smart TV, is super underwhelming and extraordinarily mediocre. The mobile app doesn’t even let you drag through the timeline. The app in general doesn’t promote the latest content based on viewing preferences, it doesn’t curate content based on views, it doesn’t give you an option to rate content, the interface is extremely clunky where it goes to the home page when you hit back, and the list goes on…If you’re even planning to compete with other streaming services, now is the time to pull your socks up.",
            "region": "au"
        },
        {
            "rating": 0.6,
            "user": "possumx7",
            "date": "09/04/2023",
            "title": "Disappointed",
            "body": "I was very happy with prime in the beginning but when I went to watch, for example: Chicago fire 9th season you couldn’t watch any more until you subscribe to that channel, problem is even if I did I still couldn’t get it in Australia so there’s no point. That’s just 1 program. They’ve done it for a few other tv shows. I’m on the verge of canceling my prime as there’s nothing more frustrating than been half way through a series and you can’t go further. No I’m on the lookout for an app that has them all without pushing the purse stings further. Better not to have any. Saves money and stress.",
            "region": "au"
        },
        {
            "rating": 0.2,
            "user": "Salman Dharani",
            "date": "18/01/2022",
            "title": "Account Suspended",
            "body": "Extremely dissatisfied with the service. I had contacted to customer service to recover my old account but no help from anyone. Instead they asked me to close all the accounts and reopen the account again. When i tried to reopen the account then it gave me an error stating the account already exist. This is bound to happen; however i contacted to resolve this issue now and another representative recommended some steps which eventually took me to square 1 again. At the end, the representative have asked me to create a new email address to overcome this. I did this too yesterday and today i see that the new account is locked as well due to misuse of account. This is extremely frustrating and disappointing. Can someone look into this ASAP??",
            "region": "au"
        },
        {
            "rating": 0.2,
            "user": "MB<?>",
            "date": "24/09/2021",
            "title": "Poor or no customer service when things go wrong",
            "body": "I had trouble with the sign on process and things went down hill from there. My account was locked, the system wanted verification of details done online but would not let me log in to provide the details as the account was “On Hold”.  No response to my email. No published phone number for Australia. After 2 days I found a contact phone number on an unrelated site. Two calls to the call centre and each time I received a template email with a request for a copy of a paper credit card statement.  I’m using a debit card so the online state has an account number rather than the card number. Really not worth the effort. Netflix was so much easier.",
            "region": "au"
        },
        {
            "rating": 0.2,
            "user": "Khazuals",
            "date": "31/10/2021",
            "title": "Paid subscription with ads???",
            "body": "This is not a free service, which is not my problem. My issue is that before every episode or movie you watch, an ad is played. This ruins the feel of being immersed in the content you are watching. If it was free then fair enough, play the advertisements. But we are paying to watch content on demand and should not have to watch an ad. Yes you can skip it, but it’s annoying to have to open the app to do so. Also, the subtitles are terrible. Incorrect words are often displayed and almost every caption is missing a space between two words. Some programs are dated incorrectly. A lot of content state they were made in 2020 but are clearly decades old.",
            "region": "au"
        },
        {
            "rating": 1.0,
            "user": "That handsome Maori",
            "date": "27/09/2022",
            "title": "X-ray is such a cool feature",
            "body": "I have held off getting prime and have had it a short while now and I thought to watch one of my classic faves. But whilst watching on my phone on the bus I come across the X-ray feature which added more entertainment value to my movie. In the trivia section It shows continuity mistakes, facts behind quotes, inspirations for costumes and characters. A lot more valuable than Netflix or Disney.",
            "region": "nz"
        },
        {
            "rating": 0.2,
            "user": "Roys_Shadow",
            "date": "20/11/2019",
            "title": "0 stars!!!!",
            "body": "So I live in NZ, I used the 1 week trial, and cancelled it because it wasn’t that good... and they are still charging my card. I have tried to put through a email in their web form, and they have emailed back but the email address they emailed from bounces back every time I try to reply to it! I then emailed through the web form again to email me from an email address I can actually reply from, and they say I can reply to it, but again, bounces back. Can’t call their contact centre due to the ridicules international charges and they can’t call me. So my card is still getting charged for a service I do not use. I have no subscriptions in my account, and no cards added. It’s horrible. Don’t get it! Disney + and Netflix are way better",
            "region": "nz"
        },
        {
            "rating": 0.8,
            "user": "raccoon365",
            "date": "22/05/2022",
            "title": "Prime Video - awesome platform, awesome price!",
            "body": "Love using prime video as it’s super affordable and has great shows, especially their originals - such as the Marvelous Mrs. Maisel (highly recommend!). Also obsessed with the X-Ray feature! My only problem is their small range of movies/shows; I hope we will see more classics and popular shows outside of their originals in the future. Not the biggest problem though, it’s absolutely worth getting their gold, like no other documentaries and shows you can find on here!",
            "region": "nz"
        },
        {
            "rating": 0.2,
            "user": "bobbik79",
            "date": "14/06/2022",
            "title": "Minus a billion stars- I have paid my subscription but unable to stream",
            "body": "I have paid my monthly subscription, which is shown in my iTunes/iPad/iPhone account/settings and also on my bank statement yet I am unable to stream anything. Your app persists on insisting that I have to pay to watch. I ALREADY HAVE. I was charged on the 8th of June and payment has gone through. I will not pay twice. I have contacted apple support which gave me no help and have attempted to contact the developer of your pathetic app but have been unable to receive any assistance. I will cancel my subscription and stick to Netflix, Neon and Disney + at least these platforms don’t rip people off.",
            "region": "nz"
        },
        {
            "rating": 0.2,
            "user": "Dixon Court",
            "date": "12/07/2021",
            "title": "Ads ruin the experience",
            "body": "Firstly, the app itself is fine. We have no tech issues or bugs, ChromeCast works fine, etc. The content is decent, they have an okay range of shows, including a few favourites.But there is literally no justification for playing ads between every episode. This is a paid subscription. If I pay for the service, and tell it what I want to watch, it should *NOT* then force an advertisement for some other show on me.The ads are skippable (this is new since I last had the app a couple years ago), but this is a big hassle on ChromeCast as you’re not sitting there with the app open waiting for the ad so you can skip it.Maybe play ads once someone’s show has ended so they can find something else, but not before playing the show I literally just asked to be played. The whole point of Streaming is to watch what I want when I want to, and I’ll stick to Netflix if this app continues to shove ads where they don’t belong.",
            "region": "nz"
        },
        {
            "rating": 0.2,
            "user": "Katelyn1749382781739",
            "date": "06/09/2023",
            "title": "Customer support not helpful",
            "body": "I have been temporarily locked out of my account due to “unusual activity” don’t know what that means for a streaming site and when I emailed customer support they told me to follow on screen instructions and they will review and respond within 24h, they only instructions I can find is to contact customer support as I don’t have access to a computer and when I emailed them back asking what else I can do to unlock my account they haven’t replied… kinda frustrating as this is now my main streaming platform now I have no way of streaming tv shows and movies without creating another account",
            "region": "nz"
        },
        {
            "rating": 1.0,
            "user": "Selina Kirk",
            "date": "25/09/2020",
            "title": "Where’s the rest?",
            "body": "Where’s Prince of Egypt? Where’s Joseph King of Dreams? NOT AVAILABLE IN NZ!!! I honestly hate this. The fact that you have limited content restricted to certain countries is so disappointing and I don’t understand it. I would not download this app unless it was free (which it is) You’re contents pretty outdated but would be great if you actually had stuff available in New Zealand 🇳🇿",
            "region": "nz"
        },
        {
            "rating": 1.0,
            "user": "Trey_trixx",
            "date": "08/04/2018",
            "title": "Awesome app! Recommened",
            "body": "Tbh i only downloaded it so i could get the free skin for FORTNITE, then ended up browsing through it and actually ended up liking the movies and shows it offered. Could really do with some more current and recent year movies for sure but awesome app either way. And only for $4.50(NZD) a month so im not complaining. Would definately recommened espcially with the free trial available",
            "region": "nz"
        },
        {
            "rating": 0.6,
            "user": "Sri1728",
            "date": "30/06/2019",
            "title": "Casting",
            "body": "There is no casting feature in mobile app to tv. As far I know so many people expressed the same feeling. The reason they are not using the prime is “no casting option”. If they want to watch a movie in Bigger screen then they have to connect their laptop with HDMI cable to TV. Nobody will continue that process every time they want to watch a movie. If you guys can add that option, there will be huge scope to increase the number of users.",
            "region": "nz"
        },
        {
            "rating": 0.2,
            "user": "Chocolate-n-Coffee",
            "date": "09/03/2020",
            "title": "No service assistance despite promises.",
            "body": "Streamed successfully for the first hour or two. Then almost without fail, no matter what the program being watched, the content would drop out into ‘buffering’ mode then give an error message, and stop completely.  Really, REALLY annoying.  Tried Customer Support, had to spend an hour going thru all the options we had already tried, no avail.  They promised to call back - but only did so, once, well after bedtime NZ time.  Despite efforts to reconnect with them, - silence.  Useless.    I have withdrawn my sub, needless to say.",
            "region": "nz"
        }
    ],
    "Netflix": [
        {
            "rating": 0.8,
            "user": "BlazeeOfficial",
            "date": "12/30/2021",
            "title": "Could be better",
            "body": "1. There should be a feature where you have to enter your account with a password so many people are entering my account and deleting my favorite shows and watching other shows I do not like. 2. There shouldn’t be max accounts I hate sharing a Netflix account with my brother everyone should have a Netflix account on there own. 3. (I do not know if this feature is added) You should also add a feature that locks episodes or movies so your kids cannot watch them. 4. You should sort movies and shows by ratings like PG 13 will go in a row and TV MA there. 5. You should finish some shows. In Netflix most shows are left behind with like 3 seasons but the real show has 8. 6. You should be able to delete movies and shows from the continue list. It is so annoying. 7. Also you may wanna put a lock on PG 13 and TV 14 and TV MA  and rated R and you have to enter a pin and your face so they will know you are not young. 8. You should put a list of shows and movies that you do not like and they won’t be visible to you anymore. 9. You should put a swear word censor on the kids account or Adult account it will be in audio and subtitles. 10. No kids should watch inappropriate stuff and I been seeing on the kids profiles. I hope you can fix all this. Bye",
            "region": "us"
        },
        {
            "rating": 1.0,
            "user": "Rising17",
            "date": "10/25/2022",
            "title": "Wow!",
            "body": "I have been using Netflix for years now. It is so amazing! There are unlimited shows for all ages and show types…what i mean is different types of shows for different people. Action, comedy, horror, romance, family…it’s all there. Personally, my favorite show is Bunk’d, which would be considered comedy. I highly recommend it!!! So amazing. There are so many options.One thing, though. There are some inappropriate shows that show up on even a kids profile. My mom still makes me use a kids profile because of all the inappropriate shows about nudity, drugs, etc and shows with swearing and stuff. It still shows up even on that profile. Just not as much. But could you please have that stuff ONLY on adult profiles? I don’t like seeing it, and I’d rather have a Watch Together profile, and still not see it much. My little siblings—we’re talking toddlers here—see that stuff on their profiles too. I really would like it if you didn’t have all of that.But Netflix is mostly amazing, which is why I gave it five stars, though it was close to four stars because of the inappropriate show stuff. The search bar is so easy to search stuff up, and downloading is nice too (BUT PLEASE MAKE BUNK’D DOWNLOADABLE!!!!!!!). Netflix is cool yo. 😎",
            "region": "us"
        },
        {
            "rating": 0.8,
            "user": "AwesoMapes",
            "date": "03/13/2022",
            "title": "IDEA FROM A CONSUMER/VIEWER.",
            "body": "I was scrolling through Netflix and I had a wonderful thought so I decided to act on it and write to Netflix through this review. There are plenty of times when I’m scrolling through Netflix and I am trying to avoid nudity in shows and movies. Wouldn’t it be great if there were a way to toggle on and off all shows that have a specific tag instead of just the rating? For example, there are plenty of shows that are rated TV-MA and don’t have nudity that are great to watch. However, you have to filter them all yourself and check the rating before hand and it takes up a lot of time when looking for something new to view. Now, imagine if I can just go to me settings page and toggle on and off certain tags to make my browsing easier by removing shows/movies with the tag from appearing during your browsing. Now I know that doing it with every single tag would be a pain in the behind but just doing the major tags would help out a lot of people I think.I also, want to explain what I mean by tag in the case it isn’t clear. I’m not talking about genre such as thriller, action. Etc. I’m talking about the tags associated with the rating system like nudity, extreme violence, adult content, adult language, etc.",
            "region": "us"
        },
        {
            "rating": 0.4,
            "user": "angrycustomer65",
            "date": "02/10/2024",
            "title": "Greedy company",
            "body": "I live in 2 different apartments during the week due to working 2 different jobs. I have the most basic plan because it is mostly just me watching. Occasionally my roommate watches something on my account on the shared tv. I am barely affording to live in this society while working 2 jobs and all I want to do sometimes is sit down and watch something while I eat dinner or before bed. Since they made the new 1 household rule, I continuously have to verify devices and re sign in. I have contacted them and they’re like too bad you have to verify your devices every month in order to use them all. They won’t discount my membership for the inconvenience and they won’t fix it. I finally cancelled my membership due to the emotional distress this has caused me on several occasions. I have pretty severe depression and the lack of accommodation for this disability is quite disappointing. I consistently use the same devices to watch Netflix and yet they still have to be reverified every month. I’ve notified them on multiple occasions of the issue and nothing is done. Sad to cancel but I can no longer handle this extra source of stress in my life. It already costs too much money as it is. Using my very limited energy on re-verifying devices constantly is something I no longer wish to participate in. When you fix this issue I will consider signing up again.",
            "region": "us"
        },
        {
            "rating": 0.6,
            "user": "mytw0b1ts",
            "date": "04/12/2023",
            "title": "Doubt anyone reads these but",
            "body": "Oh Netflix. I will say navigation is better on mobile than a computer - on computers when you get suggested titles there’s no easy way to rate what you’ve already watched and yet in both places that presents a problem within itself - if I’ve already watched something I wish you would remove it from the rows of shows and movies and the better way to do this would be to have a previously rated section where all these already rated shows can live. With all the content Netflix has the cluster of what you call organization is a huge turn off and I find myself using the platform less because of it. Also, Netflix basically birthed the term binging so I also hate when you try to be like traditional cable and release shows by date - whoever decided this was a good idea - you don’t understand a competitive advantage when you have one as no one really likes having to tune in weekly if they also had the option of just watching all the way thru (time permitting of course). Again you’ve managed to take a competitive advantage and found a way to regress to be like everyone else. Sometimes people try too hard and overlook the easy reasons why they are losing subscribers and a lot of it has to do with when you lose those core things that made you great.",
            "region": "us"
        },
        {
            "rating": 0.8,
            "user": "Felonymelon",
            "date": "07/18/2023",
            "title": "Some great suggestions! Please read Netflix",
            "body": "I would love to recommend adding a “Start Over” button prior to watching or even once the movie/tv show starts playing. I can’t tell you how many times I’ve had to swipe the lil’ timer button aalllll the way to the left o start something over & then the app freezes. Just add a Start Over button! But keep the resume button as well. People prob. want both! Would also like to remove the rating thumbs off of the screen while watching. It was fine where it was. I understand it helps y’all know what to keep as well as I’m sure it helps the algorithm to suggest shows I may be interested but I actually want to press it less now that it’s in my way. A section geared toward teens would be awesome! Not just young children. Lastly, I would also love an “Expiring Soon” section & also add a little notification as well when clicking on something to watch. Nothing I hate more than when I go to watch something & find it’s no longer on Netflix even though I added it to my watchlist within weeks or even days….Had I known, I would have watched sooner! Otherwise thanks for always being there for me :’) Been watching since the good ole mailing system days!",
            "region": "us"
        },
        {
            "rating": 0.6,
            "user": "hernameisnotknown",
            "date": "11/10/2021",
            "title": "Meh",
            "body": "Their morals are obviously skewed considering the majority of the content (let’s not forget that controversial pedo-friendly film Cuties that is still up), I’m going to let my subscription lapse because I haven’t found myself on here in months. The final straw was the fact that you can only change your account settings online, not through the app— get with the times, you’re a huge conglomeration and you can’t even cancel through the app? There are tiny companies that have figured out how to offer that feature in their apps, it’s clear you just want to make it difficult for people so they’ll give up without really trying, an insidious way to make money. Like a leech. They used to have a lot more comedy specials, I’m talking at least 2 dropped a month and then shows like ‘Best of Standup’, etc., but those haven’t gotten updated in awhile, and I can always just watch rips rather than continue to support a company that- unfortunately like most- has questionable standards and chooses to invest in ideas for shows and movies that are just, I mean, over-the-top sexual, violent, etc., in a way that it’s just like, we get it you’re trying to shape the world so it thinks this stuff is ok, but anyone with any morals, will always know it’s not. You’re just trying to convince yourself.",
            "region": "us"
        },
        {
            "rating": 0.2,
            "user": "Aprettyangryman",
            "date": "05/27/2023",
            "title": "Finally canceled subscription",
            "body": "After years of marking up the price over and over I have finally had it with Netflix and their price increase over password sharing. I reached out to customer service to see what I could do about using the service in my home I travel to for work, as I am still in the same household as my family but would like to access Netflix. This man’s response to me was “use the mobile app” and when I said I can’t watch on my tv he said “no you have to pay 7.99 for another screen” So I have to pay extra for a service because I travel for work and want my child to be able to watch at home still? This is how you treat customers that have been with you for years? I hear you loud and clear Netflix. Paying for 2 screens is not enough for you, you need more from me. I think you will find this move, and the way you are having your representatives address this with customers (rude and dismissive quite frankly) will be the end of your company. No amount of original content games or reruns will entice people to pay for your app, when there are much better services out there for a lot less money. I actually think I pay in total for 4 other services for what you were going to charge me for your service in both of my locations. I hope you will learn from this mistake, but I don’t think you will. Congrats on being the new blockbuster!",
            "region": "us"
        },
        {
            "rating": 0.6,
            "user": "kro817",
            "date": "03/05/2020",
            "title": "Currently watching is a nightmare!",
            "body": "I love Netflix and admittedly have things streaming far too often throughout the day. Everything works beautifully and it’s easy to search for what you’re looking for and the list of saved shows is fine too. My big issue, however, is with the currently watching area on the tv app, phone app, and website. Sure there are tons (and I mean TONS) of articles all over the web giving instructions on how to remove shows from the currently watching section that you no longer want to view, but Netflix it’s your job to provide an easier method for doing this. It’s unrealistic to expect people to go into their history and delete a millions episodes of a show just to get to the movies and whatever other shows they need to remove from that section. Just allow a space on the titles to remove them from that area. Especially for shows or movies that you try out and end up not liking. They stay there for months! Also, the app on tv plays the show or movie just when you’re trying to read the info about it and guess what?? That also adds that title to currently watching! Fix this issue please! It’s 2020! We shouldn’t have to google the hundreds of articles teaching people how to get around your archaic ways with this one thing. Do better, Netflix.",
            "region": "us"
        },
        {
            "rating": 0.2,
            "user": "Panda song",
            "date": "02/08/2024",
            "title": "Not compatible with ROKU Tv",
            "body": "Dear Netflix, for the past few months I have installed the Netflix app on my ROKU TV to watch Netflix content on my TV. Unfortunately, your program doesn’t run well with ROKU’s service. One the biggest issues I have with your platform, is the app kicks me out randomly and sends me back to my Home Screen. The other problems I am experiencing with the app include slow loading, and lagging with the pause features, rewind and fast forward features. This has made my watching experience unpleasant and I find myself watching shows on Netflix as a last resort when the shows or movies can’t be found anywhere else. I have tried many things in order to solve problem such as, disconnecting and reconnecting my WiFi, and uninstalling and reinstalling the app, none of these Methods have done anything to improve the functionality of the app. Also, this problem isn’t limited to just me, someone else I know happens to own a ROKU TV and is experiencing the exact same problems. I don’t understand selling to a company that is not compatible with your services nor do I have any interest in continuing to give you a monthly fee for inadequate and lagging services. I suggest you fix this before you lose more customers like me. I would recommend others do the same, and support rival companies who can provide adequate service for the same price or less.",
            "region": "us"
        },
        {
            "rating": 0.6,
            "user": "renayr",
            "date": "2017-09-14",
            "title": "Offline viewing inconsistent",
            "body": "I love the app when it works properly. Offline mode is a bit inconsistent. I was on a plane in airplane mode and it asked for a username and password out of the blue. When I entered my credentials it would not accept. The app became unusable until I was able to connect to a network and only then would it accept my credentials. I also had issues viewing certain videos in offline mode. They just would not play.",
            "region": "ca"
        },
        {
            "rating": 0.8,
            "user": "VieiraTheVirus",
            "date": "2017-09-13",
            "title": "Rap update",
            "body": "The update made my Netflix not work",
            "region": "ca"
        },
        {
            "rating": 0.8,
            "user": "not_that_persone",
            "date": "2019-11-30",
            "title": "NEEDS MORE ANIMEEEEEE!!!!",
            "body": "This app is really good for watching TV shows, and movies and other stuff, but this app needs more popular anime! Besides that, this is really good.",
            "region": "ca"
        },
        {
            "rating": 0.2,
            "user": "nads20019292@3@3&3&3",
            "date": "2017-09-13",
            "title": "glitches",
            "body": "Okay is it just me or since the last like 3 updates the netflix app just glitches and brings ya back to the homescreen",
            "region": "ca"
        },
        {
            "rating": 0.2,
            "user": "Dips577",
            "date": "2021-03-06",
            "title": "STOP REMOVING EVERY ANIME",
            "body": "First it was attack on titan and now it’s ouran high school host club and hunterxhunter",
            "region": "ca"
        },
        {
            "rating": 0.2,
            "user": "Falcon01988",
            "date": "2017-09-14",
            "title": "Can't get past home screen",
            "body": "I literally can't get past the home screen! I sign in and it just stays on the home screen I've restarted uninstalled and signed in and out. I can't get it to work! Fix this now please!",
            "region": "ca"
        },
        {
            "rating": 0.2,
            "user": "Dezimieren",
            "date": "2019-04-08",
            "title": "Bring back airplay!",
            "body": "Removing the ability to use airplay is killing Netflix for me, ads unnecessary inconvenience. Will cancel my subscription!",
            "region": "ca"
        },
        {
            "rating": 0.2,
            "user": "Nwo_od",
            "date": "2023-03-25",
            "title": "Keeps getting worse",
            "body": "Netflix used to be amazing but with all these recent “home base” rules it’s getting ridiculous. So I can only watch Netflix in my ONE home?? What about people with separated parents? What about vacations? What about moving away for school and still using your parents? Stop making these ridiculous rules that help no one just because you want more money to make your trash rom-com season 3 movies. Netflix is going to be dropped very soon by many people with the rate it’s going at. Go back to you roots.",
            "region": "ca"
        },
        {
            "rating": 0.4,
            "user": "anbssh",
            "date": "2020-05-03",
            "title": "AGGHH",
            "body": "bring back vampire diaries to Canadian netflix!!! also so many great t shows and movies are missing , what’s that about? it’s available in other countries but not in canada?? bring back THE VAMPIRE DIARIES",
            "region": "ca"
        },
        {
            "rating": 0.2,
            "user": "Angel3246",
            "date": "2017-09-16",
            "title": "Will NOT open",
            "body": "Super frustrating!",
            "region": "ca"
        },
        {
            "rating": 0.8,
            "user": "maxx <33",
            "date": "06/09/2022",
            "title": "My Opinion On The App",
            "body": "The app all together is amazing!! I highly recommend to get a Netflix Subscription if you are bored and you like watching a wide variety of TV shows and Movies! Netflix has multiple Genres and it’s perfect for the whole family all ages!! But Netflix has a past known to discontinue Amazing and Fun Series. So don't get your hopes up for series because Some may be continued and some discontinued But yes I highly recommend Netflix it’s fun for all ages!! But Netflix has a 5 limit on Profiles and I think the limit should be a bit higher as I am a 13 year old child and my single mother has 9 children, 4 have moved out because they are 18+ but in her household she has still 5 of her kids living with her who are 18- she also has herself so she has 6 people living in her house but only 5 Netflix profiles so 2 of us share an account and 4 of us don’t so Netflix is you read this please add a bigger limit to profiles!! There are many families with more than 5 people under their house please add more profiles so other members can get a selection that suits there personality and preferred genre",
            "region": "au"
        },
        {
            "rating": 0.2,
            "user": "Freshwest",
            "date": "27/03/2024",
            "title": "Rubbish app",
            "body": "Everything had been working very well for years.   But then at the beginning of February 2024 I updated the app.  Big mistake!  Of course, the software designers have to mess around with things.  Don’t they always, in a pathetic attempt to justify their existence?  This time they took away the Downloads tab from the bottom of the screen, for reasons best known to them.  But that was nothing compared to the disaster they created.  All the downloads which I already had but which had expired, I was unable to renew them.  Forever and ever I was presented with the error message \"you have downloads on too many devices…\"  This had never happened before.  Not only that, but I couldn’t download anything.  After many calls to customer service I had to delete all those downloads and start all over again.  That is the kind of outcome customrw are presented with when a company chooses to employ incompetent software designers.  Hours wasted because of app upgrades that are worse than useless.Netflix spends a fortune on programming.  Well, it’s about time they made sure that any app upgrade is absolutely faultless before they present it to its overcharged customers.If I could give this app zero stars I would.  One is too many.  The Prime Video app has always been much, much easier to use, and after this experience with the Netflix app I’ll probably delete my account.",
            "region": "au"
        },
        {
            "rating": 0.2,
            "user": "rockinsky91",
            "date": "31/12/2021",
            "title": "Poor Customer Service",
            "body": "I loved Netflix (yes, it’s past tense), the catalogue was superb until today where suddenly the only catalog I have access to is the global catalogue a.k.a Netflix produced shows / movies only. Been a loyal customer for the past 2 years or so, this is the first time I use their online chat feature to ask for help as none of the available stock standard FAQ / problems in their website really apply to my case. First things first, I do have VPN and I understand that using VPN will cause Netflix to block the broader catalogue available in that region, I get it. The thing is I never used it whenever I watch Netflix. And by the way, the vpn is only available in my phone and laptop. There’s nothing in the router / smart tv. The thing that really puzzles me is that using my VPN, I was somehow able to access broader catalogue in my region. Of course I brought all of those information to the live chat agent, the response however was stock standard and there was a point where I felt like talking to a bot. The agent was simply shifting the problem to the ISP. At the very least I would expect he/she to tell exactly what my problem or why my account is getting blocked from accessing the broader catalogue. I think a bit more care to the customer is appreciated. I need to think of changing my ISP, if it solves my problem, great, if it’s not then it’s a lose-lose to both ISP and Netflix.",
            "region": "au"
        },
        {
            "rating": 0.8,
            "user": "I love cat 💕💕💕",
            "date": "22/08/2022",
            "title": "Best App Ever!",
            "body": "Netflix is one of my favourite apps so far! I recently got an apple iPad, and have been streaming Netflix like crazy! You can save episodes to watch them later when you don’t have wifi. For example if you’re in the car on a day trip you can just watch Netflix! It does take a while to save the episodes but it’s worth it when you’re watching.I love Netflix but sometimes it glitches out and kicks me of the app, or if I’m watching it on TV it kicks me off the TV and just says “try again later” and shows a time. This happens frequently and it’s quite annoying. I get frustrated when Netflix isn’t working for me and I have to reset the whole system only for it to tell me to try again later.But in conclusion, Netflix is a good app it just needs some updates now and then to make it easier for us to work it. Families love watching Netflix together, and I can see why. It’s a good source for anybody to be updated or just watch something fun.",
            "region": "au"
        },
        {
            "rating": 0.2,
            "user": "lazari_eclipse",
            "date": "30/09/2020",
            "title": "It’s great but needs more anime",
            "body": "I love Netflix and all but every time I finish an anime there is no good ones because I’ve watched them all and it needs popular anime like attack on titan and Tokyo ghoul or HunterxHunter because all the anime’s I haven’t watched aren’t all that good and these anime’s are popular meaning they would be watched. more and more attention would head towards Netflix because maybe people that like anime like this can’t get anime watching apps but can get an app like Netflix and their favourite anime’s can be there to watch because if a weeb watches all the anime there and can’t find more they might as well drop the entire app because the stuff they like isn’t here. Or you can just make an entire anime setting where you include popular anime’s and other anime’s so we don’t have to go searching everywhere for it on the adult setting but if you do add an anime setting repeat after me DONT’T EVER delete an anime because it isn’t getting a lot of attention it could be someone’s favourite show and if they go to watch it it won’t be there so again they might drop Netflix this also goes to any other show. if you think no because what about other shows just make room for them or look at THEIR popularity so if it does go on Netflix it gets the attention so Netflix gets attention and more",
            "region": "au"
        },
        {
            "rating": 0.4,
            "user": "NEK0M1M1",
            "date": "26/02/2023",
            "title": "Put together nice but hides gremlins",
            "body": "While the UI has been crafted expertly for ease of use the underlying groundwork is full of gremlins. Despite the fact I have certain settings like autoplay next episode enabled it refuses to do so. Other times it will randomly delete or corrupt random episodes of a show or movie. I’ve even had it just outright crash a few times. Whatever is underneath the shiny exterior is in desperate need of cleaning up.On the library side it’s hit and miss. A lot of good stuff is unavailable in Australian Netflix due to licensing (thanks Australian media monopoly) or just otherwise missing. A lot of older movies and shows are still available on here though which is nice.Content quality wise, if it’s not made by Netflix it’s most likely good. Netflix has gone severely off a cliff the last few years and continues charging more. American social politics is rife in Netflix Originals to the point it becomes the Original’s identity. For things like anime they are injecting American social politics wherever they can when it didn’t exist in the spoken Japanese dialogue in the first place through the subtitles and just outright rewriting a dialogue scene just to fit it in english dub.",
            "region": "au"
        },
        {
            "rating": 1.0,
            "user": "GhostyPlayer",
            "date": "12/10/2019",
            "title": "I love Netflix!",
            "body": "I love Netflix, it is great how there are different age group accounts you can pick from and you can have multiple accounts for the whole family. It has a wide variety of tv shows and movies, including Netflix originals. It is useful how if you  are watching a movie or show it has others films like it if you don’t know what to watch next. It’s good how it saves your progress in the movie/show. I recommend Netflix for anyone as it is great for all ages! I also love how you can download shows to watch if you are at a place that will not have connectable wifi. My only (personal) problem is that a show I was watching got taken down, I was watching it for weeks as it had many seasons but I hadn’t finished it yet and I was really upset because I cannot find it anywhere, so developers if you see this I’m really hoping if you could put How I Met Your Mother back on Netflix for a while please?? I love Netflix and I really hope you can do something about my problem. If so, thank you very much!",
            "region": "au"
        },
        {
            "rating": 0.2,
            "user": "Fan of Futurama",
            "date": "09/01/2023",
            "title": "Commitment issues",
            "body": "So Netflix all in all is an ok streaming service. However, they will Greenlight a well-received show, and after about 2 seasons they cancel it well before any meaningful conclusion can be made. At the time of writing this inside job had just been cancelled and if it was just inside job I’d understand but they have been doing this to multiple shows where show creators create great shows only for them to be cancelled. The reason why this is a problem is that I find myself watching Netflix less and less as I find there’s no reason to watch a show and get interested when chances are it will be cancelled. And it seems unfair that shows such as big mouth, paradise PD and others get 6 or so seasons whereas other shows only get 2. Both shows are ok in their own right but it is my belief that the resources are being distributed unfairly amongst the shows. Netflix is by no means the only streaming service that does this but they are by far the worse perpetrator. So as it stands one of the only reasons to watch Netflix is for non-Netflix shows as at least non-Netflix shows have some capability of following through with something.",
            "region": "au"
        },
        {
            "rating": 0.8,
            "user": "LilcatSwoleBunny",
            "date": "03/05/2021",
            "title": "Great But Glitchy",
            "body": "Personally, I love Netflix. It’s just a wide variety of movies, TV shows and more at your disposal. But there’s a couple of glitches I want to discuss.The first one is that sometimes when I’m watching a show when I finish my episode it might cause something I call the ‘Set Episode Glitch’. Basically after finishing another episode when I press ‘Next Episode’ it goes to the episode that’s locked in the glitch. It eventually auto corrects itself about a week later.Secondly, there’s the ‘Infinite Intro Glitch’. Sometimes when I press ‘Skip Intro’, it loads for a long time and then goes right back to the start. Then every button except the exit one brings it to the start again.The last one is the ‘Forever Loading Glitch’ where after skipping the intro it has the loading icon, but this is more annoying than experience ruining.Please try to fix these or at least have a look into them when you can and thank you to everyone reading this! :D",
            "region": "au"
        },
        {
            "rating": 1.0,
            "user": "perryfambam",
            "date": "12/05/2022",
            "title": "people are too picky.",
            "body": "Netflix is a really good app that goes on tv, computers and more. it isn’t free wich is understandable, and overall a good movie platform and millions of people use it around the globe. And people are giving bad reviews for dumb reasons, for example “there’s not enough anime” there’s other apps directed just for anime. If you don’t like the platform. Get a different app, because it seems like people care about it so much they waste their precious time in their precious lives to write a complaint. I see where the term “karen” comes from. Anyway anywho anyday, Netflix is amazing! (My opinion) it’s amazing for families and for little ones. There’s a kid option when you make a profile. If you have took the time to read this reply as the time I took to make this, have a awesome day/night, stay strong your loved and don’t forget to eat and drink!!! Health is important! <3",
            "region": "au"
        },
        {
            "rating": 0.8,
            "user": "kumaraaa",
            "date": "15/11/2022",
            "title": "Amazing app but…",
            "body": "Don’t get me wrong I love this app and use it almost everyday but one thing that makes me Hoha (annoyed) is that when I’m watching a series, for example: the 100 (my favourite) there was only 6 season’s available for me to watch and until about a year later I had figured out that there was one more season so I had to try and find where to watch it without paying (bc I’m not wasting more money when I already have Netflix🤣) but this isn’t the only show that doesn’t have all seasons! I recently rewatched •the next step• (I loved it as a kid) and the older seasons weren’t there and it’s kinda sad because it doesn’t give you everything you need to know.",
            "region": "nz"
        },
        {
            "rating": 1.0,
            "user": "😻😻😻😸😸😸😺😺😺🥰🥰🥰",
            "date": "23/05/2022",
            "title": "I love Netflix! But…. Just one thing! (Netflix pls read this I know your busy but it’s important)",
            "body": "Hi there! Honestly I use Netflix every single day for the last like 6 years? Idk if it’s healthy but.. ANYWAYS back to the point, my favourite show is Miraculous Ladybug and I have watched it over and over again but I still love it! Anyways, it’s only up to season 3 and none of the miraculous movie so my only complaint about Netflix would be it’s lack of series not just in this show it lots of other shows (Etc) please add more episodes to other series and movies and.. PLEASE I AM BEGGING YOU NETFLIX! PLEASE JUST ADD SEASON 4 OF “ miraculous ladybug” AND THE MIRACULOUS WORLD MOVIES AND WHEN THE  “miraculous ladybug awakening” comes out. PLEASE TAKE MY MUMS MONEY SHE ALREADY PAYS YOU ALL I ASK IT FOR THE MOVIE TO BE ON NETLFIX WHEN IT COMES OUT. IF I DON’T SEE THAT MOVIE WHEN IT COMES OUT IN SEPTEMBER I WILL CRY AND YOU WILL BO LONGER BE MY FAVOURITE APP but if not that I have no other complaints 😊-🍄✨unknown✨🍄(But fabulous)",
            "region": "nz"
        },
        {
            "rating": 0.8,
            "user": "Lia 💛💖",
            "date": "20/01/2019",
            "title": "lots of really cool stuff but",
            "body": "netflix is an amazing streaming service with loads of shows and movies but there are just a few errors that i found with the mobile app (i’m not sure if any of the other versions have these issues too). i was looking at the shows available for download and i saw that shows like steven universe and adventure time are on that list, but every time i tried to watch it, i got this notification that there was a network error. also, i can’t turn off smart downloads, so it automatically tries to download all these episodes of shows that is using up ALL of my storage. please fix these, and if there really is steven universe on netflix, then PLEASE let me watch it. thank you!",
            "region": "nz"
        },
        {
            "rating": 0.8,
            "user": "Auckland, New Zealand",
            "date": "22/01/2024",
            "title": "Netflix Review! :D (PLEASE READ!!)",
            "body": "Netflix is such an amazing app and I totally love it! Tho it has many great movies and dramas, there still isn’t enough. There isn’t a lot of Chinese dramas I love which are super popular. I bought Netflix to watch these dramas and movies I like cuz I thought Netflix would provide me more content than other apps. It’s great, don’t get me wrong, but it would be awesome to include more Chinese drama content and more series/seasons. I’ve also been watching lots of movies but waiting a long while for the next season and it’s pretty annoying having to wait. But overall a great app for people looking for a good movie or show😃",
            "region": "nz"
        },
        {
            "rating": 0.6,
            "user": "hannahrh123",
            "date": "18/05/2019",
            "title": "It’s good",
            "body": "Look the app is great but Netflix gets a two/five (stars) for its lack of new seasons for shows, by the time I’ve finished a season it’s got no more so I start another tv show only to find it’s hasn’t got more seasons yet (hasn’t finished the storyline ect.) so I start a new tv show and that process goes on and on.I added a couple shows/movies to my list so I could find them, I have removed from either disliking them or not wanting to watch them; but none of them have removed from my list. I’ll click on them and it’s says their not on my list, but they stay on my list. This glitch really annoys me so please fix it. Otherwise I love this app, the shows are good, the streaming never fails and the download feature is great. Love this app, but Netflix please fix the cons.",
            "region": "nz"
        },
        {
            "rating": 0.6,
            "user": "drewxamber",
            "date": "22/04/2019",
            "title": "Its good",
            "body": "It’s good but not great there are hardly any movies on there I’ve almost watched everything on there also takes so long for them to add the next season of tv series even tho it’s out everywhere else like for example I’ve been watching the 100 series and they haven’t added season 5 or 6 yet it’s uploaded on the internet and I just watched it for free really annoying how I get so into a series and the other seasons aren’t on there especially when we are paying for Netflix !!!!! Also another thing that annoys me is that I was watching a series and they had removed it I hadn’t even finished watching it I got so hooked and they removed it I had no warning either 😭 I don’t understand why they gotta remove it for it’s not like they run out of space 😂🤦‍♀️",
            "region": "nz"
        },
        {
            "rating": 0.4,
            "user": "NixstaChixsta",
            "date": "24/02/2024",
            "title": "Netflix Household",
            "body": "I had to cancel my membership from 2016 because of the introduction to Netflix Household. I do not have a smart TV, however I do have Chromecast. Despite this, Netflix Household would not recognise my TV or my mobile devices. I followed all the steps, such as signing out of all my devices, restarting my router etc etc, everything Netflix troubleshoot told me to do and yet, it still wouldn't recognise my TV, in fact, it just lead me in circles. This meant that even chromecasting from my phone didn't work. The only option I had was to use a temporary password every 2 weeks, which is ridiculous, as it's my own account. I refuse to pay for a service that isn't easily accessible for my family and I. Thanks Netflix, but no thanks.",
            "region": "nz"
        },
        {
            "rating": 0.8,
            "user": "cxlisili",
            "date": "22/03/2019",
            "title": "Love Netflix, but downloads need to be improved",
            "body": "I love Netflix, the app works great, lots of shows are available for download but PLEASE do something about the downloading order of the episodes. If I try to download a series and click on several episodes at the same time it will try to download them all at once and it will usually end up downloading the last episode at first and randomly finish downloading. This is so annoying as the first (next) episodes are usually the last to download! Would be awesome if you were able to prioritize downloads and order the episodes and shows to your priority.",
            "region": "nz"
        },
        {
            "rating": 1.0,
            "user": "Billy Shabbycap",
            "date": "22/10/2022",
            "title": "Excellent on XBOX. Please note that fact.",
            "body": "Flawless streaming , the movies we’ve picked thus far we gave 8/10 each. For those people programmed that a movie is about 2hrs long will discover more value in episodes/ seasons too. They’re actually long movies ! With those , Netflix has resume watching making consistently easy. The cost divided by two people is only $9 /month per person.You’ll never get bored with Netflix & XBOX series S handles video streaming with ease. You can add the app on your other devices & create extra profiles.",
            "region": "nz"
        },
        {
            "rating": 0.2,
            "user": "Thebehnam",
            "date": "11/02/2023",
            "title": "Great platform but not sure of I continue to pay for it",
            "body": "I have Netflix subscription for few years but I find it very annoying as they have lot of popular series such as New Amsterdam, How to get a way with murder, Chicago Fire or the like but all of these series is available not in full. Have been waiting for long time for the rest of season of them but no chance. One or two season it on it but they forget about the rest. Their most recent policy of single household, brings my irritation to the next level I am paying plan which is allows my to watch 4 screens at the time and I don’t think this should bother anyone where this screens are as long as they are not in commercial areas! I am not sure if I continue to pay for Netflix.",
            "region": "nz"
        }
    ],
    "Steam Mobile": [
        {
            "rating": 0.6,
            "user": "Starcrafter2010",
            "date": "10/26/2022",
            "title": "The new version adds much needed features but…",
            "body": "I really like a lot of the new features added in the recent overhaul, being able to redeem codes in the app itself is a huge plus. That said, it’s clear this update was not made with iPads in mind, there’s no support for Landscape orientation. There are major issues with the search function too, typing into the bar doesn’t offer suggestions and tapping return just clears the bar without taking you into a search page. This means i cannot actually search the store within the app. Which, given that this is a storefront first and foremost, is a major problem. With those issues fixed, this is a 5-star app easy. But until then, i can only give it a 3. Please fix this soon!EDIT: landscape support has been added and makes the app much more functional but the search bar still does not work at all, this needs to be fixed asap",
            "region": "us"
        },
        {
            "rating": 0.2,
            "user": "7_Mary_Magdalene_7",
            "date": "07/05/2023",
            "title": "Data Breach for hacker bots",
            "body": "I have a new computer that made a steam account a year ago. I bought seven games to start. Someone signed into their 10 year old account on my device and now I see over a hundred servers in tools and every game they own on MY account. They then uninstalled my two games on my computer from their account. It’s like steam switched the accounts. They then deleted their 10 year account. (It’s in the process of being deleted.) When I sign into my account I see all their games and tools. When they sign into their account, that’s being deleted, they see only two games, mine. We can’t stop steam from hijacking my computer doing whatever they want. So technically right now they are deleting my new account, and then they expect me to autoupdate over 100 game servers from the account that signed into my device. This is a disaster for anyone with cptsd from hacking abuse like me. I guess in the end I can’t use steam at all because they ignore you when you’re telling them what’s going on. My new account is banned from participating in the community when I’ve never even talked to anyone because I have no friends. Thanks to steam for compromising my brand new computer and thanks for forcing me off your platform for no reason at all. To those reading this never let anyone else sign in on your computer even your sibling or they will switch the accounts and destroy your computer. And never let your mom and dad put you and your sibling on the same authentication.",
            "region": "us"
        },
        {
            "rating": 0.8,
            "user": "Tech How",
            "date": "12/23/2022",
            "title": "Very polished, but a couple issues",
            "body": "The majority of the bugs that used to exist in this new app have been patched, which gives this new app a very polished experience. There is still one bug which kind of translates into 2, which is the scaling of UI elements. For people who use larger on screen text for accessibility or have a smaller screen size, the app just breaks. Buttons to accept Steam Guard confirmations don’t fit on the screen and the app can’t be properly used. Landscape mode also works on phones, even though it really should only work on iPads. If you try to tilt your phone sideways on the Steam Guard screen, things get crazy. And the notch blocks things as well.I also wish the video player would be fixed too, you have to tap where you think the unmute button is, and then tap to go fullscreen, but you just get a black window. You then have to close the video and re enter it repeatedly until it works in fullscreen, which is very aggravating. This is on iOS 15 on an iPhone 12.",
            "region": "us"
        },
        {
            "rating": 0.2,
            "user": "please1212",
            "date": "09/13/2023",
            "title": "Terrible, only get if you have to.",
            "body": "Terrible App. You’d think they would have at least a semi-decent app but you can trust the App Store reviews for sure on this one. Actual trash. I’m completely locked out from using the app with my account or any account for that matter. I changed my password because someone logged into my account from another country, and now it has me in a non-stop loop of trying to log me in and acting like it did, not actually logging me in though, verifying my account info when I’m trying to go on community page/look at my profile, and then giving me the same error message over and over. Sometimes, the screen just freezes gray in the app and I can’t do anything in the app unless I delete the app and re-download, AND THEN it still only works for a little bit before it starts crashing again. To top it all off, because I’ve been trying to log in since I’m trying to verify that everything in my account is OKAY after someone tried getting into it, I have been locked out of my account for trying to login too many times. I still don’t know if my account’s okay. Not worth the migraine.",
            "region": "us"
        },
        {
            "rating": 0.2,
            "user": "xRsIVx",
            "date": "09/13/2023",
            "title": "Completely broken",
            "body": "In general I’m a fan of Steam, but this app is a mess. I’ve always put up with minor bugs, like not being able to click on search results (the screen would just refresh instead of opening the game page), but after changing my password on my pc the app is now completely unusable. At first it wouldn’t let me in at all, then after disabling the app based authenticator and logging out on all devices, I can now get in, but nothing works. Everything I try to do now causes the app to attempt to verify my login, then times out. And every time I close the app, I’m logged out entirely again.  I can still log in on my pc and phone’s browser with zeros issues, so the app is definitely the issue. I’ve tried reinstalling it multiple times, and even logging in with different accounts, and the result is the same — the app is fried.I filed a ticket, so we’ll see what support has to say, but given the lack of support other users are getting with this buggy mess of an app, I’m not hopeful. A company this big, profitable, and successful needs to do better.",
            "region": "us"
        },
        {
            "rating": 0.6,
            "user": "sidknee5222",
            "date": "01/11/2023",
            "title": "An underwhelming experience",
            "body": "It has come far from the days of just messaging people or opening up steam pages and crashing, so I thought with this new update it might be able to breath new air into the app. I was half right, the update/overhaul to the UI and some needed QOL of changes such as not crashing anytime I do something have been helpful and while the UI feels cleaner and less clunky; I cannot say the same for its navigation experience. Often times I will be wanting to wishlist or buy games and the icons simply won’t register being clicked and it isn’t very clear that clicking on a title vs clicking on the thumbnail will warrant a different result. Search bar is mediocre, often clicking multiple links within the app confuses it and can result in certain processes not loading and requiring a hard reset. In conclusion the app has lots of potential but as of now it’s a 6/10 from me.",
            "region": "us"
        },
        {
            "rating": 0.2,
            "user": "OneEyeRed",
            "date": "08/23/2023",
            "title": "Years of absolute frustration",
            "body": "For the record, I was a early adopter of STEAM for PC. I have a long standing account and a huge library. I was excited for this app when it came out. But after years of constant frustration I’m done with it. It’s amazing how you guys can make your PC app work flawlessly 98% of the time but cannot seem to fix the blatant issues with this iOS app. Today I was locked in family view. I could access everything fine through PC. I could even access family view settings with my family view password. However, I still couldn’t get to the store page because it kept giving me a error for validating the password. I removed and reloaded app and it just became worse. Got it to work once and then black screen of death. Delete/reload again (3times) to same effect. I’m done with this disaster and having to use it for steam guard for the safest version of steam guard is a joke.  I’m convinced you folks don’t care because it’s been a craptastic app since it’s inception!",
            "region": "us"
        },
        {
            "rating": 0.2,
            "user": "Beppokun1",
            "date": "11/24/2023",
            "title": "Can’t believe steam cant fix their app",
            "body": "As the title says there’s multiple problems with this app. Everyone says that to verify your email you have to download the app which sounds like a pain. Even when you try to use the app however it’s riddled with bugs and remove so many things i don’t understand why.The 2 biggest for me is how you have to download a separate app to text people when they had that option before. The other is how buggy the store is. If you apply filters and look at a game that interests you, the filters reset. Not to mention you cant see the price of games UNTIL you click on the game, reseting yours filters. Sometimes the page would just randomly reset the filters and you’re back at the start of the page. Want to choose what page you were at? Too bad you have to keep pressing load more to view more games. These are just the bugs that come to mind for now but theres many more.",
            "region": "us"
        },
        {
            "rating": 0.2,
            "user": "NicknameToMakeComment?",
            "date": "08/10/2023",
            "title": "Steam customer service is “steam”ing alright",
            "body": "I understand that me moving a lot is going to complicate things when it comes to cellphone numbers being wrong and being updated. So when it comes to authentication I just use the app… oh wait the app randomly logs me out of it anyways and then asks me to authenticate myself with the app!! Excellent!! Also why does it seem like the Steam help personnel think that freaking super villains are trying to hack my account? Why should I have to remember the entire debit card information I used 4 freakin’ years ago to confirm that I am who I say I am? I would love a 24-hr help line where I could just talk to someone instead of sending a dumb little form over the internet that takes 2 days to get back to me with a reply with a question that no normal person can possibly answer. The help center needs improvement because at its current state I think I would rather just off myself!",
            "region": "us"
        },
        {
            "rating": 0.2,
            "user": "Quinn The Indignant",
            "date": "05/20/2023",
            "title": "Account changes break the app",
            "body": "I had to change my password while the app had the authenticator active using the app. First of all, it would not let me do this using the app even though everything on the website redirects you to the app. It asks you to confirm the password change using the app, but since it’s basically loading a webpage within the app itself it never registers that you’re already in the app and you can’t confirm anything.Second, when you finally change your password using a browser and app combo, if you have the authenticator active on the app, the app completely breaks. You’re still “logged in” using the old password, but since your password has changed nothing works because your credentials are wrong. It also won’t let you log out because the authenticator is active. This problem continues even after you remove the authenticator from your account using a browser.For as much money as steam has you’d think they could afford to pay someone with competence to not have everything fall apart when you try to simply change your password. It’s like the steam webpage, authenticator, and app are all made by separate conpanies in separate countries and nobody speaks the same language or has any way to communicate with each other. Pathetic.",
            "region": "us"
        },
        {
            "rating": 0.4,
            "user": "Yolanda.-",
            "date": "2022-10-14",
            "title": "Improved but still bad",
            "body": "I have to download another app to chat??",
            "region": "ca"
        },
        {
            "rating": 0.2,
            "user": "dddddaaaaavvvvveeeee",
            "date": "2022-10-14",
            "title": "Eek",
            "body": "I deemed the latest update a massive security risk to my account and have uninstalled it for the moment. Being able to circumvent my account name and password using a QR code is not what I want and require from this app. Bonus uhoh: they got rid of the chat function, forcing you to need a secondary app to access it.",
            "region": "ca"
        },
        {
            "rating": 0.2,
            "user": "Chippledip",
            "date": "2023-01-16",
            "title": "Why",
            "body": "So i got this app and was curious to the concept of steam on a mobile device. Yet my curiosity went down the drain when I couldn’t log in, now i tried everything and to prove to myself i wasn't insane i logged in on my browser and it worked just fine and i used the same account name and password. Ive tried for about 20 minutes and it wont work so i guess Valve don't want me to have steam on the go.",
            "region": "ca"
        },
        {
            "rating": 0.2,
            "user": "vnioys",
            "date": "2024-01-09",
            "title": "Terrible",
            "body": "Steam is so bad, I dare you to try logging in. It told me my password was wrong so I reset it and it still says it’s wrong",
            "region": "ca"
        },
        {
            "rating": 1.0,
            "user": "Lego master 111n",
            "date": "2022-10-17",
            "title": "Amazing facelift!",
            "body": "Since the revamp, the steam app is so much easier on the eyes. It’s nice to be able to easily navigate the steam app now:)",
            "region": "ca"
        },
        {
            "rating": 0.2,
            "user": "BigThanksryan",
            "date": "2023-02-12",
            "title": "Not working",
            "body": "I got a new phone recently (IPhone 8 to IPhone 13) phone number is all the same. When I try to log in to Steam app, it says I need to verify from my steam guard which I’m trying to log in to… and some how I can’t receive text messages from steam as well. So annoying.",
            "region": "ca"
        },
        {
            "rating": 0.2,
            "user": "Dksjdnndnsjake",
            "date": "2023-01-16",
            "title": "Terrible update",
            "body": "This update is awful… how do you take this long to make an update and then decrease functionality. Let us chat with friends, browse the store, browse the community market and access our inventories all on one app again",
            "region": "ca"
        },
        {
            "rating": 0.2,
            "user": "CriticalWhistleblower",
            "date": "2023-05-07",
            "title": "Updated now I can’t login",
            "body": "Freezes at startup",
            "region": "ca"
        },
        {
            "rating": 1.0,
            "user": "robotman5",
            "date": "2022-10-17",
            "title": "Finally updated",
            "body": "Finally updated and works so much better now.",
            "region": "ca"
        },
        {
            "rating": 0.2,
            "user": "megmeg77333",
            "date": "2022-10-15",
            "title": "add the friend chat back",
            "body": "Add the friend chat back",
            "region": "ca"
        },
        {
            "rating": 0.4,
            "user": "Bob from AU",
            "date": "13/09/2023",
            "title": "Steam Guard fail",
            "body": "Logging on to this app, after many years, suddenly resulted in a black screen. The problem was that I needed “Steam Guard” from this app to logon to Steam on my PC. This way annoying, to say the least, and it took hours before was able to logon to Steam on my PC again. I’m not sure if I’ll be using Steam Guard (or this app) again.Addendum:After removing and reinstalling this app, it did fix the problem. I’m still unimpressed and I’m still not inclined to use this app anymore.",
            "region": "au"
        },
        {
            "rating": 0.6,
            "user": "RileyJoel",
            "date": "26/10/2022",
            "title": "Notifications",
            "body": "The app is a huge step up from what it was like before. It works pretty well but with the exceptions of a lot of bugs and a bit laggy. One thing to note is that the notifications don’t work, I have push notifications enabled in settings and turned on what I want to get notified but I don’t actually get the notifications on my phone, only in app. Otherwise the features on the app are really useful  just needs improvements fixing the bugs.",
            "region": "au"
        },
        {
            "rating": 0.2,
            "user": "X114JAM9",
            "date": "14/10/2022",
            "title": "Absolute garbage",
            "body": "The Steam app was bad before, but this new update (3.2) is something else. Chat's been stripped out of the app, several buttons only work once - if at all, parts of the screen are cut off and landscape mode - the one thing that barely made the app usable on a phone - is completely gone now. If you have a tablet or a very large phone, the app might be tolerable, but if not, everything is completely oversized to the point of illegibility. A lot of text in the apploo...lik..thi...with no way to expand it and the app ignores both iOS's text size setting and Safari's website zoom setting. The Steam website's \"view desktop website\" setting is absent from the app, too (although that's also useless without the ability zoom the screen in/out).I recommend only using this app as an authenticator and sticking with the desktop client or a regular web browser for anything else.",
            "region": "au"
        },
        {
            "rating": 1.0,
            "user": "Dogbreath201105",
            "date": "27/12/2022",
            "title": "4 and a half stars but 2 possible really good features…",
            "body": "2 things pls Valve,1) pls make it so that you can save your steam replay as like a PDF file or something like that.2) please add like a cloud gaming thing so that on the steam app (or another one) you can like use like the Xbox cloud gaming thing, because t for STEAM.Thank you, and overall, ⭐️⭐️⭐️⭐️ 1/2⭐️",
            "region": "au"
        },
        {
            "rating": 0.8,
            "user": "ChloeRuka",
            "date": "06/11/2023",
            "title": "significantly improved over the old experience",
            "body": "while steam mobile is a somewhat niche app, it completes its core functionality of providing steamguard and gives you a mobile way to use the store. there’s only so much they can do to mask that steam is and always has been a thin UI over a web browser, but it’s certainly better than it was.",
            "region": "au"
        },
        {
            "rating": 0.2,
            "user": "Timetoswitchtogoogle?",
            "date": "08/08/2023",
            "title": "Completely broken",
            "body": "The app search function is broken, and has been for about a year or so, with absolutely no word from valve on fixing this most basic feature. You search for a game, get a list of results, and then clicking on one just refreshes the page and refuses to link to the store page.This is on iPhone and iPad, currently updated to the latest operating system.That’s literally all I want to use this app for, searching for and then purchasing games and it doesn’t actually work for that, so it’s useless. If valve would even acknowledge the problem and that they’re working on it, that would be nice, but they haven’t so I guess they’re not?In which case, why push this new app out when the old one actually did what it was designed for? Ridiculous behaviour and support for such a large company.",
            "region": "au"
        },
        {
            "rating": 0.4,
            "user": "CynicalGeezer",
            "date": "02/03/2023",
            "title": "1 step work, 2 steps broken",
            "body": "First positive about this latest version is the store page looks new and accessible.Now the negativeLast version I was able to open the game pages through the list of new releases and upcoming games now this feature doesn't even work. Every time I'm on the games list and tap on any game to access the game page it would just refresh the games list and does nothing.This has been a problem for awhile now and still on this version and even on PC. Every time I want to rate a review helpful or not Steam would give me a process 13 error which is the most annoying thing that's been on Steam for a long time now.",
            "region": "au"
        },
        {
            "rating": 0.2,
            "user": "Luvbuneez10",
            "date": "20/10/2022",
            "title": "New update",
            "body": "While the new update visually looks good, the app functions more as a store now than the social app I once used it for. The decision to separate chat into its own app is not a good one. Why can’t they both be integrated into one app? The friends tab in the new update is hard to find and difficult to use, with the mini profile appearing halfway off the screen. Needing two apps to do what I only needed one app to do in the past is incredibly frustrating.",
            "region": "au"
        },
        {
            "rating": 0.6,
            "user": "Destroy-Erase-Improve1980",
            "date": "11/02/2023",
            "title": "One feature missing…",
            "body": "Would love to see the ability to look at my games based on the categories I made. Having over 300 games makes it hard to scroll through. Categorising makes looking through them much easier than scrolling down through one massively long list.",
            "region": "au"
        },
        {
            "rating": 0.2,
            "user": "SincereMarsh",
            "date": "22/10/2022",
            "title": "Horrible update",
            "body": "Seriously the format and everything doesn’t work, the way it was before was far better, I can’t search for games as it literally just doesn’t work when I enter what I typed, the no landscape option is absolutely horrible.Trying to figure out a completely new layout is just annoyingly unnecessary, please just upgrade the app by taking this abhorrent update down and rethinking what it is the app really needs.",
            "region": "au"
        },
        {
            "rating": 0.6,
            "user": "Milkshake_Slurping_Dog",
            "date": "14/10/2022",
            "title": "small bug with community listings",
            "body": "recently obtained some items and am trying to find the price to sell them at however it pulls a message saying that it could not load properly. the rest of the app works great but im gonna take a while to get used to it XD",
            "region": "nz"
        },
        {
            "rating": 0.2,
            "user": "C.A.Fulford",
            "date": "21/01/2023",
            "title": "If it ain’t broke, don’t fix it!",
            "body": "It used to be a good app… now it is just a sales tool that pulls data from the web site (30% of the time it can; 70% it will say try again!). They also removed STEAM chat from the app & put it in another app; but didn’t let you know.Its only use really is checking on comments, but most of the time you need to reload it to get the data & it has a horrid interface where you often can only see the last message.Can we have the old one back please that worked really well for years.",
            "region": "nz"
        },
        {
            "rating": 0.2,
            "user": "k1llyourselvesfaaags",
            "date": "26/12/2023",
            "title": "Just stop",
            "body": "Anyone involved with developing this app and the whole steam authentication system - should never be given a job again and put down like the rabid dogs they are. Disgusting the amount of money this company has and this is how they spend it - wasting everyone’s time with a disgusting glitched buggy system so Youcan sell something on the market with no hold. Evaluate yourselves whoever made this thing it’s literally pathetic that you could even think you’ve done a good job here. Go work at McDonald’s it’s all you’ll ever be good for.",
            "region": "nz"
        },
        {
            "rating": 0.2,
            "user": "Simone Genevieve",
            "date": "23/05/2023",
            "title": "Can’t see game screenshots in the app.",
            "body": "If I’m deciding whether to buy a game, I want to see images of the gameplay in landscape, as portrait makes the game images (which are all landscape) way to small to appreciate any of the game’s graphics—basically no way to see the product properly in the app. The header and footer also cover way too much of the screen in landscape mode, so even just trying to view the images on the page is not possible.",
            "region": "nz"
        },
        {
            "rating": 0.4,
            "user": "apotateisme",
            "date": "31/03/2023",
            "title": "So slow and buggy",
            "body": "Basically just a web browser masquerading as an “app”, with very few native features, except slower and more buggy than a real browser.The only reason to use this over the website is steam guard, outside of this you’re better off just using an actual browser.",
            "region": "nz"
        },
        {
            "rating": 0.6,
            "user": "Sergey.Aegis.One",
            "date": "29/07/2023",
            "title": "Can’t init Authenticator",
            "body": "Messages aren’t sent to mobile",
            "region": "nz"
        },
        {
            "rating": 0.8,
            "user": "simcore",
            "date": "29/01/2012",
            "title": "Beta impressions",
            "body": "The layout of friends, profile info and game catalogues is done very well. You can change your first load page between friends list, news, game specials etc.Chat between people on your friends list also works well, but appears to be a little buggy, especially if you are logged into Steam elsewhere at the same time.One thing it needs, instant press on friend to chat screen, as opposed to load profile, then click on chat (considering the amount of info to load for a profile, this can take awhile on 3G)The app is a great convenience to have, and it will certainly have some good potential as Steam update.Get it when it becomes open beta, or just sign in now and you'll likely get an invite.",
            "region": "nz"
        },
        {
            "rating": 0.2,
            "user": "Foresips",
            "date": "31/10/2022",
            "title": "A buggy mess",
            "body": "Not ready for release as the app is so buggy it is barely usable",
            "region": "nz"
        },
        {
            "rating": 0.2,
            "user": "thriftz",
            "date": "11/11/2023",
            "title": "Steam app useless",
            "body": "Still can’t login, hopeless",
            "region": "nz"
        },
        {
            "rating": 1.0,
            "user": "ArtofAdam",
            "date": "17/03/2014",
            "title": "Fantastic App!",
            "body": "Works great, occasionally some server issues, but otherwise it's fantastic. Apart from Steam Chat, and the Steam Store built into the app, there's a few features hidden away such as managing downloads remotely (handy if you buy a game through the app while away, and want to queue it for downloads), and Steam Chat providing up-to-date messages so you don't have to go into the steam overlay to talk to friends. Looking forward to future updates!",
            "region": "nz"
        }
    ]
}