{
    "Adobe Digital Editions": [
        {
            "rating": 0.2,
            "user": "4everwityou",
            "date": "10/13/2023",
            "title": "Whoever designed this should be fired!",
            "body": "I had to download this to read ebook from my local library and it’s one of the worse apps I have ever used in my life. I have an iPhone XS Max and this app is not maximized for this phone or any phone models with the black bar at the top, because the first time of the page is right where the black bar is which means you can’t read at least 3-4 words every page! The app also loves to freeze out or just glitch out randomly, especially when you switch out of it and come back in or change screen orientation. I also like continuous scrolling for reading instead of having to swipe because it’s a hassle, not to mention if you are reading in a dark/dim space it has to load every page (which takes a bit) and the loading screen is WHITE while I’m reading in dark mode! I honestly can’t believe this is a published app! I wish I could use the books app right on my iPhone for the library materials but sadly I can’t. This is really a pity and I hope adobe fixes this disaster soon so people can actually use it to read or study.",
            "region": "us",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.4,
            "user": "LeahIrving",
            "date": "08/05/2017",
            "title": "Not for School or Recreation",
            "body": "There are problems that me and all of my classmates mentioned while we were using this app. The main problem is that it lags and stops a lot if you are using it offline. When you flip through pages too much, it starts to freeze for a while before you can flip the pages again. So when we were looking for a certain page in our ebook, the app lagged every 10-15 seconds. This happens less frequently with internet connection, but it can still happen. Especially if the app has not loaded certain parts of the book yet.Another problem is that there isn't a simpler way to find a certain page. Even though the app has a scroller that helps you jump through the pages, it doesn't indicate which page you're going to flip to. If there's a way you can do this in the future, that would be good as well.TL;DR I don't recommend this app for anyone who wants to use this for ebooks. Whether for educational or recreational purposes. It's better if you find an app that can do so much better until Adobe fixes these problems. It's not worth it.",
            "region": "us",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.2,
            "user": "Shambricia",
            "date": "02/18/2021",
            "title": "Worst app I have ever used",
            "body": "I just purchased an eBook and it required me to download this app to read it. I spent $40 on it. I want to share my extreme dissatisfaction with the quality of the eBook format. It was ridiculously challenging to download and I spent nearly 40 minutes trying to figure out how to download it. I finally figured out what the issue was by looking at the comments on the IOS reviews page from several others that had similar issues. The trouble was that you cannot use safari to download it so I had to get an all new internet browser to download it. Then once it was finally downloaded I was incredibly disappointed in the quality of the e-reader itself. The content in the book is great. I know because I have the paperback version. But I was looking for an electronic version that I could take on the road with me and easily access when away from home. When you read the book in the eBook format it looks awful. Words are cut off, you can't even finish reading complete sentences because the formatting is all wonky. This app is absolutely is ridiculous. The quality is so poor it is completely unreadable.",
            "region": "us",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.2,
            "user": "NitNicked in LA",
            "date": "08/05/2022",
            "title": "Who designed this stinker?",
            "body": "I have been reading books on my phone for more than a decade, and I’ve use lots of different apps to do it over time. This feels like the worst of a first generation app: The majority of the screen space is blank around a tiny narrow column of text that looks ridiculous justified, because it truly creates distracting volumes of white space down the middle of the page. Better apps designed for actual readers go closer to the margin of the screen, allow you to stop justifying the text when doing so avoids that distracting white space that literally makes it harder to read, or to keep the justification when it is appropriate for the text.Adobe’s name is synonymous with graphic design, programs like Photoshop are now so powerful and flexible that that very flexibility is intimidating to many new users. It seems clear that they forgot that flexibility when creating this terrible implementation of an e-book reader.   It forces screens to look like weirdly distorted printed and pages and ignores years of experience that make better readers actually a pleasure to use.",
            "region": "us",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.2,
            "user": "Sad Bookreader",
            "date": "12/15/2023",
            "title": "Wow people weren’t joking (very bad app)",
            "body": "I just wanted to read an e-book from my local library and had to download this app to read the book. I saw all the one star reviews and got a little freaked out but I still gave it a try because I really wanted to read this book. There’s no real tutorial on how it works but I figured it out on my own after 10 minutes. Got the book into the app and there’s no way to actually read it? I read the title page, the acknowledgement page, and then the remaining pages after that were blank? Like blank pages or blank pages with like black smears? I guess the pages don’t display properly on the screen once the book is in the app. I mean there were literally no words on the remaining pages after the acknowledgment page. Don’t even waste your time. Even if you do everything right, once you actually download and open the book, you won’t be able to load the contents of the book. Would give 0 stars if I could but hey at least maybe I can save someone time with my review.",
            "region": "us",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.2,
            "user": "Elfmantoo",
            "date": "01/05/2019",
            "title": "ADE needs much more work!",
            "body": "I’m disappointed in ADE. I had no problem loading in DRM ePub and reading them. However, I find ADE very lacking in features.  Features like word definitions, phrase translation, underlining and highlighting in various colors, ability to google and hotlink to places, people and art described in ebooks.  I was a big fan and user for many years of Neosoar another DRM e reader.  Unfortunately, they seem to be recently out business.  It took a while for Neosoar to get to a point of near perfection with these features I’ve listed above.  But the absolute best was your annotations were linked to Dropbox.  So, any additions or notations or hotlinks would be saved in Dropbox.  If you changed or upgraded your e reader you would upload the DRM e book and sync with Dropbox and all your annotations would appear.  You would not lose any annotations. Neosoar is a great loss to those of us need an e reader that is fully connected to power of the internet.  It is unfortunate that ADE does not measure up.  In the future it could if Adobe puts in the effort.",
            "region": "us",
            "drm_relevance": 0.7358490566037735
        },
        {
            "rating": 0.2,
            "user": "wonnov",
            "date": "01/19/2023",
            "title": "Only using cause I have to",
            "body": "As someone who has had to continue using this app on desktop and iOS for years now because I teach from a textbook that is only available in this app digitally, I can honestly say, it’s the worst. It feels from experience like Adobe is doing the bare minimum to keep the app alive.  A list of things I experience:-Random pages that look fine on desktop look blown out and unreadable on iPad or iPhone. -Authorizing e-books can take multiple attempts and restarted the app before they appear.-Navigation and scrolling through the book is clunky only at a single speed.-Clicking and dragging to highlight text (YES it does actually have a HIGHLIGHT feature!) is clunky: Saved highlights have disappeared and you have to click and drag above a sentence to highlight it as if the entire alignment of words is off.  So if I want to click and drag, I need to do so an inch or less above the actually words to effect them.  -Hidden adware install on the desktop version. If you are not careful it comes with Norton Antivirus which will install with the program if you aren’t careful to hit no on install I could go on. I have asked my textbook manufacture to use another product.  I ask Adobe to make this app, at least functional, but preferably at least competitive to other e-book readers. For now, I suffer through.",
            "region": "us",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.2,
            "user": "EmoEric87",
            "date": "01/05/2023",
            "title": "Dead App!! How not to design an e-reader app",
            "body": "UPDATE: You should know this app is no longer under development. If you can, email your ebook’s publisher and ask for an alternative to this app…If you’ve ever thought to yourself, how can we make the process of obtaining a digital copy of a book more difficult and then, once the poor idiots figure out how to do it, how can we make the experience as excruciating, rudimentary, and utterly disconnected from the rest of the 21st century as possible... you probably designed this app. The designers haven’t even figured out how to fit pages onto your device. YOU CANT EVEN READ THE PAGES CORRECTLY, because the app hasn’t been updated to Apple’s own screen real estate standards. The notch on my iPhone fully obscures the top of every page. What person who wants to read would actually choose this app? Has anyone from Adobe who actually reads books tried to use this app? My guess is no.",
            "region": "us",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.2,
            "user": "SunnerLife",
            "date": "02/26/2022",
            "title": "Adobe, PUH LEEESE give this app some attention…",
            "body": "I have recently needed to download this app since an ebook was only available through Adobe’s DRM. So far the MacOS version is serviceable—not the best navigation but you can get around. The iOS version is unusable. It crashes during searches, pages are missing or unreadable (don’t know if this is a scanning issue, but why then does it work on the macOS version?), and navigation is neglible. Many many people read ePubs on a tablet like the iPad, so it boggles my mind that a company like Adobe wouldn’t put some effort into this product. I imagine with Amazon’s Kindle and Apple’s iBooks taking a lot of the market share, perhaps there is not enough market left to tempt them. But I suspect that there are plenty of authors/publishers who would like to skip the massive fees that both companies impose, so there is a real Power-to-the-Author-People market that can develop here if they play their cards right.",
            "region": "us",
            "drm_relevance": 0.3095238095238095
        },
        {
            "rating": 0.4,
            "user": "Talon110",
            "date": "07/22/2022",
            "title": "Bad, but not unusable",
            "body": "On first use, the app appears unusable (at least when viewing some books) as other users state. The default color scheme (middle button icon at the bottom when viewing a book, leftmost option) seems to be the culprit. The two other color options appear to display my book correctly.But even then, this is a very basic e-reader for DRM protected content. You can highlight in what appears to be only a single color, bookmark pages, view the table of contents, view all of your highlights and bookmarks, search text, and display content in two (functional) color schemes (white text/black background, and black text/brown background). That’s about it for functionality. Highlights are ugly and are broken up by the spacing between highlighted words. Recommend looking elsewhere; this app isn’t worth its free price tag.",
            "region": "us",
            "drm_relevance": 0.6933333333333334
        },
        {
            "rating": 0.2,
            "user": "GoodMusicFan44",
            "date": "2019-08-12",
            "title": "Terrible app",
            "body": "How can anyone be expected to use this.Highlighting does not work. Can’t make notes with Apple Pencil. Why would a any company want to use this app for online learning? DRM Protection prevents using any other apps to open material. What a joke.",
            "region": "ca",
            "drm_relevance": 1.0
        },
        {
            "rating": 0.2,
            "user": "Melinda in PG",
            "date": "2020-07-04",
            "title": "This wretched app crashed my iPad repeatedly",
            "body": "I was trying to use Adobe Digital Editions to read publisher’s advance review copies because they have DRM and require a reader with Adobe ID. This app is, frankly, garbage. It got to the point where it finally wouldn’t do anything but crash my iPad whenever I opened a book. After discovering an alternative to this wretched app, I have successfully downloaded the Bluefire Reader App instead and will be using that in the future.",
            "region": "ca",
            "drm_relevance": 0.5777777777777777
        },
        {
            "rating": 0.2,
            "user": "Hidkff",
            "date": "2021-06-22",
            "title": "Don’t buy this",
            "body": "Absolutely terrible, slow and doesn’t even work properly",
            "region": "ca",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.2,
            "user": "KokoPerez",
            "date": "2021-06-12",
            "title": "Horrible app",
            "body": "Knowing Adobe app I was expecting much better. It’s not practical, there are many glitches, the scrolling through pages is terrible and more!! If I wasn’t stuck with it for school (since it’s the only app authorized for the book I bought) I would most definitely never recommend this app.",
            "region": "ca",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.2,
            "user": "Bball Brenna",
            "date": "2021-06-07",
            "title": "Garbage",
            "body": "This app is terrible. Computer version isn’t any better. Crashes every 5 minutes, causing me to lose what I’ve highlighted. It will get slow and glitchy randomly and crash shortly thereafter. Unfortunately, this was the app I was forced to use to claim the digital version of the textbook I purchased.",
            "region": "ca",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.2,
            "user": "whatever0990666",
            "date": "2020-09-21",
            "title": "Awful",
            "body": "Terrible loading glitches, constant highlighting and note glitches, such a shame to have to read a purchased book on here. Makes the book a waste of money.",
            "region": "ca",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.2,
            "user": "Andrewwillis89",
            "date": "2019-06-05",
            "title": "HORRIBLE APP",
            "body": "This app is so terrible in functionality, I’d rather pay $19 for a book from Kindle than struggle with this app to get it for free. Really a terrible app. Impossible to login. Really terrible integration. The desktop version of this app is even worse. You cannot customize or change preferences. Impossible to do anything with this app. I would give it zero stars if I could.",
            "region": "ca",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.2,
            "user": "Julie Côté Audet",
            "date": "2024-01-11",
            "title": "Ne lis pas les livre",
            "body": "L’application ne reussit pas a lire les livres. Même le livre de adobe nest pas entièrement lisible.",
            "region": "ca",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.2,
            "user": "Hamster Collie",
            "date": "2022-12-26",
            "title": "What a piece of rubbish!",
            "body": "Can’t even display its own manual properly. Simply doesn’t work (on iPhone 13 mini).",
            "region": "ca",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.2,
            "user": "lebdave",
            "date": "2022-12-20",
            "title": "Another failure by Adobe",
            "body": "Tell me Adobe made this app without telling me Adobe made this app. Frequent crashes. Extremely slow. Download failed due to “connection error” without having any connection error. Can’t properly handle pdf (their own file format). Does not display the pages in the right order. Missing pages. Colors are all messed up. When reading (or should I say trying to read) a comic, bubbles and even images are not properly aligned. Doesn’t open automatically it’s own files. Takes 2 minutes to download 50 MB. Latest version update: 2 years ago. If you are an ebook provider, please select another company to manage your products.",
            "region": "ca",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.2,
            "user": "Fartato",
            "date": "20/08/2023",
            "title": "You’ve heard of user friendly, now get ready for user hostile!",
            "body": "Despite its presence on the App Store this is a non-functional app in every meaningful way. Yes the software does run on iOS and does respond to user inputs but that is all that can be said. Page numbers in contents pages do not function correctly. You can’t jump to a page by pressing the page numbers which is fine if it’s a 10 year old pdf but unacceptable for content specifically made for the platform. The jump to page feature does not work at all, it’s purely decoration. Content will randomly not display at all depending on the zoom level. Each page seems to require a different degree of zoom to actually display content. This all complements the horrific DRM implementation: if you don’t sign in before downloading something you will permanently lock yourself out of opening that file! All this app is is a glorified pdf reader with  DRM and it fails to do either. A legitimately unusable piece of software. It may be free but you pay with your sanity.",
            "region": "au",
            "drm_relevance": 0.5591397849462366
        },
        {
            "rating": 0.2,
            "user": "UI/UX student",
            "date": "11/06/2022",
            "title": "What even is this?",
            "body": "I only downloaded this because I had to for a uni book, and I still can’t even access it. Is this really an adobe product? I have the creative cloud since I’m a design student and use a multitude of adobe apps with ease. Nothing has caused me more frustration than this app. If you have an iPad don’t bother with this. I am now having to view my book chapter by chapter while studying for an exam because at least this way I can view it on pdf viewer. The introduction book on this app doesn’t load properly, half the pages are faded, pixilated and hard to read. I have deleted and downloaded this app multiple times and the issues stayed the same. Don’t bother with this app, save yourself the headache and look for alternative solutions.",
            "region": "au",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.2,
            "user": "Redranter",
            "date": "13/08/2023",
            "title": "The one star reviews are right - this is super buggy",
            "body": "Unfortunately, the book I bought was restricted to Adobe Digital Editions (which was not disclosed). As the other one-star reviews indicate, this is barely a reading app and worse, it is extremely buggy. I opened the iPad version and there were blank pages and pages with very faint writing throughout - it turns out that this can be fixed by switching to dark or sepia mode, but this bug has been reported since 2021 and nothing has been done to fix it (or indeed even just to default to sepia mode so you don’t think your file is broken). In future, will always purchase paper rather than anything that is limited to ADE.",
            "region": "au",
            "drm_relevance": 0.4126984126984127
        },
        {
            "rating": 0.4,
            "user": "lordshrimp5",
            "date": "18/11/2023",
            "title": "Actually works, but it is incredibly unintuitive!",
            "body": "If you are a student and required to download Proquest Ebook files, you have probably been pulling your hair out over this app. The first thing you have to do is download the related acsm files then manually share them with this app. You will probably notice a lot of blank pages when you try to read your ebook; to get around this issue you have to tap on the page to find a sun icon. Tap on that icon to change the text display, then the missing pages should turn up. I really wish Adobe would listen to all these one star reviews and make their app more user friendly!",
            "region": "au",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.2,
            "user": "Kate.Kaixin.Xie",
            "date": "02/02/2023",
            "title": "As bad as an ebook reader can get",
            "body": "I understand why online collections need DRM. But oh my goodness, can someone please create an ebook DRM format that allows you to access the book in other apps???? This app is downright awful. I prefer to use apps that give you a set of nice fonts to use; that gave animated page turns: etc. Because ultimately I prefer physical books, but ebooks are so convenient and often the only option available.This app is about as ugly and barebones as an ebook reader can get and even then, it seems that people often have problems with it. Seriously I find myself accessing books err... \"Another way\", which I won't go into detail about... And sometimes I will buy the ebook if I know I'm going to read it all (not feasible for uni research though) even though I would otherwise happily use the library's resources. Purely because I really dislike this app and its PC counterpart. Given that this is Adobe, the same company that produces Photoshop, how is it that the ONE DRM compatible app for ebooks is so.... This??",
            "region": "au",
            "drm_relevance": 0.7799999999999999
        },
        {
            "rating": 0.2,
            "user": "Swagga Singh",
            "date": "11/03/2019",
            "title": "One time user",
            "body": "First time I’ve ever downloaded an e-book and this is my experience. I installed ADE on my Windows10 device and it works fine. I downloaded it on my iPhone XS, noticing the one star average, but proceeded anyway. After all, I haven’t got time for reviews.  Can I just say, along with all the other one star users, the app is horrible. I thought it was just me, until I remembered the rating. I cannot believe this is an Adobe product. I wouldn’t have used it if the e-book I downloaded didn’t require me to! Unbelievable in today’s day and age that an app so unreliable from a quality brand exists. Shame on Adobe and shame on me for not just buying a hardcopy book instead.",
            "region": "au",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.2,
            "user": "Hartmaaaa",
            "date": "23/09/2018",
            "title": "Embarrassingly bad...",
            "body": "Worst reader I’ve ever used. Bought an online textbook that would not allow Kindle or IBooks and makes you download the App. It works ‘okay’ on Mac computer, but is horrendous on iPad. The page number won’t change. The table of contents link won’t work to take you to a specific page. I’ll be on one page, move one page ahead, the page number won’t change but it skips ahead to a random page in another chapter. Was so frustratingly awful I almost threw my iPad out the window but alas, Not iPads fault.  Whoever built this app should be ashamed. Work harder to get a product to at least work, if not have the functionality of iBooks.",
            "region": "au",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.2,
            "user": "Fifuieividkfig",
            "date": "07/07/2023",
            "title": "Completely unusable. Don’t bother.",
            "body": "Can’t even read the getting started document that comes with this thing to figure out how to get my books to work because half the pages appear blank or as if someone’s turned the exposure and contrast all the way up. Can’t sign in to adobe either as it says my username/password are incorrect (I’m trying to sign in with my student account) despite the fact that I’ve successfully been able to log in to every other adobe app using these. The app is so bad and it absolutely astonishing that this comes from Adobe of all companies.",
            "region": "au",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.2,
            "user": "Faylorr",
            "date": "03/05/2022",
            "title": "Uggh.",
            "body": "I purchased a book months ago and read it. As it was a reference book I am wanting to read it again and there are only a couple of pages opening. Some are blurred out and other pages are patchy or blank. Not happy. All I want to do is read the book I purchased. Tried to put app on my other device using correct password and purchases don’t even show up there. If I could have downloaded it into iBooks I would have but adobe didn’t give me that option.This is just blatant stealing. I now have no book and will never use this terrible app again.",
            "region": "au",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.2,
            "user": "LP Rulez",
            "date": "16/01/2022",
            "title": "Bane of my existence",
            "body": "I truly have no idea how Adobe have tricked every higher education provider into using this program to rent out their ebooks.  I have used so many other free readers that are fully functional.  This program won't even allow the most basic functions (e.g. continuous scrolling).  Heaven forbid I try to highlight text or search a document - it crashes instantly.  This is just on the computer - I can't even open books from my university on my iPad at all.  Pointless and awful.  Are universities paying Adobe for this???  I certainly hope not.",
            "region": "au",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.2,
            "user": "Duvroneibtpv39)39?/6?30!:.",
            "date": "19/05/2023",
            "title": "Just so bad",
            "body": "I had to use this app to download a book for uni. The website gave me no other option than this awful app. It doesn’t work! None of the pages downloaded correctly, it was just white pages with small smudges of black where the words were supposed to be. I couldn’t read a thing past the two first pages. I don’t know who decided this app was ready to be released to the public, but they were dead wrong. Don’t bother using this app, it’s the absolute worst. If you need a pdf reader/markup app, try CollaNote: it’s great, really easy to use, free, with no ads, and best of all, it actually makes readable pdfs!",
            "region": "nz",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.2,
            "user": "aidan_donald",
            "date": "03/12/2021",
            "title": "What even is this app?",
            "body": "Honestly baffled as to how a twenty-four BILLION dollar corporation can produce such a comically terrible app.The text is partially covered by the iPhone’s notch and is so small that you need to be an ant to read it. No resize option, but there is a buggy zoom feature. Crashes randomly. Figured out that you need to quit the app, safari, download, share, open with digital editions, enter adobe ID just to import books, possibly twice depending on whether or not it actually appears in your library.Oh and the UI text is completely misaligned.",
            "region": "nz",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.2,
            "user": "ptresdghknffrrscvb",
            "date": "27/10/2021",
            "title": "So restrictive it’s useless",
            "body": "What’s the point of highlighting an ADE pdf when you can’t extract, save, or even get an annotation summary of your highlights. The app also has no capability to recognise hyperlinks within the document. Highlighting text is as painful as dragging fingernails on chalkboard. ADE doesn’t even sync books across authorised devices. I had no choice but to use ADE because that’s what my library uses. What a waste of time using this app when I can’t rerieve the info I need for my research!",
            "region": "nz",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.4,
            "user": "HendawgFitz",
            "date": "04/02/2021",
            "title": "A necessary evil",
            "body": "My university library requires Adobe Digital Editions to access its ebook collection. The Mac and Windows versions work well. The iOS version is a pale imitation.Zooming in on pages is extremely janky. There is very limited support for annotation and none at all for Apple Pencil. The search feature usually does not work. At least it usually displays readable text 🤷🏻‍♂️When I read ebooks from my uni library and I don't have access to a Mac or Windows machine I have to use this. It hurts though.",
            "region": "nz",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.2,
            "user": "Da-Rain",
            "date": "02/06/2022",
            "title": "Why is this the standard?",
            "body": "Such a bad app, same can be said for the desktop version. Adobe isn’t a small company either, nor are their other products designed with such lack of care. What’s worse is that there is no other alternative for borrowing books off certain websites. You have to use Digital Editions.",
            "region": "nz",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.2,
            "user": "AhSeeBoo",
            "date": "17/01/2024",
            "title": "Ridiculous !",
            "body": "I’ve just downloaded this app and there seems to be no way t9 use it for downloading books from my library to my Kobo Nia reader.   I had to give it something, so 1 star - which was too much.  This app is rubbish and I’d like Adobe to sort it out and make it useable.",
            "region": "nz",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.6,
            "user": "gellupth",
            "date": "19/01/2020",
            "title": "Colour Highlighters and support Apple Pencil",
            "body": "I want it easier to use, with different highlights colour. I had to use this app to read text boom from our uni library. But it so annoying that I cannot use Apple Pencil to highlight it directly. I want more options for highlights and draw.",
            "region": "nz",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.2,
            "user": "ExcusesofPuppets",
            "date": "30/08/2021",
            "title": "Terrible",
            "body": "University requirement. Even DRM free stuff needed an account. Even then, the University library account didn’t work, needed yet ANOTHER account.  No thanks. Also iOS version crashed a lot, not the same as the desktop version. Awful.",
            "region": "nz",
            "drm_relevance": 0.9629629629629629
        },
        {
            "rating": 0.4,
            "user": "KaspR18",
            "date": "03/01/2019",
            "title": "How to return books to the library?",
            "body": "Is there a way to return books to the library on the iOS version of Adobe Digital Editions? I don’t have a computer and I don’t find any options to return books from my iPad... Such a pity!",
            "region": "nz",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.2,
            "user": "rowsburn",
            "date": "25/09/2019",
            "title": "Reasonably useless",
            "body": "Constantly crashes, can’t access pages searched (blank page shows up), won’t sync to computer, but so many academic websites require this app to read books. Slow and limited.",
            "region": "nz",
            "drm_relevance": 0.0
        }
    ],
    "Apple Books": [
        {
            "rating": 0.8,
            "user": "AN-G!",
            "date": "09/08/2023",
            "title": "Love the App, does have some glitches",
            "body": "I do love this app. I did like it when I could put large PDF’s in here. My favorite thing to do is have the book read to me via the read function (by dragging two fingers from the top of the screen, or by activating the read control via the Accessibility settings menu. Mainly because I have focus issues and I like following along, but also because I can listen and do other things as well. I like how the portion being read is highlighted and it scrolls as it’s reading. I would like to offer a suggestion that I think many will love, why not offer a book print and audio option so that it could do that via the app and I can listen on CarPlay. I know some authors read their own books for audio books and would love being able to buy a book that also offers the audio so I can follow along when I can and hear the author’s reading it to me.   Recently using the read function has been glitchy and it’s been skipping parts, especially in the end of the chapters. I’m not sure if this is what other reviewers were talking about, but this is what I experience when using the read function.",
            "region": "us",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.4,
            "user": "River Mor",
            "date": "12/24/2022",
            "title": "Scroll Reading Issues with iOS 16",
            "body": "Frustration with iOS 16 disfunction leaves me wondering if the upgrade was tested before being released. I agree with the previous reviewer and won’t re-address those same concerns. However, I will address the book mark and scroll reading  issues.  The slightest touch while scroll reading activates the red book mark which (because I’m reading) needs to be cleared. Sometimes touching the red bookmark is enough to clear it, but other times you have to open the Themes and Settings menu and remove the bookmark there as well. This seems to be more sensitive with iOS 16 than previous versions.  Even more frustrating, though; when using the scroll reading feature near the end of a chapter the (scroll) screen jumps ahead - sometimes paragraphs ahead, sometimes pages ahead, sometimes to the end of the current chapter, or other times to the end of the book. Imagine trying to find where you were reading last when that happens. (An opportunity to use the search feature as long as you have the exact verbiage.)Anyway, to fix the jumping scroll issue I change from scroll to page turning or sometimes I have decreased the font size, and then sometimes I have to close the book because it won’t reload after a font size change. And since the pages are renumbered you can’t just go to your last page and continue reading. Please FIX this bug in the near future. Thank you.",
            "region": "us",
            "drm_relevance": 0.0
        },
        {
            "rating": 1.0,
            "user": "SpringByJ",
            "date": "03/23/2024",
            "title": "Can be the best reader",
            "body": "Dear Books Product Team, I am delighted to be able to reach out to you in this manner! I am a devoted Apple user and a passionate book enthusiast :P. I thoroughly enjoy your Books app, whether it's on my Mac, iPhone, or iPad. The Books app consistently provides me with a seamless and enjoyable reading experience, and I am truly grateful for your hard work! However, one minor issue I've encountered is that when I read books in the epub format, although I've noticed that the Books app allows for customizing fonts, unfortunately, the selection of fonts provided by the app is a bit limited and doesn't include my preferred ones. I attempted to find a solution through Google but was unsuccessful. The response I received was that the Books app doesn't offer additional font options (sad face). I earnestly request if it would be possible for you to add more font options, preferably allowing the import of TrueType Font files or selecting fonts from the system. Of course, it would be fantastic if I could also choose fonts that I have installed in my system (like Pages, Numbers app). Thank you sincerely! I hope you can accommodate the request of this fervent Apple Books enthusiast. Once again, thank you! Wishing you all the best!",
            "region": "us",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.2,
            "user": "shi hi an",
            "date": "07/05/2022",
            "title": "Works, but still lots of bugs, and slowly degrading",
            "body": "I enjoy reading books with this app, but there are still a lot of glitches from my last review. 1: light reading books that come in volumes are still not stacking up for some reason. The author’s name hasn’t changed for the series, so the is no reason it can’t consolidate them to one group rather than have each book separated. 2: sometimes when the page, it goes to a blank page. I have to swipe a previous page or two and then go back to the said page. Lastly: both my iPhone 12 and iPad Air app crashes sometimes. Not too sure why this hasn’t been addressed, but it’s been years since the app came out. The more software continues to advance, it should reduce the problems, not create more. Would like to see my money’s worth purchasing books from this app be put to use on updating the app (REAL updates). It would be much appreciated. But I believe my words are being unheard. Some books I pre-ordered are not showing up. When I hit “View Item” it says that the said book is no longer available in this country or region. Mind the fact, that I waited over a month for the book and now I can’t read it. Not too sure if it’s due to technical issues or incompetent functions. All I know is that this app is getting worse and no one is fixing it. My advice to those looking at this app, keep what you got and find another iBook app. This was once at the top of it’s peak and now it’s falling fast.",
            "region": "us",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.2,
            "user": "SendingOutAnSOS",
            "date": "12/19/2022",
            "title": "How dare you!",
            "body": "UPDATE: the more I use this updated version of Books the more I HATE it. The stupid little thing in the bottom righthand corner to control everything is the worst designed button in the history of screens. FIRE THE ENTIRE DESIGN TEAM WHO TOOK ONE OF APPLE’S BEST APPS AND TRASHED IT. Since 2010; I have but using iPads to read all of my books. The design, the layout, was absolutely stellar from the very beginning. The graphics of turning a page made the transition from reading a paper book to a virtual book seamless. But then 2022 came along with the release of the latest iOS for iPads. An apple, with its horrible wisdom decided to hand over this project to someone who obviously has never read a paper book. I am furious. As a loyal Apple user for over 25 years, I am seriously open to other providers not just for reading books; but I am ready to go back to paper books, giving up my Apple Watch for real watch, putting down my iPhone, and maybe even considering going with another type of cell phone that is not an apple. With your meals price increases for Apple services, I’ve already canceled those and I’m ready to give up everything that is Apple. Apples become too greedy without any consideration for its very loyal customers changing books it’s just the latest, possibly the straw that breaks many of our backs interest to taking any more from Apple. Yes I am upset. Yes, I have been loyal for many many years. Yes, I really may leave.",
            "region": "us",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.4,
            "user": "Nick_Wilde_403",
            "date": "02/15/2023",
            "title": "Ruined by new update.",
            "body": "The most recent update has made this perhaps the most frustrating experience I've had yet while trying to read and annotate. The previous format made it easy to highlight, scroll between pages, add notes, clear highlight marks, find the index (a crazy concept now), and overall be able to hold my device while using the app. \tThis recent update has made it feel more like I'm scrolling through my camera roll of screenshots that someone took of book pages than it actually feels like I'm attempting to read a formatted book. The highlighting feature is almost twice as twitchy and jumpy as before, and I find it even harder to remove highlighting that was done by mistake. Not only that, but instead of being able to tap a drop-down menu for the book's index, you now need to tap the screen three or four times before it registers that you don't want to just be in image mode, and that you'd actually like to access another menu. This menu, which was formerly easy to use and access, has been relegated to a very tiny and hard-to-find button in the bottom corner that doesn't always show up. In addition to that frustration, it's much harder to operate than the last menu. \tMy best description of the new update is that they tried to fix something that wasn't really broken, and in doing so just made it worse.",
            "region": "us",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.2,
            "user": "scztt",
            "date": "05/13/2022",
            "title": "Sync and library bugs make this almost unusable",
            "body": "Almost every time I launch the app, large chunks of my library are mysteriously missing - often including things I was actively reading fifteen minutes before. If I wait patiently with the app open for 3, 4, 5 minutes (no progress indicator or “syncing” message, you just have to trust it….) eventually things will slowly reappear and I’ll see library items again - though given how random the behavior is, I’m never quite sure if it’s all there. Sometimes the resync never happens and I have to do a ritual of settings changes, restarts, and reinstalls to get it back. The app will aggressively delete local copies of things (presumably to save space, but it’s not like ebooks are very large….), including very recently opened files, which has left me more than once with an empty library over a long flight where I was literally reading something on the train to the airport. Really hard to grok how an app could get basic workflows like “I want to continue reading the book I was reading yesterday” so wrong, but somehow this only seems to work like 25% of the time. The desktop is equally broken, though somehow in slightly different ways. Somehow this would be even slightly excusable if the app had any features at all, but tbh it’s a very basic and utilitarian reader app - it’s simple and would be great if it reliably did the three or four things it sets out to do.",
            "region": "us",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.2,
            "user": "ChristineFlip11",
            "date": "04/01/2023",
            "title": "So many issues…",
            "body": "Even before the most recent changes I have been having issues with books in the same series saving all as separate books or books 1 and 3 together, 3, 4, and 5 separately, and then books 7-9 together. In the folders where a few are grouped together it prompts me to re-buy the books I ALREADY OWN. I contacted Apple for help with no resolution. As an avid reader with DOZENS of books it is extremely frustrating to have series separated like this! Now, after this new update, the entire app is no longer user friendly. The font, font sizes, spacing, etc. looks awful. Trying to access specific chapters, settings, bookmarks, and the search bar is super inconvenient. And as small as it seems, having to hit the X in the top right corner to get out of the book is just awful. Due to these changes, I am currently moving all of my favorite books and unfinished series over to the kindle app. It’s depressing to rebuy all of my books on another platform simply bc the developers made all of these changes, clearly without even seeking the opinions of those who use this app. It’s disappointing that Apple continues to destroy so many things that were the reason many of us chose to utilize their products. It has been 11.5 years since the loss of a pioneer whose work is slowly being deconstructed by those who took over his company.",
            "region": "us",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.2,
            "user": "Snap Alongs",
            "date": "01/26/2023",
            "title": "Such a bad update iOS 16 (facepalm)",
            "body": "Have to agree with other reviewers re: iOS 16 update. Wow. App has had most of the useful features gutted and what’s left is a dysfunctional mess. For starters PLEASE bring back the page turning animation. If I wanted to feel like I’m readim* a spreadsheet at work, I’d read a spreadsheet at work. Next - I Tried to bold fonts to help with my bad eye issues and some portions of the book are in bold, some are not. It’s completely random, sometimes with the bold text stopping in the middle of a paragraph or even middle of a word. Previous books no longer open to my last location, but start at the beginning or random locations in the book, leaving me to flip flip flip flip flip flip back trying to find where I left off. Beyond frustrating. There is a quite long lag when opening a book, often leaving me to wonder if the app has crashed. Not a fan of all the functions relegated to the pop up menu tab instead of being readily available at the top of the screen since I am not happy when I have to have a scavenger hunt just to find basic functions. This was not an “update”. It was a huge step backwards. Someone at Apple really needs to take a course in ui functionality and user friendly interface design. Why change the great things about this app and replace it with this mess?",
            "region": "us",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.2,
            "user": "DD West",
            "date": "06/25/2023",
            "title": "Absolutely the worst book app ever created",
            "body": "I’m at 100% battery. 6 gb of storage left. My phone won’t download any books, just tosses them into iCloud. They want you to pay for iCloud. They don’t care if you’re a student just trying to do some homework. Your phone won’t care if you’re not on low power mode and have a lot of storage. You will not be able to get a single assignment done unless you open the PDF in a different app. This “app” is GENUINELY a scam, it’s preventing me from getting courses done that I have paid real money for. I’ve spent 30 minutes now just trying to keep the book open to read the info I need. It just keeps on closing and crashing. I keep having to REDOWNLOAD the book EVERY time that happens. It is a scam. I will be sharing all of my screen recordings and screen shots with the DCA. This is quite literally preposterous. It’s become a normal school standard to have books on your tablets and phones and laptops, yet, these people are trying to FORCE their UNNECESSARY extra services on you. When you literally are just trying to get some work done. And even if it DOES finish downloading and SEEMS like it’s in your iCloud library, oh u wanna open your notes app? HAVE FUN SPENDING ANOTHER 5 MINUTES DOWNLOADING THE BOOK AGAIN???? LIKE WHAT????YOUVE COST ME 30 MINUTES OF STRAIGHT TIME. STRESSFUL PAINFUL. DCA TIME ON GOD I AM GONNA GO CRAZY",
            "region": "us",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.8,
            "user": "CORNYSTONE",
            "date": "2023-02-07",
            "title": "New update is mid",
            "body": "I love this app but the new update sucks. I can’t see how many pages are left in a chapter and I miss the old animation for when the page turns. Now it just looks like I’m reading through a PowerPoint",
            "region": "ca",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.6,
            "user": "YoGoerz",
            "date": "2021-09-30",
            "title": "Beautiful, but limited",
            "body": "Really like reading with this app and have found the award system fun and rewarding!I do want to see syncing for audiobooks that I have downloaded from other sources, even if it uses my iCloud storage. Currently having to manually sync over a wire is not really a modern or practical solution, and is an impossible solution for folks that don’t have a traditional computer.Additionally, would like to see the ability to modify metadata for files in this app. Like in the Music and TV apps where you can change details like artist, director, etc. I’d like to be able to say if it is a novel or textbook, who the author is, etc.; that would be so useful!",
            "region": "ca",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.6,
            "user": "Hedrums",
            "date": "2022-04-03",
            "title": "Keeps Crashing",
            "body": "I’m ok with IBooks but it lately it keeps shutting down within 10 to 15 seconds of opening a pdf. I updated to the latest version of IOS hoping for a bug fix but it still happens each time. I would try deleting and reinstalling the app but I’m concerned about losing all my titles.",
            "region": "ca",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.2,
            "user": "bifocal princess",
            "date": "2021-09-26",
            "title": "Vision problems. App no longer goes to same size font",
            "body": "I have vision problems and found that this app was the only one I could comfortably use for extended periods of time. With the new iOS 15 update it now only goes to the same size as a large print book. That lets me read for about 2 minutes. FIX THIS ISSUE PLEASE BACK TO THE PREVIOUS FONT ABILITY.",
            "region": "ca",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.2,
            "user": "Eselso",
            "date": "2023-02-03",
            "title": "Page turning",
            "body": "After last update the page doesn’t turn like a book anymore! You always have to watch now what side it is going to! HATE IT! Bring the old one back!!!",
            "region": "ca",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.2,
            "user": "lily_mel",
            "date": "2023-01-25",
            "title": "Downgrade",
            "body": "the last update is more like a downgrade. It ruined everything!   I’ve switched to Kindle, and even bought their device.",
            "region": "ca",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.2,
            "user": "GeorgeTDS",
            "date": "2023-01-23",
            "title": "Embarrasing",
            "body": "Whoever was in charge of the last revision of the book app should be fired.  Or at least given a really strong talking to.  The amount of changes that appear to have been made just for the sake of change is astounding.  Buttons have been moved to what seem like almost random places.  Page turning animations have been dumped for some jarring one instead.  I can’t see where I am in the book anymore nor scroll using the same bar.  Please hire someone who cares about what you produce.  Seriously, if you don’t care about your product, why should I?",
            "region": "ca",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.2,
            "user": "Jayyleew",
            "date": "2023-01-22",
            "title": "Why on earth did you wreck this app?",
            "body": "I am incredibly disappointed with the latest iBooks update. The new iOS update removed the auto dark mode, removed the page turning that mimicked turning a real book page, and you can’t adjust the brightness. I hate that the options are now at the bottom in this teeny tiny little button, and you can no longer see where you are in the book just by glancing at the bottom. Please give people the option to revert to the last version. This is NOT an improvement. You are going backwards. The whole app feels dumbed down. The new interface is not fun to use. Very displeased.",
            "region": "ca",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.2,
            "user": "Chonic_Impulse",
            "date": "2022-12-15",
            "title": "It’s ruined",
            "body": "The new update makes one of my previously favourite apps basically unusable. Weird new icons that don’t “hide” while reading are so distracting and the new page flip animation is jarring and makes it hard to focus. So disappointed.",
            "region": "ca",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.2,
            "user": "georgefamily082",
            "date": "2022-12-15",
            "title": "Just a bland app",
            "body": "Previous iOS versions had a fantastic iBooks app that brought a feeling of reading real books in a more portable and easy to use format. From the skeuomorphism that brought realistic page turning animation to the easy to use menu system, the app used to be more complex in order to make the experience  simpler and more intuitive for the users. Now, it’s just another bland app available on the App Store that doesn’t really bring anything unique to the table. In fact, it may cause more users to abandon it instead.",
            "region": "ca",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.6,
            "user": "Poulain",
            "date": "14/11/2023",
            "title": "Frustrating",
            "body": "Recent iterations of this app have been a letdown. There’s a lot Apple could do to improve things, but for now, it makes for a frustrating reading experience. Design wise, there’s the outer margins, which are often too wide to comfortable scan lines of text, especially on an iPhone mini. Highlighting text is a gamble – sometimes it works, sometimes it doesn’t, sometimes it works but only by half. The themes UI feels like it was an afterthought, clunky and confusing. The menu itself is hidden away behind a non-standard, counterintuitive interface that’s uncharacteristic of Apple’s usual approach to design. And the theme options are overkill. Most of us simply want light or dark modes and the ability to adjust type properties, not a collection of rigid styles. Plus, you can’t even adjust the font size within these themes. There’s a lot Apple could do to improve this app, but for now, it’s a frustrating reading experience.",
            "region": "au",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.2,
            "user": "Catlady123321",
            "date": "17/01/2024",
            "title": "Getting worse over time.",
            "body": "Not only has the type sizes been limited, which is a real pain for those with any visual impairment (and the reason I started using the app and iBooks many years ago), but the functionality has been messed with so much that it is really difficult to use. No longer able to easily look up definitions of words, I find it easier to open safari and google the word. Also the menu at the bottom will not always open, no matter how many times I tap it. Very frustrating. Now when I’m reading a book, if I’m in landscape mode, sometimes a new chapter opens when I page forward, even though there are still pages left in the old chapter. The only way I can rectify this is to turn the iPad to portrait mode and then back to landscape mode. Also sometimes when I turn the page and it is a new chapter< I just have blank pages, the only way to rectify this is to close the app and reopen it. Not good enough Apple. Do something about these faults as I cannot afford to rebut all my books on Kindle, nor should I have to. You have made it so these books cannot be read on other tablets so you should ensure that your app works properly and also be more usable by the visually impaired by allowing larger font sizes to be used.",
            "region": "au",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.4,
            "user": "Wizened Gardener 732",
            "date": "07/12/2022",
            "title": "I hate the new UI",
            "body": "Wouldn't people be happy to blow up your beloved books app with the new app? Congratulations on blowing it up. The newest update is frustatingly hard to navigate. You should stop destroying apps. The original books app was comfortable, and I like the UI but the new UI—whatever, I do not! Do you see a lot of complaints? They all hate the new UI! Just change it back and people would like it! The close button and options button is annoyingly hard to make it appear again, the page turning animation is good and now replaced with a trash animation that makes no sense to change to, the button at the bottom is terrible, change it to various button that appear by default. If you leave the new UI, people will be angry!!! So just change!!! I hate the new UI!!! It's so uncomfortable, is ridiculous, and easy to get irritate!!! Congratulations on wasting your time doing a pointless thing only to increase the amount of critical reviews! I hate the new update! The UI is just confusing to use and already lots of people are hating it! Change it back and you'll get more 5 star ratings!!! Just do it!!!",
            "region": "au",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.6,
            "user": "ahhwhwhshahabaawkwksbaba",
            "date": "06/04/2024",
            "title": "Reading Goal Doesn’t Work With PDF?",
            "body": "Although my most recent read - a PDF; is listed under “continue reading” in Todays Reading Goal section - the minutes I spend reading PDF’s do not count towards my daily goal? Why not? I’ve spent hours on a topic and my tracking doesn’t reflect that, nor is there a way to manually adjust this. It’s pretty frustrating to have to download a separate app and manually enter in my tracking when this app is meant to do it automatically for me. Tracking is super important for me and I’m considering other reading apps just because of this. It’s a pretty silly bug that I hope gets updated. A lot of papers and journals are PDF only and I prefer to keep all my reading in one place - I’ll likely stop using this app if the next update doesn’t make it easier to use.",
            "region": "au",
            "drm_relevance": 0.0
        },
        {
            "rating": 1.0,
            "user": "BKP083",
            "date": "15/06/2023",
            "title": "Seamless Integration and Unmatched Convenience",
            "body": "The Books app offers an unparalleled reading and listening experience for avid readers and audiobook lovers. It stands out for its ability to seamlessly integrate across all my Apple devices - the iPad, iPhone, and Apple Watch.Having access to my entire library wherever I go is an incredible convenience. Whether I'm commuting, waiting in line, or just relaxing at home, my books are just a tap away. It essentially turns every moment into a potential reading opportunity.Furthermore, the compatibility with Siri Shortcuts adds another level of convenience and efficiency to the user experience. Being able to navigate my library, start an audiobook, or bookmark a page using voice commands is an excellent feature.",
            "region": "au",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.2,
            "user": "Mr. Puddy",
            "date": "07/07/2023",
            "title": "This is the WORST update Ever !",
            "body": "The developers gave so much function to adjust but it’s nothing practical. So much steps to adjust and I didn’t even see the actual stuffs till I done with setting. It’s obviously the developers never read a whole book . All types of the font is too crispy to the eyes. The back ground color and the color of the font didn’t go well together it’s harsh to read. The brightness is the worst ! Too bright or too dark. I tried to fix it by ebook setting ( bottom corner ), go to main setting of iPad . I did adjust brightness. It’s still not good. Set up accessibility, go to Display & Text size. I tried every single option but it’s all seriously useless. None of it can make all the text in the book looks softer, easier to continue to read. Feels like I am going blind when read. Please fix it! and please ask a Reader ( someone who read a book) to READ WHOLE BOOK test it before you launch the next update.",
            "region": "au",
            "drm_relevance": 0.0
        },
        {
            "rating": 1.0,
            "user": "Dhellcat",
            "date": "11/10/2021",
            "title": "Educational Tool",
            "body": "Looking at the reviews of negativity is sad, as the Books App is an awesome tool for interactive learning. I tutor folks with a variation of disabilities, who are able to use the MarkUp tool to improve their Literacy skills on the Books App. You are able to download .pdf documents which can be uploaded into the Books App, then using Text boxes on the iPad or just simply your finger to write with you can insert information on the document. Do not miss out on the wonderful range of Creativity Books available for Free relating to iPad Apps and also every time there is an Update to iPads and iPhones folks do not even know there are FREE manuals available on the Books App..............Thank you from a very grateful Tutor.....👩🏻‍💻🌻",
            "region": "au",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.4,
            "user": "zeroxdun",
            "date": "21/09/2023",
            "title": "Hotfix needed!",
            "body": "With VoiceOver on, I used to read (listen) pages and chapters continuously. Each time when I reached the end of a page I'd hear a page turning sound feedback and speech would continue automaticly, also the page ticker jumps accordingly.After last night's phone restart, the app launched with a welcome message and data collecting question, liked a first launch on a newly downloaded app. I selected my current reading title, using the Speak Screen function as usual, but the speech stopped at the end of each chapter and the page ticker remained at the chapter's beginning page. I had to use the page ticker manually or the chapter selection to go to the next chapter.It's very frustrating to read with all the hustle needed from one chapter to another. Please fix ASAP!!",
            "region": "au",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.2,
            "user": "Mick74-1",
            "date": "08/06/2022",
            "title": "Love the app BUT…missing dialog window button labels!",
            "body": "Would rate 5 except for the following issues that has been plaguing me for years now. Thought it was due to an older phone still running ios12 I think it was. But now have new Iphone13 pro and newer iPad running the latest ios15 and still have the following issues: 1. When ever I rename a PDF the dialog window that pops up has no labels on either of the buttons that I know are cancel (left) and ok (right) underneath the PDF title bar. 2. Seems the above issue re no labels on buttons occurs for me on ALL dialog windows that pop up. Just found it on the View Account Settings dialog window: looks to have 4 buttons under my Apple ID but not one has a label! Also happens on the Sign In dialog window as I tried sign out and back in to resolve. 3. No way to report bugs, I.e. this issue, via the App! And App Support link from App Store for Books goes to a non existent web page!",
            "region": "au",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.2,
            "user": "Billy Mackgordon",
            "date": "13/12/2022",
            "title": "BRING BACK THE OLD APPLE BOOKS PLEASE",
            "body": "I have used apple books throughout this year and it’s a great to read books on, in my opinion. However, the new updates have been getting on my nerves. First it was the change from having your navigations (library, search, collections, etc.) to the bottom of the page to this File App like section on the left side of the screen. Then the whole layout of the book reading experienced has changed! WHY IS THE ‘X’ BUTTON ROUNDED AND WHY DID IT REPLACE THE BOOKMARK BUTTON. UGH. Finally, the reading experience was changed. I loved the experience of turning a page like a real book, however, that’s been rid off now! That feature made me feel closer to reading a real life book, but this new card switching feature distances me from that experience. Please take our reviews and opinions into consideration, I beg of you : )Steven",
            "region": "au",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.6,
            "user": "Sioloc",
            "date": "03/06/2023",
            "title": "Needless redesign",
            "body": "The UI's been overhauled significantly for ios 16, with settings now buried into multiple sub menus that only take up a small corner of the screen, making them hard to navigate and use.   They've restored the page turning animation in a recent update, but the edge tapping now doesn't work properly for turning pages - i have to swipe forward on every page. Looks like they significantly reduced the size of the tap area.  The swiping is better now than in ios 15, where swipes forward would somehow send you back a page, or do an animation but stay in the same page. I'm looking for another ebook reader now. I much prefer the kindle or libby apps - have just been using this for epub files, but have had enough.Edit: i've tried 4 other apps and have come back to this one 😅😂 i still don't like it, but it is somehow better than the others...",
            "region": "nz",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.4,
            "user": "whitney311",
            "date": "18/08/2023",
            "title": "Crashes and don’t issues",
            "body": "It’s slow to open, crashes and say it can’t download a book at that time even though I’m half way through it. But by far the most annoying thing is when I finally get a font setting that is good (the preview in the menu isn’t actually the font you’re using) then the book changes lines spacing between paragraphs on the same page. Or even completely different fonts from chapter to chapter throughout the book. It also doesn’t remember my font preference between books so then I have to much around setting it again every time I start a new book.",
            "region": "nz",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.6,
            "user": "Peritas Harry",
            "date": "18/02/2023",
            "title": "Books quantity",
            "body": "Hi ,There are good books on this App site, but not nearly as many as I would like. You need to expand the number of books by a long way. More often than not the book I want isn’t there. Otherwise it’s a great way to read and not have to carry books with you.",
            "region": "nz",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.2,
            "user": "PenguinGeorge",
            "date": "13/01/2022",
            "title": "Skipping or jumping pages",
            "body": "Books has show stopper bugs that made me look for a replacement reader app. There seems to be a bug with pagination, especially when orientation changes. In some cases, the Books app just skips a few pages or jumps to a completely different page in the book. Some other times the app does not remember the previous reading position and you have to scroll manually. These bugs make the app useless to me. IMHO, It’s very far from what was called the Apple quality and, being a software engineer, I can’t comprehend how the most fundamental features are not working properly.",
            "region": "nz",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.4,
            "user": "spimach",
            "date": "12/11/2022",
            "title": "IOS 16 failure",
            "body": "I really used to enjoy reading using this app. Now it is very difficult, the font doesn’t change sizes correctly, some parts of the books are large in font others are small. The bookmarking feature is also very bothersome as it is easily triggered while swiping. The page turning feels to ‘digital’ the realistic version from previous IOS was much nicer. Please at least give users an option to choose how the app is!!",
            "region": "nz",
            "drm_relevance": 0.0
        },
        {
            "rating": 1.0,
            "user": "sibling/",
            "date": "23/05/2023",
            "title": "Ghostly game",
            "body": "You have charged me twice for this book at two different prices And there is no way to contact you Please tell me how to contact you so you can return my money I and on a pension and can’t afford approX over $40 dollars for a book",
            "region": "nz",
            "drm_relevance": 0.0
        },
        {
            "rating": 1.0,
            "user": "aizes456",
            "date": "22/04/2022",
            "title": "Lookin good guys!",
            "body": "Make note taking even easier please! vocabulary collection system for review would be great for studying. Some bug when in landscape mode, then locked, and then unlocking the lockscreen makes the page skip 2-3x!",
            "region": "nz",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.4,
            "user": "Olivia_Lowe",
            "date": "20/11/2022",
            "title": "iOS 16 ruined it",
            "body": "Sadly the iOS 16 update has kind of ruined the app for me. The scrolling is so sudden, the bookmark feature is easily triggered as I try to swipe, the font is also occasionally messed up as well as the size or spacing of words/letters. the highlighting option is also much more complicated",
            "region": "nz",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.2,
            "user": "owl&quill",
            "date": "31/01/2023",
            "title": "Not impressed",
            "body": "I’m sure this app used to work, but no longer. It doesn’t like importing books, it doesn’t like opening books, it just doesn’t like working. I regularly have to close and reopen the app, or even restart my tablet completely, in order to be able to read a book. Not helpful! When it *does* work I like the app, but unfortunately “working” is not its default setting.",
            "region": "nz",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.2,
            "user": "Thisisjusttoohard",
            "date": "23/11/2022",
            "title": "IOS 16 what a joke",
            "body": "I have to agree with the other comments on the update.  I’m very disappointed that this is a downgrade not an upgrade. Like others I’m sure I enjoyed the simple easy way to read books, even to go to next page is a mission tapping the screen.  As for going “Back to page” that’s a mission. NEVER FIX SOMETHING THAT’S NOT BROKEN. Please bring back the simple easy steps.",
            "region": "nz",
            "drm_relevance": 0.0
        }
    ],
    "Audible": [
        {
            "rating": 1.0,
            "user": "Amytdot",
            "date": "04/01/2024",
            "title": "What an incredible ride!",
            "body": "Started watching Glenn Lundy’s Saturday Morning meets! The end of 2017! A man by the way of John Dawson kept bragging about a store selling  over 800 cars in a small southern town! I thought this has to be bulldodo! But boy was I wrong.    In late January 2018. I set my alarm to get up at 5:30 am to watch a morning podcast! Never had heard one live before. And this man in closet. Was exited that I was watching him. He started telling me good morning, good morning, good morning! I thought the dude was a super human! And over time of getting up early!      My whole world changed.    I was ready to do something different in 2018. Then  I gained our #riseandfamily , hustle and Grind Con in 2018 in October! My income doubled. And the triple after being in the car business since 1981 or 2 cleaning my dad’s service bays and parts department after school and on Saturday. Then running his detail department at Weatherby Auto Sales in 1987. Basically grew up in the business 3rd generation.      But this book by Glenn Lundy The Legacy Titles ! has got me thinking again to venture out on my own. After getting my lifelong dream job as Used Car Manger at Marietta Toyota! Where people had to retire or die before you could get a job there!  Thank you again Mr Glenn Lundy for all you have done for my growth in the car business just a big breath of fresh air! In a very  long time stagnant industry!! Love you Brother!!",
            "region": "us",
            "drm_relevance": 0.0
        },
        {
            "rating": 1.0,
            "user": "BenBasil",
            "date": "12/12/2022",
            "title": "Some issues but overall worth the price",
            "body": "I love audible, it’s easily my favorite app and really the only reason I use my phone for anything other than communication. The price is more than reasonable, for $15 you get access to a lot of really solid books, plus a credit to use on any book you want, no matter the price. Depending on their age and popularity, some books can be upwards of $30 by themselves, so that’s a pretty sweet deal. Credits carry over and, as long as you keep your membership, they will not expire (if you cancel, be sure to use any left over credits before you do). My only advice is to check the book’s price before you use a credit on it. As I said before, a credit is good for any price book, but that also goes for inexpensive books. They don’t make it easy to see the actual cost, I have to use my phone’s browser because they don’t show you within the app, but there have been books I want that are only $2-3, which would be a total waste of a credit, so I just buy them with my credit card. The only con for me would be (as of December 2022, at least) is the poor compatibility with iOS, you can’t use Siri for any commands other than rewind/play/pause/forward. Since I listen with my AirPods most of the time, it would be nice, but I guess I understand with the whole Alexa vs. Siri war.",
            "region": "us",
            "drm_relevance": 0.0
        },
        {
            "rating": 1.0,
            "user": "aliboo210",
            "date": "01/14/2023",
            "title": "Kudos to the developers",
            "body": "I’m back to loving the app! My original negative review is below. I got a response from Audible developers who instructed me on how to remove the Alexa button. It was actually very simple, but I couldn’t figure out how before, and had even contacted Audible Help (before I wrote the review) but the rep said Alexa couldn’t be removed. So I’m very happy again with this app. And I’d like the Alexa button if it were in a different location in car mode. Here’s my original review:The new Alexa button is annoying, and frankly, a little dangerous. I used to be able to hit the \"rewind\" and \"bookmark\" buttons in car mode without looking down at my screen while driving. Now I have to look at the screen to hit those buttons because otherwise I accidentally hit that HUGE Alexa button at the bottom of the screen. (Which interrupts my book.) Super frustrating. Sure, I could use the Alexa button instead, but it takes longer to hit the button and say \"rewind 10 seconds\" than just hitting the rewind button like I used to be able to easily do. The Alexa button isn't a bad idea, but why couldn't they have put it somewhere else, and not make it so big? This has ruined the app for me. I sure hope they fix this terrible design in future updates. I’ll gladly change my 2 star rating to a 4 or 5 if they do.",
            "region": "us",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.4,
            "user": "CadusBane",
            "date": "10/18/2023",
            "title": "Why do they update, only to break the app",
            "body": "Had my new iPhone 15 pro max less then a month. Go to download my catalog of titles only to find out anything over a GB won’t work. It only streams, as I’ve tried twice since the most recent updates. I called and logged the issue with Audible, and told to download in parts. I love the bigger books all in one file. It was fine on my old iPhone 11 Pro Max. I have reflex sympathetic dystrophy, I can no longer hold books or write. So using Audible is so important to me when it comes to the Bible. Use daily and take notes through the app. The app even encourages customers to download all in one file. That’s great, but it doesn’t work anymore for books larger then GB. If anyone like me you have larger libraries, this means can’t even use higher quality downloads on many books. But it’s getting ridiculous the way Audible has gotten lazy. It happens every other year with iOS update and app updates. It either wipes out all of your downloads, or it breaks the app to be able to download. I’ve been at the premium level since 2012, I can’t count the times I’ve bought three extra credits a month. When they had their reading challenges last year, had the amount listened to in a week. I love this app, but I need it to work at the level it has for so many years before. Need this to be addressed and fixed. I can call again and be told sorry, and given extra credits. I don’t want to call anymore if nothing is going to be done to correct the issue.",
            "region": "us",
            "drm_relevance": 0.0
        },
        {
            "rating": 1.0,
            "user": "ramacharaca",
            "date": "07/25/2023",
            "title": "A Genius business with enjoyable features",
            "body": "This has been a wonderful way to save time and achieve the same result. I have being able to perform labor tasks or even play video games which take up a different response sector from my ability to focus, perform, absorb and respond. While I can divide my attention, this nifty app allows me to focus on both my physical labor and the text/ideas being shared here with the same intensity and similar results. The narrators so far have been great, their tempo, punctuation and emphasis has been on point. The variety of works from which to chose is broad and so far I have found most if not all of the books I wanted to read/listen to. Also, the fact that Audible provides free credits every so often is remarkable( imagine not only how much money is saved but also time to travel and shop for these. Not to mention what if they are difficult to find provided their less then popular demand). The features to control the speed of the narration, also the ability to play on the background for if in the midst of listening one should attend a communication from a friend or family and not want to disturb the suspense built on the best part of the book.   Also, I am sure there are other features I have not explored. So this is it for this review being. Thank you 🙏",
            "region": "us",
            "drm_relevance": 0.0
        },
        {
            "rating": 1.0,
            "user": "John a sec",
            "date": "12/02/2023",
            "title": "I almost never read anything with a perfect score, but Audible deserves a five, nothing less.",
            "body": "This is simply a tremendous app. It is thoroughly and I mean completely accessible for use by blind people and others with various disabilities. This is a wonderful ethic that Audible has that very few other companies do. I have over 1000 books in my library, and I’ve been with Audible using its application since about the year 2000. I joined Audible not expecting much… But they have proof to be a company that is responsive and one that cares very much about their users.The Audible app has become indispensable to me, and I can only say that about one or two other apps, among many on my phone. It simply works, and works well. My favorite feature is that it organizes series in their chronologically released order. This means that you can see immediately in your library if you’ve missed one in a long series of books that you enjoy, and can usually immediately purchase it right through the app.Audible, I am retired now, but I look forward to many years of listening pleasure, and it’s all possible because you’ve made such a wonderfully accessible and useful application. Thank you, and please keep up the good work.John Esak.",
            "region": "us",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.6,
            "user": "Gale22",
            "date": "05/03/2021",
            "title": "Most used app I have aside from gps",
            "body": "Love this app so much. Had it for years and does not disappoint. Thank you for being here, existing and being in my life. Such a great idea and concept. Sorry it took me so long to rate this amazing app! Get it, you won’t regret it, so many wonderful title and books and not over priced!Update: This is still a great app but it needs to be said that the home tab is waaay too much noise visually speaking. Way too many suggestions and advertised books for an app. It’s not a clean look and honestly it’s ugly. The app needs a more sleek minimalist feel for ease of use. I literally get anxiety seeing the homepage with all the extra books recommendations, catalogues and so forth. When I use the app I just want to get to the point not be defaulted to a crazy looking page foot of book images. Please higher someone to update your app comestically. With the IOS update people are discovering less is more with widgets and less apps. Try to use that same concept, I want to see recommendations make it the last tab not the first. Have the first tab be the library and instead of a line chart of books maybe give the option of line display or chart display, just something more sleek please.Update 03 May 2021: The app skips the audio for some reason and when the screen goes dark it stops playing. Please fix this. This is pretty frustrating and my settings don’t have anything that causes this to happen.",
            "region": "us",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.8,
            "user": "Howiejf",
            "date": "10/13/2023",
            "title": "Be careful",
            "body": "I was a big Audible user and supporter for years. When the membership terms required a monthly fee, I stayed with. Happy to use the large audio library for members only. The idea of earning a credit a month to use for any premium item also fine. I had accumulated four credits, when I decided to take a break . Now this is the problem, and in reality it is my fault for not reading the fine print. I THOUGHT that I would take a few months off of the membership to use credits that have been building up. Fully planning on rejoining in a few months time. What I did not realize was that once you suspend the membership you lose all of your accumulated credits .. back to zero. If you seek out this information you will find it. I never looked at the whole contract . Kind of silly to pay monthly and then lose all of you credits if you stop temporarily or otherwise.. Without this issue Audible is a five star company, but this nickel and diming was and is unfair, stated or not , fine print or not. So this is a cautionary tale. If you are a member  or plan on becoming one be advised that if you stop your membership you will lose all of you amassed credits. If you are the type of person that uses the credit immediately, then you are fine. Otherwise heed the warning. You will get your credits erased too.",
            "region": "us",
            "drm_relevance": 0.0
        },
        {
            "rating": 1.0,
            "user": "ProcyonLen",
            "date": "02/16/2023",
            "title": "EDIT one of my most used apps.",
            "body": "EDIT: Thanks so much for the response, team. I updated the app and am so relieved. I can’t tell you how much I was missing listening to my books. So happy it was just a bug! Definitely giving the app 5 stars overall! I LOVE my audiobooks. Audible was one of my very top used apps, as I have a hard time focusing on tasks around the house/work/etc without some sort of sensory input. I have it running almost all the time. The last update ruined the whole app for me. I live way out in the middle of nowhere with no wifi and only the most tenuous connection to the data network. Suddenly, after updating the app, it won’t play any of my DOWNLOADED titles without an internet connection. What the heck is the point of taking up my phone storage space downloading all these books, if I now can’t even play them from my phone?? I am so disappointed, as I can’t listen to any of my favorite books at home anymore because I can’t find a place to connect enough to start the chapter. I know I’m just one random human to a huge corporation, but please, please, please, fix this. I am already missing my books acutely. It’s so disappointing to not be able to play my selection of downloaded books.",
            "region": "us",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.8,
            "user": "snelson75",
            "date": "10/26/2023",
            "title": "Just okay",
            "body": "The first part of the book starts out centering on a family…Jill, David and their daughter, Sofia.  Right away, I was annoyed with Jill and sadly, Sophia. Jill is a helicopter mom, her life centers around Sophia and everything else, including her husband, is a distant second. Sophia is a spoiled brat. Jill had a rough upbringing and then a traumatic event happens in their lives which leads to Jill being unattached and distant, as well as, having a hard time relating to many people.The second part of the book is where it picks up. Someone takes Sophia. We also get more into another character, Bea, who has a lot to do with, well everything. I won’t divulge because it would reveal too much. We are also given several snippets of a third character, via her journal. That is the part of this book that I really enjoyed.I pretty much knew right away who all the players were before the author came right out with it.  What I didn’t like about this story was all the loose ends left open. There were SO MANY. I feel like the author didn’t give Jill and David their due redemption.I will say this book really was a page turner and I listened to it even when I wasn’t commuting, which is rare.  Aside from the way RD finished this book, it was a good story and the narration was A+. Would I listen to it again…probably not.",
            "region": "us",
            "drm_relevance": 0.0
        },
        {
            "rating": 1.0,
            "user": "Au resto",
            "date": "2018-11-24",
            "title": "Many faults",
            "body": "Where is the free category?  Can’t buy and download directly in the app?  Seriously!?!?  Work it out with Apple!  I’m sure you can find a way.",
            "region": "ca",
            "drm_relevance": 0.0
        },
        {
            "rating": 1.0,
            "user": "J1222",
            "date": "2017-09-17",
            "title": "Terrible UX",
            "body": "It should not be this difficult to BUY something from a company. I should be able to make purchases inside the app or at least click a button that would take me directly to an outside URL where I can pay for the item I want. Will delete app after listening to a podcast series only on Audible.",
            "region": "ca",
            "drm_relevance": 0.0
        },
        {
            "rating": 1.0,
            "user": "caledongrl",
            "date": "2018-11-14",
            "title": "there could be major  improvements to this app",
            "body": "The app worked better before, after all these updates the app for IOS is very flaky. Cuts out, freezes, stops, won’t load, a whole mess of things. My rating has gone down for this app since the quality has gone down significantly.",
            "region": "ca",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.2,
            "user": "Toukay",
            "date": "2019-09-27",
            "title": "User beware",
            "body": "This app deletes all purchased book tokens, regardless of count, if you cancel the service. I had a purportedly odd situation of having my accrued tokens deducted when I opted to pay cash for an audio book. Some audio books will not be worth the monthly book time you get from the subscription. Instead of investigating my complaints I received formulaic responses about browser caches and otherwise. After deciding to cancel, only the did I learn that all the money I spent on book tokens was going to be deleted. Every other service I have ever dealt with at the very least offers some manner of refund for the unused portion of the service. So beware. Audible comes with a very unpleasant lock-in mechanism that will punish you for cancelling.",
            "region": "ca",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.2,
            "user": "samanthaj94",
            "date": "2019-11-03",
            "title": "Not Impressed",
            "body": "Downloaded and paid for membership back in February. Cancelled membership on audible.com over the summer but still found they were still charging me monthly after the fact. Called customer support to find out what the charge is for. Ended up finding out audible.ca had been charging me - even though audible.ca came out after I had bought the membership. Issue: audible.com says I am not enrolled in a membership, whereas audible.ca says that I am. I understand that these are two different services but this is one company. I think it’s ridiculous and very misleading that one company related site would say I don’t have a membership, while another company related site says that I do. Customer service did not even offer a refund for the months I cancelled my subscription on audible.com Please work on having some sort of uniformity when it comes to membership information displayed across your websites.",
            "region": "ca",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.2,
            "user": "ScottyD1976",
            "date": "2019-03-01",
            "title": "Very difficult to cancel subscription",
            "body": "I subscribed to Audible but found listening to books wasn’t for me.  When I went to cancel, I found it difficult throughout the process.  You can’t cancel from the app or through the mobile site...only the desktop.",
            "region": "ca",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.2,
            "user": "PICK A NICKNAME APPLE",
            "date": "2021-01-22",
            "title": "Ridiculous",
            "body": "One of the worst experiences ever on an App. How do you buy books? You don’t, they sit in your wishlist forever because you can only listen to 5 minute samples.",
            "region": "ca",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.2,
            "user": "Lugis2",
            "date": "2019-03-15",
            "title": "Buggy, expensive, bloated, wont sync with Apple Watch",
            "body": "...but apart from that, great!Sent a detailed description of my issue to support. They sent me instructions for how to install the app, and a cheerful promise that I would then be able to listen to audiobooks. Deleting and reinstalling, this app now comes with half a dozen excerpts of books, in French for some reason, with no option to delete them. Maybe it’s mad at me because I wouldn’t share my iTunes library with it?When it is “working”, I can search for books but get a message that says “this app can not be used to purchase content” even though I am a subscriber. I have to go to a separate website if I actually want any of the books.",
            "region": "ca",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.2,
            "user": "hfsuebay",
            "date": "2020-12-03",
            "title": "Hard to cancel",
            "body": "‘Free trial’ but you need a desktop to even cancel. You cannot cancel through mobile or the app but you can use those to sign up. Don’t fall for it.",
            "region": "ca",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.2,
            "user": "nicnic09",
            "date": "2021-02-19",
            "title": "HORRIBLE APP",
            "body": "This is bar far the worst app on iOS. I cannot understand how anyone would rate this five stars. It is the most un-user friendly app I’ve ever been on. Feels like it was made by 5th graders.",
            "region": "ca",
            "drm_relevance": 0.0
        },
        {
            "rating": 1.0,
            "user": "jazztyke",
            "date": "05/12/2020",
            "title": "Hate new App front page",
            "body": "Audible app is definately in my top 5 apps I go for on a daily basis on my iPhone and iPad.  First thing when I get in the car I select my latest book to listen to.  When I'm at my desk I set my phone on it's dock and continue 'reading' while I work and the same goes when I'm cooking.  I use this more than iTunes nowadays.It isn't perfect - I don't download to my phone anymore because usually I get an error message after it's downloaded the first 5-10% of a book, and then just stops - nothing will get a download past the first 10% no matter how I tweak the settings.  So now I just download to my Mac and drop it into iTunes, to load up when I sync next.  It's a bit of a nuisance but....This never used to happen, just since 2 or 3 revisions ago.  I can live with the inconvenience though.    What I couldn't live without now is the App itself - it's so convenient to listen to a book rather than have to give a book your whole attention as with a paper book or eBook - although I read plenty of them too.My only real hate is the ‘dashboard’/home page the app starts on now. I’m not interested in whatever it has to say...all I want is my Library when I open the app.",
            "region": "au",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.8,
            "user": "Shane_J_Gumboot",
            "date": "27/02/2022",
            "title": "I’m all ears.  I hope someone’s listening as well.",
            "body": "Everyone should give audiobooks a try. Audible has helped me enjoy and explore so many more titles and topics (now over 400 in my library) than those dusty, neglected titles stacked on my beside table. Along with a constantly updated and wide array of captivating and entertaining titles, it’s great to share the experience of so many of the great masterpieces of mankind. I appreciate that they are preserved in spoken word form for our future generations.  Whilst the above is true I still feel compelled to hold a Star (or two) of hope that someone, who is proud to work at Audible, will take the lead in preserving and presenting some of the many, many fine works of the late great Mr James A Michener. It’s been great to listen to and savour other masterworks like War and Peace, Crime and Punishment, Great Expectations…It’s a very long list. Humanity should hold on to this timeless wisdom. Lest we forget. What is noticeable absent however are other classic titles like Centennial or The Source or Alaska? Like earning the Audible trophy’s within the app and I’m sure the team at Audible like earning rating Stars for this app. Audible will earn another two stars (from me) when they publish some of the works of the mighty Mr Michener. I’m all ears. I hope someone’s listening as well :)",
            "region": "au",
            "drm_relevance": 0.0
        },
        {
            "rating": 1.0,
            "user": "Easy listening1221",
            "date": "19/03/2024",
            "title": "An intelligent look at the post capitalist world order",
            "body": "The books reads as a retrospective look at the evolution of capitalism and as a letter to the dreams and visions of Yanis’s father. A deep dive and collective view of the future of capitalism re written by the cloudalist, argues that China and America basically own the future. The new rent seekers are the technology companies in earnest now realistically control much of the way societies think and interact as well as the way global finance interacts with consumers and businesses. A great critique of the promise of blockchain and digital coins and how they were usurped by con artists and the dream of decentralisation way just a parting dream. It’s a sorrow tale for left who dreamed of a post capitalist rebirth of the socialist system. That is dead the power now more than ever resides in the hands of tech bros and fewer nation states to set the rule of the future. I appreciate that he gives a remedy to this at the end, with a independent revolutionary concept, worth exploring, the conditioning of all us will be at war with the desire for change someday I hope. A great contribution to a topic not really discussed today and one I hope sees other expand on.",
            "region": "au",
            "drm_relevance": 0.0
        },
        {
            "rating": 1.0,
            "user": "LynMac87",
            "date": "24/02/2021",
            "title": "One of my Top 3 Apps- BUT...",
            "body": "I love my Audible App & use it daily. There really is something incredibly special & satisfying about hearing your favourite stories brought to vivid life by a talented narrator. My job involves spending all day looking at a computer screen so my eyes struggle to cope with the added strain of reading on top of work- my audible app means I can still emerge myself in so many of the literary worlds I love.My ONE complaint? Since the last 2-3 versions have been released, sometimes I can’t get newly purchased books to download. REALLY annoying. Most of the time (90-95%) I just wait a day or so & the problem fixes itself. Once or twice now I’ve had to delete the App, shut down my phone & then RE-install the App again once I’ve turned my iPhone back on. This seems to be a recurring theme in a lot of the most recent reviews- wish they would fix whatever bug it is, because otherwise this App is the best thing to happen to my ability to keep reading for enjoyment in a long, long time!",
            "region": "au",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.2,
            "user": "Joeleous",
            "date": "04/03/2023",
            "title": "Great but some tweaks required",
            "body": "1) Need an option to stop seeing certain books. I will never buy a book from Michelle Obama, Will Smith, or Prince Harry so please give me an option to say not interested and for these to no longer be displayed.  2) Daily deals are great and I have bought a bunch however they are more often than not completely irrelevant. Given the large number of books on Audible there are bound to be more customised options available  3) I am often interested in series which are very old like Clive Cusslers Dirk Pitt, Wilbur Smith’s Courtney’s, Tom Clancy’s Jack Ryan’s. All of these titles cost the same as a new book even though many are decades old and no longer on the best sellers list. I, and many others, would be tempted to buy whole series at a discount or buy one at full price and the rest 50% off, or 2 for a credit.4) Last but not least. I am not one bit interested in LGBT or Australian Aboriginal literature. Many of my favourite books have characters or content which deals with these however it is not front and centre. How Audible pushes books with a pure focus on this content on their clients I find frustrating and reprehensible. Your role is to provide compelling content to all of your clients not force fringe content, relevant to a few, on everyone in an transparent effort to appear progressive and righteous.",
            "region": "au",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.8,
            "user": "we all lov jojo",
            "date": "15/03/2024",
            "title": "AMAZING",
            "body": "This app is used 24/7 by me, as someone who can’t just fall asleep with silence, I need something to listen to, and for me trying new podcasts are always so hard because I am so used to the other ones that I listen to. But when I first found a book to listen to, I thought that it was like amazing I was like I actually like this, and that’s weird for me because I don’t normally like new things I don’t really like change so that was actually a really good thing to discover because now I can try new books whenever I get sick of one book then I can go and listen to another podcast or another book. Although I would say sometimes when I’m trying to skip or back it doesn’t let me so that’s one downside but otherwise this app is amazing. Another thing to mention is that if you want to get a monthly ticket or credit to use for a book or podcast you should do it. It’s quite cheap and it actually works and it’s actually pretty good to do because it some of the books that are already free on Audible they don’t normally they aren’t that good in my opinion so I would suggest highly buying the monthly credit thing.",
            "region": "au",
            "drm_relevance": 0.0
        },
        {
            "rating": 1.0,
            "user": "boyes boys",
            "date": "29/06/2022",
            "title": "Tuesday with Maurie",
            "body": "I really enjoy to listening to this and I have read the book and I am not really a person that reads so the aublile books and podcasts are really good for me l have listened to several autobiography and enjoy them some better than others and I always seem to have a break from them and then I go back to them that is just a personal thing listening to Tuesday with Maurie and I watch the film was something a friend got she was only in forties it’s a horrible disease and watching some one go through it is hard to watch how it effects them I found I could relate with some of the ways as it was just like the things my friend went through let’s hope some day a will find a way that it will prolong a person’s life as I don’t know if they will ever find a cure well not in my life time but once upon a time you rarely heard of it but  now you see more people with it and I can relate when I see them as I watched my friend fight the disease and eventually losing the battle with it",
            "region": "au",
            "drm_relevance": 0.0
        },
        {
            "rating": 1.0,
            "user": "Juzzy1973",
            "date": "11/07/2022",
            "title": "A relatable life story",
            "body": "Selma Blair, you have such a relatable story to so many women of my generation and (I’m sure) for every generation before and to follow. I saw myself in you in so many ways… childhood innocence, navigating teenagerdom, the vulnerabilty, relationships and all the lessons that come with it all. Highlighting to us all that we never stop learning and relearning throughout our lives. As an actor who has grown up parallel to me, I never realised that you were actually growing up in front us all, experiencing such similar anxieties, anguishes and adversities that we all face.You have emerged like a butterfly with such grace and composure… The message I have taken away from your story is to keep going and keep growing and learning, despite what is thrown at us in this crazy old world.The best part about listening to your story on Audible is that YOU told the story to me… straight from the horses mouth. With all of the raw emotion, laughter and tears. Thank you, and please keep writing… it really is your true calling. 🙏❤️",
            "region": "au",
            "drm_relevance": 0.0
        },
        {
            "rating": 1.0,
            "user": "Mangtrexc",
            "date": "13/08/2023",
            "title": "Everyone must read this book",
            "body": "This book changed my life. Bessel gave me so much hope as a trauma sufferer also dealing with addiction and mental health issues. He shared a variety of proven and successful avenues for healing trauma outside of western medicine practices. The psychiatric industry has been failing us greatly and is keeping us sick and at risk. This book gives us agency by providing so many solution based approaches which are holistic and gentle on our bodies and minds. Rather than provide Band-Aid solutions which never deal with the issues at hand he provided insight into how to address the cause of our suffering by leaning in and provided strategic approaches to taking our healing into our own hands no matter where we are in our lives. This has lead me down a new healing journey after years of searching and has given me so much inspiration into new ways of. healing myself in more effective ways that promote growth rather than quash who I am with medications that don’t work.",
            "region": "au",
            "drm_relevance": 0.0
        },
        {
            "rating": 1.0,
            "user": "Wilko423",
            "date": "05/04/2019",
            "title": "More credits",
            "body": "I have been using audible for nearly a year now and I can say it has without a doubt opened my mind up to another universe that I hadn’t known about til now, I highly recommend it to anyone who loves books but either doesn’t have the time to physically read them or even has issues concentrating on reading print like myself. This app has changed my life I recommend it to all of my friends regularly and with the subscription you get a new book each month. One suggestion I would have for the makers is possibly adding an option to buy credits in bulk for cheaper prices, sometimes I want to read a new series of books but find myself not wanting to waste credits/$15 on books between 5-10 hours as I can finish that in a day or so, if I had the option to buy more in one go I wouldn’t find myself skipping series that have shorter books at the beginning. Aside from that it’s basically flawless in my eyes, keep up the good work guys!",
            "region": "au",
            "drm_relevance": 0.0
        },
        {
            "rating": 1.0,
            "user": "Missjordanne",
            "date": "03/03/2019",
            "title": "Wish there was a percentage number",
            "body": "I adore Audible, it’s kinda expensive but the selection is unprecedented. It’s so great for encouraging more reading, as you can multitask while consuming a story. I love how there is brand new and popular books on here, and you also don’t have to wait like you might on Libby. In terms of the app, I wish you could purchase through the app. I wish that you could change the timer to view the percentage you were through the book, and that the overall progress timer was visible on books that were loaded in 2 parts. Finally, I wish that there were cost effective subscriptions for multiple books per month as I read maybe 2 audiobooks a week and find that Audible gets expensive so I rotate between this, Libby (which is connected to your library card, meaning that it’s free BUT they will only have a certain amount of copies of a book and you need to wait until a copy is available - like a normal library book - which can be loooong with new or popular books but has a STUNNING app interface that I believe is more intuitive than Audible), and less frequently I’ll listen to Scribd but the selection is average compared to either of the first two I choose and the app isn’t as pleasant as even Audible. Overall, I love Audible because of the range and I would keep it purely based off of that however I also enjoy the interface and the experience of the books. Overall, I",
            "region": "nz",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.4,
            "user": "CaptainJamMan",
            "date": "28/04/2022",
            "title": "Good service, Bad support",
            "body": "Audible was reasonably good while I was using it though some would argue a bit on the pricey side. It’s a good service if you can’t find time to read yourself or just need to relax and listen to a book. If you try and cancel the service, boy are you in for a rough ride. For a start you can’t do this via the mobile app and have to go through their website. When you do eventually find the section and go through with it, there are no guarantees that you won’t continue to be billed. I cancelled and despite my membership saying it’s not active now as well as a confirmation email I was still charged at the end of the following month. Cancelled 21st Feb, membership officially ended on the 3rd of March I believe and then charged again on the 31st. You go through their first call option which is some sort of online call (after fighting disheartened through more roundabouts of help options) and the call just cancels after a few minutes of waiting, repeatedly. Try the toll free number and well guess what, it says it is not currently active!!! Classic scam warning signs but Audible isn’t a scam. I cancelled cause I don’t have a job now but I’m waiting to see whether some of my food money will disappear at the end of this month if I get charged again. Not happy!!",
            "region": "nz",
            "drm_relevance": 0.0
        },
        {
            "rating": 1.0,
            "user": "jajamnz",
            "date": "05/05/2018",
            "title": "Life by Keith Richards",
            "body": "The hilarious opening chapter sets the feel and themes of what’s to follow and left me shaking my head incredulously. Keith can clearly spin a great yarn. Rich descriptions of his childhood in Dartford, detailed a seeming no man’s land of post war Britain trying to find its way from the old to the new. Keith’s guiding lights were the Chicago blues artists, who faded in and faded out across the Atlantic airways through the antennae of his transistor radio. Together with the influence of his musical family, and a chance meeting with Mick Jagger (who lived in a posher part of town) a partnership was forged that became the Rolling Stones. Keith rambles at times, yet he rambles with a fierce hearted loyalty and insight into the populace of musicians, women, staff and personalities, who came and went from his life; some of whom who also shaped the face of the sixties and seventies. It’s a gripping tale. I loved hearing Keith speak himself - such a rich, gravelly and warm voice - a welcome relief from the monotony of Depp’s narration and the south London accented overkill of the second narrator.",
            "region": "nz",
            "drm_relevance": 0.0
        },
        {
            "rating": 1.0,
            "user": "dee kst",
            "date": "27/09/2023",
            "title": "A fantastic non-behavioralist, social justice parenting book",
            "body": "Parenting Beyond Power is awesome! If you are looking for ways to ‘be the change you want to see in the world’ and ‘treat others the way you would like to be treated’ here is an great parenting manual for finding ways to do just that, starting in your home.This audiobook brings together the key elements of NVC, collaborative problem solving, unconditional parenting and social justice parenting in a beautifully presented, easy to understand way.I recommend this book to every parent, it truly has something to offer everyone. If you wish to parent differently to how you were parented, this book will help you tread your own path. If you were parented in a respectful way that aligns with your values this book will provide insight into why it can STILL be hard to let go of 'power over' parenting in times of stress. If you currently parent in an authoritarian way this book provides solid research based reasons to consider the alternatives. Even if you read this book and find it is not for you, it will certainly provide food for thought.I found the content that spoke directly to healing damaging patriarchal, capitalist and racist systems (insidious in W.E.I.R.D. societies) super beneficial. I will refer back to this book whenever I perceive a potential disconnect between my parenting and my values.I can’t wait for a book number 2!",
            "region": "nz",
            "drm_relevance": 0.0
        },
        {
            "rating": 1.0,
            "user": "Molomolo ❤",
            "date": "08/05/2021",
            "title": "Beware citizens of the world",
            "body": "History repeats and I feel the world is yet again facing a perilous onslaught of dangerous far left agendas all converging at once. Cancel culture and woke culture are amongst a variety of groups that have sinister groups backing them. How spoiled are the youth of today, a generation who have never had it so good, yet complain about how unfair life is and how unjust things can be. I say grow up and give thanks to those who walked before you that had something to actually complain about, where injustice was real. This book lays out in broad daylight how tyrannical govt can be and how easy it is to wake up and it’s... too late. Smarten up as this book should be a reminder to never get complacent. I appreciate you making this available and hope all of humanity get the opportunity to read it. With thanks and appreciation.",
            "region": "nz",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.8,
            "user": "bestappevernot",
            "date": "04/02/2022",
            "title": "Complete rubbish",
            "body": "I guess I shouldn’t have had such high expectations but really you would think that by 2022 you could be excused for thinking that apps should just work. This has to be the worst app I’ve ever downloaded. Why can’t you use credits to purchase in app? Why can’t you purchase credits in app? Why is there no link to purchase from search? Why do items I have finally figured out how to purchase say they’ve gone to my library but don’t show in my library in app? Why does the player freeze? If you’ve ever been worried about being ripped off through an app then don’t use this one! The selection of books cannot be beaten but this app is simply useless. I hope the designers have been arrested tied up and receive a sound thrashing every day for the pain they have inflicted on so many. Absolute asscrack. You even get forced to give a one star review even if you want to give none. Don’t use this rubbish!",
            "region": "nz",
            "drm_relevance": 0.0
        },
        {
            "rating": 1.0,
            "user": "Nztracie",
            "date": "17/10/2023",
            "title": "ALL BLACKS Passion in WORDS",
            "body": "Thanks so much to all who endeavoured to put All Black history into such a magnificent book. I was genuinely sad to reach the end. Having moved to NZ from Canada in 2007, I first fell in love with the game watching them play SA in a little pub in Ohakune where so many fans packed the room, it felt like when Canada played Russia in ice hockey. It was there that I first saw grown men fly through the air to victory. I watched sportsmanship that saw the foulest call by a ref, not even register distain on Richie McCaw’s face because he was already getting in position for the next play. There was a physicality to the game but there more skill than I’d ever seen on field of any other game. This book puts into words the journey we all took while Sir Steve Hansen was at the helm. It will always be topical for the game and whether you played or are a fan, you will find it FASCINATING!!!",
            "region": "nz",
            "drm_relevance": 0.0
        },
        {
            "rating": 1.0,
            "user": "DavidDavidson76",
            "date": "24/07/2023",
            "title": "Essential reading to get understanding.",
            "body": "This my third listen to this narration in the last two months. What Mike reveals is too much too absorb in just one reading just as much as Scripture itself. We can never exhaust the depths of The Word our Heavenly Father has given us it is a lifelong study we dare not undertake. Only scholars like  Mike can open up the depths of Revelation in the language of The Word. He was a man raised up and empowered to bring to us who are willing to make effort Mike has lifted my understanding a 1000fold in this year alone. I am 82n years old and still willing to be taught, and our Heavenly Father is enabling me to learn despite my poor education and limited skills. Please i exhort all who seek to know absolute truth do read this book and meg the God of all Creation bless you with understanding as He has me. 🙏 Rob in New Zealand",
            "region": "nz",
            "drm_relevance": 0.0
        },
        {
            "rating": 1.0,
            "user": "Cleolady",
            "date": "13/10/2022",
            "title": "Audible",
            "body": "Fantastic app, I found concentrating in reading very difficult after a major illness and then discovered audible. I credit this site with helping me on the road to recovery as I was no longer bored. Now I am well I can read on the car, getting ready to go out, even before I sleep. Put on the timer either minutes then off to sleep. Can download anywhere , anytime. Always have your library with you. Still the best app. Have been using audible for 5 years. Excellent plus they do listen to us and improve the app. A year later and still the best app.A fee more years of using Audible. I paint in my spare time and find listening to books and painting are the best companions. It is great to do two things I love at the same time. Keep up the good work. 😀😀💜",
            "region": "nz",
            "drm_relevance": 0.0
        },
        {
            "rating": 0.8,
            "user": "Me95419",
            "date": "28/09/2023",
            "title": "Good content, very marginal access to it",
            "body": "I have recently just trialled audible, found a book series I enjoyed listening to. However after finishing the book, and deciding I will happily pay for the next in the series. I discovered that I have no ability at all to buy more credits or anything outside of the 1 book a month. From my perspective my first months use has dried up in a matter of days and the apps inability to allow me to purchase additional books, means that audible from my experience, is largely redundant for most of the monthly duration. I’m not talking about wanting more for my money, simply the ability to spend more of my money in order to continue with a series I enjoyed, seems counter productive to a business, to restrict and limit you ability to spend money in their products or services.",
            "region": "nz",
            "drm_relevance": 0.0
        }
    ]
}